{
    "product_name": "Relentless: From Good to Great to Unstoppable",
    "description": "Fore more than two decades, legendary trainer Tim Grover has taken the greats—Michael Jordan, Kobe Bryant, Dwayne Wade, and dozens more—and made them greater. Now, for the first time ever, he reveals what it takes to get those results, showing you how to be relentless and achieve whatever you desire.Direct, blunt, and brutally honest, Grover breaks down what it takes to be unstoppable: you keep going when everyone else is giving up, you thrive under pressure, you never let your emotions make you weak. In “The Relentless 13,” he details the essential traits shared by the most intense competitors and achievers in sports, business, and all walks of life. Relentless shows you how to trust your instincts and get in the Zone; how to control and adapt to any situation; how to find your opponent’s weakness and attack. Grover gives you the same advice he gives his world-class clients—“don’t think”—and shows you that anything is possible. Packed with previously untold stories and unparalleled insight into the psyches of the most successful and accomplished athletes of our time, Relentless shows you how even the best get better . . . and how you can too.",
    "ratings": "4.4 out of 5 stars",
    "url": "https://www.amazon.com/Relentless-Unstoppable-Tim-S-Grover/dp/1476714207/ref=lp_16327_1_1/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-1"
}{
    "product_name": "Getting to Us: How Great Coaches Make Great Teams",
    "description": "What makes a coach great? How do great coaches turn a collection of individuals into a coherent “us”?&nbsp;&nbsp;Seth Davis, one of the keenest minds in sports journalism, has been thinking about that question for twenty-five years. It’s one of the things that drove him to write the definitive biography of college basketball’s greatest coach, John Wooden,&nbsp;Wooden: A Coach’s Life. But John Wooden coached a long time ago. The world has changed, and coaching has too, tremendously. Seth Davis decided to embark on a proper investigation to get to the root of the matter.&nbsp; In&nbsp;Getting to Us, Davis probes and prods the best of the best from the landscape of active coaches of football and basketball, college and pro—from Urban Meyer, Dabo Swinney, and Jim Harbaugh to Mike Krzyzewski, Tom Izzo, Jim Boeheim, Brad Stevens, Geno Auriemma, and Doc Rivers—to get at the fundamental ingredients of greatness in the coaching sphere. There’s no single right way, of course—part of the great value of this book is Davis’s distillation of what he has learned about different types of greatness in coaching, and what sort of leadership thrives in one kind of environment but not in others. Some coaches have thrived at the college level but not in the pros. Why? What’s the difference? Some coaches are stern taskmasters, others are warm and cuddly; some are brilliant strategists but less emotionally involved with their players, and with others it’s vice versa. In&nbsp;Getting to Us, we come to feel a deep connection with the most successful and iconic coaches in all of sports—big winners and big characters, whose stories offer much of enduring interest and value.",
    "ratings": "3.0 out of 5 stars",
    "url": "https://www.amazon.com/Getting-Us-Great-Coaches-Teams/dp/073522272X/ref=lp_16327_1_2/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-2"
}{
    "product_name": "Basketball (and Other Things): A Collection of Questions Asked, Answered, Illustrated",
    "description": "SELECTED BY PRESIDENT BARACK OBAMA AS ONE OF THE BEST BOOKS HE READ IN 2017.***No. 1 New York Times Bestseller******Best Nonfiction Books of 2017 selection by Barnes &amp; Noble******Best Humor and Entertainment Books of 2017 selection by Amazon***.Michael Jordan is the acknowledged greatest basketball player of all-time, but what season was Michael Jordan the best version of Michael Jordan? Who's in The Disrespectful Dunk Hall of Fame? What's allowed and absolutely not allowed in a game of pickup basketball? BASKETBALL (AND OTHER THINGS)&nbsp;presents readers with a set of pivotal and ridiculous questions from basketball history, providing arguments and answers, explained with the wit and wisdom that is unique to Shea Serrano. Serrano breaks down debates that NBA fans didn't even know they needed, from the authoritative (Which NBA championship was the most important to the league?) to the fantastical (If you could assign different values to different shots throughout basketball history, what would they be and why?), with tangents and footnotes laser-ing out in all different directions, because that's how talking about basketball works, because that's how basketball works.&nbsp;.With incredible art from Arturo Torres, this book is a must-have for anyone who has ever stayed up late into the night debating basketball's greatest moments, what-ifs, stories, and legends, or for those who are discovering the mythology of basketball for the first time.",
    "ratings": "4.9 out of 5 stars",
    "url": "https://www.amazon.com/Basketball-Other-Things-Collection-Illustrated/dp/1419726471/ref=lp_16327_1_3/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-3"
}{
    "product_name": "From the Outside: My Journey Through Life and the Game I Love",
    "description": "The record-holding two-time National Basketball Association champion reflects on his work ethic, his on-the-court friendships and rivalries, the&nbsp;great teams he's played for,&nbsp;and what it takes to have a long and successful career in this thoughtful, in-depth memoir.Playing in the NBA for&nbsp;eighteen years, Ray Allen won championships with the Boston Celtics and the Miami Heat and entered the record books as the original king of the three-point shot. Known as one of the hardest-working and highest-achieving players in NBA history, this most dedicated competitor was legendary for his sharp shooting. From the Outside,&nbsp;complete with a foreword by Spike Lee,&nbsp;is his story in his words: a no-holds-barred look at his life and career, filled with behind-the-scenes stories and surprising revelations about the game he has always cherished.Allen talks openly about his fellow players, coaches, owners, and friends, including LeBron James, Kobe Bryant, and Kevin Garnett. He reveals how, as a kid growing up in a military family, he learned about responsibility and respect—the key to making those perfect free throws and critical three-point shots.From the Outside is the portrait of a gifted athlete and a serious man with a strongly defined philosophy about the game and the right way it should be played—a philosophy that, at times, set him apart from colleagues and coaches, while inspiring so many others, and lead to the most pivotal shot of his career: the unforgettable 3-pointer in the final seconds of Game 6 of the 2013 NBA finals against the San Antonio Spurs. Throughout, Allen makes clear that success in basketball is as much about what happens off the court as on, that devotion and commitment are the true essence of the game—and of life itself.",
    "ratings": "3.8 out of 5 stars",
    "url": "https://www.amazon.com/Outside-Journey-Through-Life-Game/dp/0062675478/ref=lp_16327_1_4/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-4"
}{
    "product_name": "Basketball: Great Writing About America's Game (Library of America)",
    "description": "From the street game to March Madness to Jordan and LeBron, the greatest writing about the grit, grace, and glory of basketballMade in America, basketball is a sport that stirs a national passion, reaching fever pitch during the NCAA's March Madness and the NBA Finals. Masterfully assembled by longtime Sports Illustrated writer Alexander Wolff, Basketball spans eight decades to bring together a dream team of writers as awe-inspiring and endlessly inventive as the game itself. Here are in-depth profiles of the legends of the hardcourt--Russell, Kareem, Bird, Jordan, and LeBron--and storied franchises such as the Knicks and Celtics, along with dazzling portraits of the flash and sizzle of playground ball and more personal reflections on the game by some of America's finest writers, among them Donald Hall, John Edgar Wideman, and Pat Conroy. Highlights include James Naismith recalling how he invented the game that would go on to conquer the world; John McPhee capturing the ever-disciplined Bill Bradley as a Princeton Tiger; Peter Goldman's indelible portrait of the life and death of a Harlem Globetrotter; and Michael Lewis's account of the brave new world of NBA analytics. Classic journalism about inner-city basketball by Pete Axthelm, Rick Telander, and Darcy Frey is joined by stories of the game's popularity across America, from the heartland of Hoosier country to an Apache Reservation in Arizona.Cover: Copyright © 1996 by NBAE. Photo by Nathaniel S. Butler/NBAE/Getty Images.",
    "ratings": "There are no customer reviews yet.",
    "url": "https://www.amazon.com/Basketball-Writing-Americas-Library-America/dp/1598535560/ref=lp_16327_1_5/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-5"
}{
    "product_name": "Wooden: A Lifetime of Observations and Reflections On and Off the Court",
    "description": "NATIONAL BESTSELLER \"I am just a common man who is true to his beliefs.\"--John Wooden  Evoking days gone by when coaches were respected as much for their off-court performances as for their success on the court, Wooden presents the timeless wisdom of legendary basketball coach John Wooden. In honest and telling passages about virtually every aspect of life, Coach shares his personal philosophy on family, achievement, success, and excellence. Raised on a small farm in south-central Indiana, he offers lessons and wisdom learned throughout his career at UCLA, and life as a dedicated husband, father, and teacher. These lessons, along with personal letters from Bill Walton, Denny Crum, Kareem Abdul-Jabbar, and Bob Costas, among others, have made Wooden: A Lifetime of Observations and Reflections on and off the Court an inspirational classic.",
    "ratings": "4.7 out of 5 stars",
    "url": "https://www.amazon.com/Wooden-Lifetime-Observations-Reflections-Court/dp/0809230410/ref=lp_16327_1_6/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-6"
}{
    "product_name": "On the Court with...Stephen Curry",
    "description": "Discover the amazing achievements of fan favorite two-time MVP Stephen Curry in this brand-new, comprehensive biography.Steph Curry is a two-time NBA Most Valuable Player, record-breaker, and Finals champion who electrifies fans with his incredible on-court feats. He's also a dedicated husband, father, and philanthropist who inspires people on and off the court. Learn more about this remarkable athlete in this biography, complete with stats and photographs.",
    "ratings": "5.0 out of 5 stars",
    "url": "https://www.amazon.com/Court-Stephen-Curry-Matt-Christopher/dp/0316509582/ref=lp_16327_1_7/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-7"
}{
    "product_name": "Leading with the Heart: Coach K's Successful Strategies for Basketball, Business, and Life",
    "description": "Leading with the Heart: Coach K's Successful Strategies for Basketball, Business, and Life",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/Leading-Heart-Successful-Strategies-Basketball/dp/0446676780/ref=lp_16327_1_8/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-8"
}{
    "product_name": "CSCS Study Guide: Exam Prep &amp; Practice Exam Questions for the NSCA Certified Strength &amp; Conditioning Specialist Test",
    "description": "CSCS Study Guide: Exam Prep &amp; Practice Exam Questions for the NSCA Certified Strength &amp; Conditioning Specialist Test  Developed for test takers trying to achieve a passing score on the CSCS exam, this comprehensive study guide includes:  •Quick Overview •Test-Taking Strategies •Introduction to the CSCS exam •Exercise Sciences •Nutrition •Program Design •Organization and Administration •Practice Questions •Detailed Answer Explanations  Each section of the test has a comprehensive review that goes into detail to cover all of the content likely to appear on the CSCS exam.  The practice test questions are each followed by detailed answer explanations. If you miss a question, it's important that you are able to understand the nature of your mistake and how to avoid making it again in the future. The answer explanations will help you to learn from your mistakes and overcome them.  Understanding the latest test-taking strategies is essential to preparing you for what you will expect on the exam. A test taker has to not only understand the material that is being covered on the test, but also must be familiar with the strategies that are necessary to properly utilize the time provided and get through the test without making any avoidable errors.  Anyone planning to take the CSCS exam should take advantage of the review material, practice test questions, and test-taking strategies contained in this study guide.",
    "ratings": "4.7 out of 5 stars",
    "url": "https://www.amazon.com/CSCS-Study-Guide-Conditioning-Specialist/dp/1628453923/ref=lp_16327_1_9/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-9"
}{
    "product_name": "Old School Grit: Times May Change, But the Rules for Success Never Do (Sports for the Soul) (Volume 2)",
    "description": "The 15 Unbreakable Rules for Building Grit and Achieving Your Dreams! Psychologists tell us that the secret to a successful and happy life, more than anything else, is something called GRIT. Defined as the willpower to persevere with passion and a sense of purpose, research shows that grit is what matters most in whether a person succeeds or fails. That same research shows that previous generations had a lot more grit than today’s younger generations. This isn’t surprising. After all, most of us would agree that those older, wiser, and tougher members of the Greatest Generation are prime examples of what it means to persevere, to never back down, and to make sacrifices for a greater purpose. We could all use more of the OLD SCHOOL GRIT they embraced. In this inspirational fable, Bob Flanagan represents the voice of old school grit. A legendary college basketball coach who thinks like John Wooden and talks like Mike Ditka, Flanagan is entering the final days of his coaching career. While his team tries to advance through the NCAA postseason tournament, Flanagan uses his last days as a coach to write his grandchildren letters revealing the rules for a successful and happy life. The rules of grit. Though Coach Flanagan’s letters are intended for his grandchildren, they might as well be for America in general. This is a man who lives by the old school code of faith, family, courage, and character; and he believes too many people have gone soft these days. They give up on their dreams too easily. They whine, complain, and pass the blame. They spend all their time and energy trying to avoid challenges instead of bucking up and powering through them. Flanagan’s letters are a rallying cry for toughening up and building grit. His fifteen rules provide a clear path to success in any endeavor.  Consider this book an instruction manual for getting back to the values that truly lead to success and developing the type of old school grit that will get you through anything.",
    "ratings": "4.4 out of 5 stars",
    "url": "https://www.amazon.com/Old-School-Grit-Change-Success/dp/0692816429/ref=lp_16327_1_10/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-10"
}{
    "product_name": "Number Tracing Book for Preschoolers: Number tracing books for kids ages 3-5,Number tracing workbook,Number Writing Practice Book,Number Tracing Book. Learning the easy Maths for kids (Volume 2)",
    "description": "Number Tracing Book for Preschoolers Number Tracing Books for Kids Ages 3-5, Number Tracing Workbook,Number Writing Practice Book Number Tracing Book for Preschoolers is a fun handwriting workbook with complete step-by-step instructions on how to write every number, from start to finish. This Number Tracing Book includes handwriting paper with fun, playful images to keep your little ones entertained. Our number trace book starts out your child by tracing individual numbers, but also lets them learning the easy maths. Our Number Tracing Workbook includes two parts: - Part one: The individual number from 1-10 included hand counting - Part two: Provides practice for easy maths. Learning the Basic Maths and more Activities such as Counting, Coloring.",
    "ratings": "There are no customer reviews yet.",
    "url": "https://www.amazon.com/Number-Tracing-Book-Preschoolers-workbook/dp/1981133127/ref=lp_16327_1_11/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-11"
}{
    "product_name": "The Book of Basketball: The NBA According to The Sports Guy",
    "description": "The NBA according to The Sports GuyForeword by Malcolm Gladwell &nbsp; Newly updated with fresh takes on LeBron, Kobe, the Celtics &amp; more*Bill Simmons, the wildly opinionated and thoroughly entertaining basketball addict known to millions as ESPN.com’s The Sports Guy, has written the definitive book on the past, present, and future of the NBA. From the age-old question of who actually won the rivalry between Bill Russell and Wilt Chamberlain to the one about which team was truly the best of all time, Simmons opens—and then closes, once and for all—every major pro basketball debate. Then he takes it further by completely reevaluating not only how NBA Hall of Fame inductees should be chosen but how the institution must be reshaped from the ground up, the result being the Pyramid: Simmons’s one-of-a-kind five-level shrine to the ninety-six greatest players in the history of pro basketball. And ultimately he takes fans to the heart of it all, as he uses a conversation with one NBA great to uncover that coveted thing: The Secret of Basketball.Comprehensive, authoritative, controversial, hilarious, and impossible to put down (even for Celtic-haters), The Book of Basketball offers every hardwood fan a courtside seat beside the game’s finest, funniest, and fiercest chronicler.*Including even more footnotes!",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/Book-Basketball-NBA-According-Sports/dp/0345520106/ref=lp_16327_1_12/140-8852340-1272438?s=books&ie=UTF8&qid=1522384675&sr=1-12"
}{
    "product_name": "Gehrig and the Babe: The Friendship and the Feud",
    "description": "The legendary achievements of Babe Ruth and Lou Gehrig are undeniable hallmarks of baseball history. Much has been written about the two men as teammates, but Ruth and Gehrig's relationship away from the field is rarely, if ever, explored. In Gehrig and the Babe, Tony Castro portrays Ruth and Gehrig for what they were: American icons who were remarkably different men. For the first time, readers will learn about a friendship driven apart, an enduring feud which wove its way in and out of their Yankees glory years and chilled their interactions until July 4, 1939—Lou Gehrig Day at Yankee Stadium—when Gehrig’s famous farewell address thawed out their stone silence.",
    "ratings": "There are no customer reviews yet.",
    "url": "https://www.amazon.com/Gehrig-Babe-Friendship-Tony-Castro/dp/162937251X/ref=sr_1_13?s=books&ie=UTF8&qid=1522384711&sr=1-13"
}{
    "product_name": "Coach Wooden and Me: Our 50-Year Friendship On and Off the Court",
    "description": "Instant New York Times and USA Today BestsellerPresident Barack Obama's Favorite Book of 2017A Boston Globe and Huffington Post Best Book of 2017 PickKareem Abdul-Jabbar explores his 50-year friendship with Coach John Wooden, one of the most enduring and meaningful relationships in sports history.When future NBA legend Kareem Abdul-Jabbar was still an 18-year-old high school basketball prospect from New York City named Lew Alcindor, he accepted a scholarship from UCLA largely on the strength of Coach John Wooden's reputation as a winner. It turned out to be the right choice, as Alcindor and his teammates won an unprecedented three NCAA championship titles. But it also marked the beginning of one of the most extraordinary and enduring friendships in the history of sports. In COACH WOODEN AND ME, Abdul-Jabbar reveals the inspirational story of how his bond with John Wooden evolved from a history-making coach-player mentorship into a deep and genuine friendship that transcended sports, shaped the course of both men's lives, and lasted for half a century.COACH WOODEN AND ME is a stirring tribute to the subtle but profound influence that Wooden had on Kareem as a player, and then as a person, as they began to share their cultural, religious, and family values while facing some of life's biggest obstacles. From his first day of practice, when the players were taught the importance of putting on their athletic socks properly, to gradually absorbing the sublime wisdom of Coach Wooden's now famous \"Pyramid of Success\"; to learning to cope with the ugly racism that confronted black athletes during the turbulent Civil Rights era as well as losing loved ones, Abdul-Jabbar fondly recalls how Coach Wooden's fatherly guidance not only paved the way for his unmatched professional success but also made possible a lifetime of personal fulfillment.Full of intimate, never-before-published details and delivered with the warmth and erudition of a grateful student who has learned his lessons well, COACH WOODEN AND ME is at once a celebration of the unique philosophical outlook of college basketball's most storied coach and a moving testament to the all-conquering power of friendship.",
    "ratings": "4.8 out of 5 stars",
    "url": "https://www.amazon.com/Coach-Wooden-Me-50-Year-Friendship/dp/145554227X/ref=sr_1_14?s=books&ie=UTF8&qid=1522384711&sr=1-14"
}{
    "product_name": "Eleven Rings: The Soul of Success",
    "description": "The inside story of one of basketball's most legendary and game-changing figuresA New York Times bestseller During his storied career as head coach of the Chicago Bulls and Los Angeles Lakers, Phil Jackson won more championships than any coach in the history of professional sports. Even more important, he succeeded in never wavering from coaching his way, from a place of deep values. Jackson was tagged as the “Zen master” half in jest by sportswriters, but the nickname speaks to an important truth: this is a coach who inspired, not goaded; who led by awakening and challenging the better angels of his players’ nature, not their egos, fear, or greed. This is the story of a preacher’s kid from North Dakota who grew up to be one of the most innovative leaders of our time. In his quest to reinvent himself, Jackson explored everything from humanistic psychology and Native American philosophy to Zen meditation. In the process, he developed a new approach to leadership based on freedom, authenticity, and selfless teamwork that turned the hypercompetitive world of professional sports on its head. In Eleven Rings, Jackson candidly describes how he:&nbsp;&nbsp;&nbsp;•&nbsp; Learned the secrets of mindfulness and team chemistry while playing for the champion New York Knicks in the 1970s&nbsp;&nbsp;&nbsp;•&nbsp; Managed Michael Jordan, the greatest player in the world, and got him to embrace selflessness, even if it meant losing a scoring title&nbsp;&nbsp;&nbsp;•&nbsp; Forged successful teams out of players of varying abilities by getting them to trust one another and perform in sync&nbsp;&nbsp;&nbsp;•&nbsp; Inspired Dennis Rodman and other “uncoachable” personalities to devote themselves to something larger than themselves&nbsp;&nbsp;&nbsp;•&nbsp; Transformed Kobe Bryant from a rebellious teenager into a mature leader of a championship team.Eleven times, Jackson led his teams to the ultimate goal: the NBA championship—six times with the Chicago Bulls and five times with the Los Angeles Lakers. We all know the legendary stars on those teams, or think we do. What Eleven Rings shows us, however, is that when it comes to the most important lessons, we don’t know very much at all. This book is full of revelations: about fascinating personalities and their drive to win; about the wellsprings of motivation and competition at the highest levels; and about what it takes to bring out the best in ourselves and others.",
    "ratings": "4.6 out of 5 stars",
    "url": "https://www.amazon.com/Eleven-Rings-Success-Phil-Jackson/dp/0143125346/ref=sr_1_15?s=books&ie=UTF8&qid=1522384711&sr=1-15"
}{
    "product_name": "How to Be Better At Basketball in 21 days: The Ultimate Guide to Drastically Improving Your Basketball Shooting, Passing and Dribbling Skills (Basketball in Black&amp;White)",
    "description": "Basketball drills coupled with strong fundamentals are the key for any top basketball player. “You can practice basketball shooting eight hours a day, but if your technique is wrong, then all you become is very good at shooting the wrong way. Get the fundamentals down and the level of everything you do will rise.”- Michael Jordan.  People believe that in order to excel at anything in life practice is absolutely essential. What most people will not tell you is that without technique, discipline and character no amount of practice will help you achieve your goal, especially when it comes to basketball.  James Wilson has been coaching basketball in 20 countries over the past 30 years and can he has got considerable experience in teaching the game. Perhaps he knows more about it than an average coach. Throughout this time James Wilson has developed a core philosophy regarding the game, which works on several important skills for effective basketball conditioning. Today he wants to share this unique knowledge with you.  This book, \"How to Be Better At Basketball in 21 days\" is a rigorous program designed for amateurs and professionals alike. It is guaranteed to improve your form, develop new basketball skills and get you in perfect conditioning before the start of a new season.  You will also discover: • Basketball drills that can help you develop basic skills and challenge more advanced players. • Tips on how to increase your basketball shooting accuracy. • Most effective ways for better ball handling and better crossovers. • Why you have been failing to improve your basketball skills! • Ways to get stronger at basketball and improve your athleticism. • How to toughen your mental state so that you play with confidence, courage, and control. • How to be a key player in helping your team win basketball games!  Grab your copy now and follow our unique 21-Day Program that will take your basketball skills to the next level.  Don't forget to claim a FREE Kindle version with your purchase of Paperback copy! Check Out What Others Are Saying... \"Everything any basketball player that wants to improve needs to read. This will help any player at any level of play.\"  \"This book is the best. If you want to get better at basketball get this book. I highly recommend it.\" - Rocko (USA)",
    "ratings": "4.4 out of 5 stars",
    "url": "https://www.amazon.com/How-Better-Basketball-days-Drastically/dp/1520883870/ref=sr_1_16?s=books&ie=UTF8&qid=1522384711&sr=1-16"
}{
    "product_name": "The Chicago Tribune Book of the Chicago White Sox: A Decade-by-Decade History",
    "description": "The Chicago Tribune Book of the Chicago White Sox is a decade-by-decade look at one of the American League's original eight teams, starting with the franchise's Windy City beginnings in 1900 as the Chicago White Stockings (the former name of crosstown rivals the Cubs) and ending with the current team.For more than a century, the Chicago Tribune has documented every Sox season through original reporting, photography, and box scores. For the first time, this mountain of Sox history has been mined and curated by the paper's sports department into a single one-of-a-kind volume. Each era in Sox history includes its own timeline, profiles of key players and coaches, and feature stories that highlight it all, from the heavy hitters to the no-hitters to the one-hit wonders.To be a Sox fan means to know breathtaking highs and dramatic lows. The team's halcyon days―starting with the championship it won during the first official season of the newly formed American League in 1901―have always been punctuated with doldrums and stormy stretches, including a period of time in the '80s when it looked likely that the team would leave Chicago. But with the diehard support of their fans, the \"Good Guys\" have always made a comeback―including the team's landmark 2005 World Series win, the first by any Chicago major league team in 88 years. This book records it all.The award-winning journalists, photographers, and editors of the Chicago Tribune have produced a comprehensive collector's item that every Sox fan will love.",
    "ratings": "There are no customer reviews yet.",
    "url": "https://www.amazon.com/Chicago-Tribune-White-Decade-Decade/dp/157284244X/ref=sr_1_17?s=books&ie=UTF8&qid=1522384711&sr=1-17"
}{
    "product_name": "Michael Jordan: The Life",
    "description": "The definitive biography of the most legendary basketball player of all time.Drawing on personal relationships with Jordan's coaches; countless interviews with friends, teammates, family members, and Jordan himself; and decades in the trenches covering Jordan in college and the pros, Roland Lazenby provides the first truly definitive study of Jordan: the player, the icon, and the man.When most people think of Michael Jordan, they think of the incredible moments so ingrained in basketball history that they have their own names: The Shrug, The Shot, The Flu Game. But for all his greatness, there's also a dark side to Jordan: a ruthless competitor, a gambler. There's never been a biography that balanced these personas-until now.",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/Michael-Jordan-Life-Roland-Lazenby/dp/031619476X/ref=sr_1_18?s=books&ie=UTF8&qid=1522384711&sr=1-18"
}{
    "product_name": "Unscripted: The Unpredictable Moments That Make Life Extraordinary",
    "description": "Ernie Johnson Jr. has been in the game a long time. With one of the most recognized voices in sports broadcasting, he is a tireless perfectionist when it comes to preparing and delivering his commentary. Yet he knows that some of sports' greatest triumphs--and life's greatest rewards--come from those unscripted moments you never anticipated. In this heartfelt, gripping autobiography, the three-time Sports Emmy Award-winner and popular host of TNT's Inside the NBA provides a remarkably candid look at his life both on and off the screen. From his relationship with his sportscaster father to his own rise to the top of sports broadcasting, from battling cancer to raising six children with his wife, Cheryl, including a special needs child adopted from Romania, Ernie has taken the important lessons he learned from his father and passed them on to his own children. This is the untold story, the one Ernie has lived after the lights are turned off and the cameras stop rolling. Sports fans, cancer survivors, fathers and sons, adoptive parents, those whose lives have been touched by a person with special needs, anyone who loves stories about handling life's surprises with grace--Unscripted is for all of these.",
    "ratings": "4.8 out of 5 stars",
    "url": "https://www.amazon.com/Unscripted-Unpredictable-Moments-That-Extraordinary/dp/080107410X/ref=sr_1_19?s=books&ie=UTF8&qid=1522384711&sr=1-19"
}{
    "product_name": "Retro Air Jordan: Shoes: A Detailed Coloring Book for Adults and Kids (Retro Jordan) (Volume 1)",
    "description": "Hours of fun coloring and learning about your favorite Air Jordan shoes from the past or designing the new Air Jordan's for the future!   Includes:   -A 1-page bio behind the Jordan Brand, the history of how Nike signed Michael Jordan (when he really wanted Adidas!) and the details of the original endorsement contract!  - High quality illustrations of Air Jordan 1 through Air Jordan 23 with the history behind each sneaker and it's design!  - 5 different 'design-your-own-Jordan' templates  - Many pages of Jordan Extras  - Sample pages from 2nd book in series: \"Michael Jordan's Greatest Moments: An Inspirational Coloring Book Biography for Adults and Kids\"   80 pages, printed on white paper with no backside printing (1 illustration per page).   If you liked this book, you will love Anthony Curcio's newest release \"NBA Design: Shoes, Logos and Jerseys: The Ultimate Creative Coloring Book for Adults and Kids! \"   NBA Design includes all 30 team logos, jerseys, over 15 of today's hottest shoes to color and of course a 'design your own center' that any basketball fan will love! The ultimate gift idea!",
    "ratings": "4.9 out of 5 stars",
    "url": "https://www.amazon.com/Retro-Air-Jordan-Detailed-Coloring/dp/1543279961/ref=sr_1_20?s=books&ie=UTF8&qid=1522384711&sr=1-20"
}{
    "product_name": "Don't Put Me In, Coach: My Incredible NCAA Journey from the End of the Bench to the End of the Bench",
    "description": "An irreverent, hilarious insider's look at big-time NCAA basketball, through the eyes of the nation's most famous benchwarmer and author of the popular blog ClubTrillion.com (3.6m visits!). Mark Titus holds the Ohio State record for career wins, and made it to the 2007 national championship game. You would think Titus would be all over the highlight reels. You'd be wrong. &nbsp; In 2006, Mark Titus arrived on Ohio State's campus as a former high school basketball player who aspired to be an orthopedic surgeon. Somehow, he was added to the elite Buckeye basketball team, given a scholarship, and played alongside seven future NBA players on his way to setting the record for most individual career wins in Ohio State history. Think that's impressive? In four years, he scored a grand total of nine—yes, nine—points. This book will give readers an uncensored and uproarious look inside an elite NCAA basketball program from Titus's unique perspective. In his four years at the end of the bench, Mark founded his wildly popular blog Club Trillion, became a hero to all guys picked last, and even got scouted by the Harlem Globetrotters. Mark Titus is not your average basketball star. This is a wild and completely true story of the most unlikely career in college basketball. A must-read for all fans of March Madness and college sports!",
    "ratings": "4.2 out of 5 stars",
    "url": "https://www.amazon.com/Dont-Put-Me-Coach-Incredible/dp/0307745384/ref=sr_1_21?s=books&ie=UTF8&qid=1522384711&sr=1-21"
}{
    "product_name": "Jump Attack: The Formula for Explosive Athletic Performance, Jumping Higher, and Training Like the Pros",
    "description": "Legendary trainer Tim Grover’s internationally acclaimed training program used by the pros, including Michael Jordan and Kobe Bryant—now completely revised, updated, and expanded, with 100 new photos.Since 1989 when Tim Grover began training Michael Jordan, hundreds of elite competitors have turned to Grover to become stronger, faster, and more powerful, both physically and mentally. From Jordan to Kobe Bryant to Dwyane Wade and countless other superstars, Grover’s revolutionary methods have made the best even better, year after year.  In Jump Attack, Grover shares the revolutionary program he uses to train the pros. A fitness bible for athletes around the world, this three-phase, twelve-week program has been completely updated with new exercises and workouts as well as cutting-edge information on training, nutrition, longevity, injury prevention, and more. Devised for explosive power, quickness, endurance, and agility, this intensely challenging workout pushes athletes out of their comfort zones, tests their capacity to go harder, and turns “I can’t” into “Just try and stop me.”  You don’t have to be an elite athlete to benefit from Grover’s program—but you can attain the mindset of a champion through the physical program outlined in this complete plan. Says Grover: “This is how my pros do it. If you want to become more explosive, stronger, and faster, if you want to jump higher and improve your overall athletic performance in any sport, this is exactly how we do it today: This program is the difference between jumping and taking flight.”",
    "ratings": "4.3 out of 5 stars",
    "url": "https://www.amazon.com/Jump-Attack-Explosive-Athletic-Performance/dp/1476714401/ref=sr_1_22?s=books&ie=UTF8&qid=1522384711&sr=1-22"
}{
    "product_name": "The Legends Club: Dean Smith, Mike Krzyzewski, Jim Valvano, and an Epic College Basketball Rivalry",
    "description": "On March 18, 1980, the Duke basketball program announced the hiring of Mike Krzyzewski, the man who would restore glory to the team. The only problem: no one knew who Krzyzewski was. Nine&nbsp;days later, Jim Valvano was hired by North Carolina State to be their new head coach. The hiring didn't raise as many eyebrows, but the two new coaches had a similar goal: to unseat North Carolina's Dean Smith as the king of college basketball. And just like that, the most sensational competitive decade in history was about to unfold. In the skillful hands of John Feinstein, The Legends Club captures an era in American sport and culture, documenting the inside view of a decade of absolutely incredible competition. Feinstein pulls back the curtain on the recruiting wars, the intensely personal competition that wasn't always friendly, the enormous pressure and national stakes, and the battle for the very soul of college basketball.",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/Legends-Club-Krzyzewski-Valvano-Basketball/dp/0804173176/ref=sr_1_23?s=books&ie=UTF8&qid=1522384711&sr=1-23"
}{
    "product_name": "Golden: The Miraculous Rise of Steph Curry",
    "description": "The #1 national bestseller and inside story of Steph Curry, the greatest shooter basketball has ever seen.Golden is the first book to provide an all-access look at Steph Curry and the team that has fueled Dub Nation—by longtime Warriors beat reporter and Bay Area News Group sports columnist Marcus Thompson, the go-to expert on all things Golden State. A lifelong Warriors fan turned insider Thompson is uniquely qualified to tell the definitive story of a singular talent, pulling back the curtain on the crazy work ethic and on-court intensity that make Curry great—and the emphasis on family and faith that keeps him grounded.  Combining the competitive grit and fun-loving spirit of his mother with the mild demeanor, easy charm, and sharp shooting of his father, former NBA player Dell Curry, Steph Curry derives support and strength from his close-knit kin and his commitment to Christianity. This hard-working, wholesome image however is both a blessing and curse in a League of big personalities. Thompson unravels the complicated underpinnings of the Steph Curry hate with a nuanced analysis of how class and complexion come into play when a child with an NBA pedigree becomes the face of a sport traditionally honed on inner-city black top and dominated by the less privileged. With unprecedented access, Thompson draws from exclusive interviews with Steph Curry, his family, his teammates, Coach Steve Kerr, and the Warriors owners to bring readers inside the locker room and courtside with this remarkable athlete and man.",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/Golden-Miraculous-Rise-Steph-Curry/dp/1501147846/ref=sr_1_24?s=books&ie=UTF8&qid=1522384711&sr=1-24"
}{
    "product_name": "We Changed the Game",
    "description": "WE CHANGED THE GAME is a story-the real story-about the very beginning of the Indiana Pacers professional basketball team. It's about the laughable new league founded in the 1960's in which the Pacers got their start as a team, the American Basketball Association (ABA), which gave many unsung players a shot or a second chance to make it in pro basketball but faced constant struggles during its brief existence from 1967-1976 before it merged with the NBA. During those early days in the ABA league, the Indiana Pacers captured three ABA league championship titles. But also-and only known by a select few-the Pacers, and the ABA league as a whole, barely survived through some incredibly close calls and financial fiascos, facing the brink of extinction more than once. But it was with the unwavering support of Pacers fans, very creative negotiating by Pacers' co-founder and team protector Richard Tinkham, an ABA-NBA league merger, and two Indianapolis-based real estate legends that ultimately saved the ABA and secured the Pacers' future as one of the top-contending professional basketball teams in the country. The love that Indiana basketball fans had for the Pacers also triggered the explosion of downtown Indianapolis, transforming it into a vibrant, progressive state capital over these past 50 years. Through the eyes of Robin Miller, Richard Tinkham and Bob Netolicky who were there through it all, sit back and enjoy one of the most improbable and inspirational stories in professional sports history. The Pacers and the ABA league proved that with big dreams, loyalty and perseverance, even the impossible really can be possible... and ordinary people truly can change the game.",
    "ratings": "5.0 out of 5 stars",
    "url": "https://www.amazon.com/We-Changed-Game-Bob-Netolicky/dp/0976444380/ref=sr_1_25?s=books&ie=UTF8&qid=1522384714&sr=1-25"
}{
    "product_name": "Stuff Good Players Should Know",
    "description": "Stuff Good Players Should Know may very well be the best book ever written for basketball players. It is conversational and easy to understand, yet filled with subtle insights into the game of basketball. STUFF is page after page of creative concepts, common sense, and special tips that can not be found anywhere else. STUFF is like having a coach right beside you, in your room, discussing the fine points of the game. Basketball fans will enjoy it, but players won't do without it.",
    "ratings": "5.0 out of 5 stars",
    "url": "https://www.amazon.com/Stuff-Good-Players-Should-Know/dp/0983938024/ref=sr_1_26?s=books&ie=UTF8&qid=1522384714&sr=1-26"
}{
    "product_name": "Sneakerhead Coloring book",
    "description": "&nbsp;  Introducing the world's first and only real sneakerhead coloring book made by sneakerheads for sneakerheads.&nbsp;&nbsp;If you love our Air Jordan Coloring Book you are going to really love this Sneakerhead coloring book. Coloring is no longer only for kids, countless studies have proven that coloring relaxes the mind, calms the spirit and reduces stress, which is why it is becoming popular among busy adults. With this coloring book, you can reminisce on your favorite throwback sneaker designs or discover new ones that are hot right now as you color the 100+ pages of our Sneakerhead Coloring Book for adults!&nbsp;Featuring a wide variety of classic shoe designs, including retro styles such as dunks, Nike's Air Max and Air Force 1, and much much more. This adult coloring book is hours of creative fun and wonderful gift idea for the sneakerhead in your life. Original Sneaker Designs By Troy DaVinci You Can't Find Nowhere else on the planet, Offering over 100 pages the Sneakerhead Coloring Book allows you to express your creativity and entertain yourself for hours! Including over 30 of your favorite shoes from the past two decades, this coloring book really is a sneaker lovers dream. Some of the shoes included within the pages of our coloring book are KD's, Dunks, Yeezy's, Air Mags, Kobes and a whole lot more.&nbsp;Coloring is beneficial for both children and adults as it is known to decrease stress and encourage artistic expression. You can use the pages of our coloring book to custom design your next pair of sneakers or simply occupy your mind after a long day at work Made in the USA!Things you are getting. &nbsp;Click on add to cart NOWWorld First Sneakerhead Coloring Book&nbsp;Original Sneaker Designs By Troy Da Vinci You Can't Find&nbsp;anywhere&nbsp;elseTwo Pages of each shoe, so you can color the same sneaker twiceover 30 different designs&nbsp;Color with Crayon, Color pencil, Watercolor, Color marker&nbsp;Made &nbsp;in the USA!High-Quality White Art Paper&nbsp;Sneakerhead collector itemFun for all agesStress Relief Tool For Relaxing &nbsp;Fast Shipping worldwide &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; ",
    "ratings": "4.8 out of 5 stars",
    "url": "https://www.amazon.com/Sneakerhead-Coloring-book-Davinci/dp/0692733183/ref=sr_1_27?s=books&ie=UTF8&qid=1522384714&sr=1-27"
}{
    "product_name": "Praxis II Social Studies Content Knowledge 5081 Study Guide: Test Prep &amp; Practice Test Questions for the Praxis 2 Social Studies Exam",
    "description": "Praxis II Social Studies Content Knowledge 5081 Study Guide: Test Prep &amp; Practice Test Questions for the Praxis 2 Social Studies Exam  Developed for test takers trying to achieve a passing score on the Praxis II Social Studies Content Knowledge test, this comprehensive study guide includes:  •Quick Overview •Test-Taking Strategies •Introduction to the Praxis II Social Studies Test •United States History •World History •Government /Civics/Political Science •Geography •Economics •Behavorial Sciences •Practice Questions •Detailed Answer Explanations  Each section of the test has a comprehensive review that goes into detail to cover all of the content likely to appear on the Praxis II Social Studies Content Knowledge test.  The practice test questions are each followed by detailed answer explanations. If you miss a question, it's important that you are able to understand the nature of your mistake and how to avoid making it again in the future. The answer explanations will help you to learn from your mistakes and overcome them.  Understanding the latest test-taking strategies is essential to preparing you for what you will expect on the exam. A test taker has to not only understand the material that is being covered on the test, but also must be familiar with the strategies that are necessary to properly utilize the time provided and get through the test without making any avoidable errors.  Anyone planning to take the Praxis II Social Studies Content Knowledge test should take advantage of the review material, practice test questions, and test-taking strategies contained in this study guide.",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/Praxis-Social-Studies-Content-Knowledge/dp/1628454210/ref=sr_1_28?s=books&ie=UTF8&qid=1522384714&sr=1-28"
}{
    "product_name": "Stephen Curry: The Best. Easy to read children sports book with great graphic. All you need to know about Stephen Curry, one of the best basketball legends in history. (Sports book for Kids)",
    "description": "Stephen Curry is a professional basketball player, and many people think he is one of the best basketball players in history. Stephen is definitely one of the best shooters ever, and he has won a lot of awards.  Stephen Curry is young, strong, and healthy. That is part of the reason he is so good. But really, he is so good for other reasons. Stephen practiced hard, and never gave up. Even when he was passed over by colleges, Stephen didn’t let that get him down. He simply went to a college he liked, and proved just how wrong the big colleges were in passing him over.  Stephen is the kind of athlete and person we should all try to be. He is friendly and courteous, hard working and dedicated, and uses his skills to entertain millions of people, all while raising money for charities.  Simple, interesting, fun and easy to read for kids, this book contains all you need to know and to learn from Stephen Curry - The Best.  Get this book now and enjoy",
    "ratings": "3.7 out of 5 stars",
    "url": "https://www.amazon.com/Stephen-Curry-children-graphic-basketball/dp/1514241587/ref=sr_1_29?s=books&ie=UTF8&qid=1522384714&sr=1-29"
}{
    "product_name": "Beckett Basketball Price Guide #25 (Beckett Basketball Card Price Guide)",
    "description": "More than 300,000 cards from over 6,000 sets are listed in this popular book.It is the most comprehensive basketball card source ever produced.This new edition includes complete coverage of modern and oddball hoops cards and collectibles from 1910 to present, including college, international leagues, figurines and WNBA.",
    "ratings": "5.0 out of 5 stars",
    "url": "https://www.amazon.com/Beckett-Basketball-Price-Guide-Card/dp/193069220X/ref=sr_1_30?s=books&ie=UTF8&qid=1522384714&sr=1-30"
}{
    "product_name": "Life Is Not an Accident: A Memoir of Reinvention",
    "description": "New York Times BestsellerThis big-hearted memoir by the most promising professional basketball player of his generation details his rise to NBA stardom, the terrible accident that ended his career and plunged him into a life-altering depression, and how he ultimately found his way out of the darkness.Ten years ago, Jay Williams was at the beginning of a brilliant professional basketball career. The Chicago Bulls’ top draft pick—and the second pick of the entire draft—he had the great Michael Jordan’s locker. Then he ran his high-performance motorcycle head-on into a light pole, severely damaging himself and ending his career.In this intense, hard-hitting, and deeply profound memoir, Williams talks about the accident that transformed him. Sometimes, the memories are so fresh, he feels like he’ll never escape the past. Most days, he finds a quiet peace as a commentator on ESPN and as an entrepreneur who can only look back in astonishment at his younger self—a kid who had it all, thought he was invincible, and lost everything . . . only to gain new wisdom.Williams also shares behind the scenes details of life as an All-American. He tells it straight about the scandalous recruiting process and his decision to return to Duke and Coach K—a man who taught him about accountability—to finish his education. He also speaks out about corruption—among coaches, administrators, players, and alumni—and about his time in the NBA, introducing us to a dark underworld culture in the pros: the gambling, drugs, and sex in every city, with players on every team.&nbsp;",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/Life-Not-Accident-Memoir-Reinvention/dp/0062327992/ref=sr_1_31?s=books&ie=UTF8&qid=1522384714&sr=1-31"
}{
    "product_name": "Sports Illustrated Basketball's Greatest",
    "description": "Who's the greatest center of all time, Wilt Chamberlain or Kareem Abdul-Jabbar? Where does Shaquille O'Neal land in the rankings? Would you pick Tim Duncan or Charles Barkley as the better power forward? Who's your best Sixth Man? Where does LeBron James rank among small forwards?  Sports Illustrated has polled its basketball experts, including Jack McCallum, Chris Ballard, Alexander Wolff, Lee Jenkins, Ian Thomsen, Chris Mannix, and Mark Bechtel, to determine the Top 10 in more than 20 categories. The rankings appear alongside stunning photography and classic stories from SI's archives. This is the best of the best in the NBA, or, more simply, Basketball's Greatest.",
    "ratings": "4.7 out of 5 stars",
    "url": "https://www.amazon.com/Sports-Illustrated-Basketballs-Greatest-Editors/dp/1618930486/ref=sr_1_32?s=books&ie=UTF8&qid=1522384714&sr=1-32"
}{
    "product_name": "They Call Me Coach",
    "description": "They Call Me Coach",
    "ratings": "4.7 out of 5 stars",
    "url": "https://www.amazon.com/They-Call-Coach-John-Wooden/dp/0071424911/ref=sr_1_33?s=books&ie=UTF8&qid=1522384714&sr=1-33"
}{
    "product_name": "Court Justice: The Inside Story of My Battle Against the NCAA",
    "description": "“Like Curt Flood and Oscar Robertson, who paved the way for free agency in sports, Ed O’Bannon decided there was a principle at stake… O’Bannon gave the movement to reform college sports…passion and purpose, animated by righteous indignation.” ―Jeremy Schaap, ESPN journalist and New York Times bestselling author In 2009, Ed O’Bannon, once a star for the 1995 NCAA Champion UCLA Bruins and a first-round NBA draft pick, thought he’d made peace with the NCAA’s exploitive system of “amateurism.” College athletes generated huge profits, yet―training nearly full-time, forced to tailor coursework around sports, often pawns in corrupt investigations―they saw little from those riches other than revocable scholarships and miniscule chances of going pro. Still, that was all in O’Bannon’s past…until he saw the video game NCAA Basketball 09. As avatars of their college selves­―their likenesses, achievements, and playing styles―O’Bannon and his teammates were still making money for the NCAA. So, when asked to fight the system for players past, present, and future―and seeking no personal financial reward, but rather the chance to make college sports more fair―he agreed to be the face of what became a landmark class-action lawsuit. Court Justice brings readers to the front lines of a critical battle in the long fight for players’ rights while also offering O’Bannon’s unique perspective on today’s NCAA recruiting scandals. From the basketball court to the court of law facing NCAA executives, athletic directors, and “expert” witnesses; and finally to his innovative ideas for reform, O’Bannon breaks down history’s most important victory yet against the inequitable model of multi-billion-dollar “amateur” sports.",
    "ratings": "4.7 out of 5 stars",
    "url": "https://www.amazon.com/Court-Justice-Inside-Battle-Against/dp/1635762626/ref=sr_1_34?s=books&ie=UTF8&qid=1522384714&sr=1-34"
}{
    "product_name": "The Hoops Whisperer: On the Court and Inside the Heads of Basketball's Best Players",
    "description": "Basketball’s most unlikely—and most sought-after—training guru offers an inside look at his career, his methods, and the all-star players whose games he’s helped transform.&nbsp;Where do the best basketball players in the world turn when they want to improve their game? Whom does a future NBA Hall of Famer thank at his press conference when he’s named Rookie of the Year? Who is it that Sports Illustrated, The Wall Street Journal, and Men’s Journal all call the \"Hoops Whisperer\" because of his ability to engage, inspire, and challenge the players he trains? The answer to all of these questions is Idan Ravin.Ravin never played or coached in college or the pros, yet a virtual NBA All-Star team relies on him to better their game and reach their full potential.&nbsp;A soft-spoken former lawyer, Ravin has become professional basketball’s hottest trainer.In The Hoops Whisperer, Ravin shares the fascinating story of how he transformed a passion for the game into working with iconic basketball stars such as Chris Paul, LeBron James, Kevin Durant, Carmelo Anthony, Stephen Curry, Blake Griffin, James Harden, Dwight Howard, and many more. &nbsp;He offers a rare unguarded glimpse inside the lives of these great athletes, drawn from his intimate connection with them that is the basis of his success.&nbsp;Showcasing his unorthodox drills and improvisational techniques in action, Ravin reveals how faith, effort, dedication, and passion can make a player into a superstar—and anyone into a success. Combined with his own inspiring journey, Ravin’s insights make&nbsp;The Hoops Whisperer a must-read for anyone who loves the game.&nbsp;",
    "ratings": "4.6 out of 5 stars",
    "url": "https://www.amazon.com/Hoops-Whisperer-Inside-Basketballs-Players/dp/1592409377/ref=sr_1_35?s=books&ie=UTF8&qid=1522384714&sr=1-35"
}{
    "product_name": "Sum It Up: A Thousand and Ninety-Eight Victories, a Couple of Irrelevant Losses, and a Life in Perspective",
    "description": "Pat Summitt, the all-time winningest coach in NCAA basketball history and bestselling author of Reach for the Summitt and Raise The Roof, tells for the first time her remarkable story of victory and resilience as well as facing down her greatest challenge: early-onset Alzheimer's disease.Pat Summitt was only 21 when she became head coach of the Tennessee Vols women's basketball team. For 38 years, she broke records, winning more games than any NCAA team in basketball history. She coached an undefeated season, co-captained the first women's Olympic team, was inducted into the Basketball Hall of Fame, and was named Sports Illustrated 'Sportswoman of the Year'.She owed her coaching success to her personal struggles and triumphs. She learned to be tough from her strict, demanding father. Motherhood taught her to balance that rigidity with communication and kindness. She was a role model for the many women she coached; 74 of her players have become coaches.Pat's life took a shocking turn in 2011, when she was diagnosed with early-onset Alzheimer's disease, an irreversible brain condition that affects 5 million Americans. Despite her devastating diagnosis, she led the Vols to win their sixteenth SEC championship in March 2012. Pat continued to be a fighter, facing this new challenge the way she's faced every other--with hard work, perseverance, and a sense of humor.From the Hardcover edition.",
    "ratings": "4.9 out of 5 stars",
    "url": "https://www.amazon.com/Sum-Ninety-Eight-Victories-Irrelevant-Perspective/dp/0385347057/ref=sr_1_36?s=books&ie=UTF8&qid=1522384714&sr=1-36"
}{
    "product_name": "Toughness: Developing True Strength On and Off the Court",
    "description": "If anyone knows tough, it’s Jay Bilas. A four-year starter at Duke, he learned a strong work ethic under Coach Mike Krzyzewski. After playing professionally overseas, he returned to Duke, where he served as Krzyzewski’s assistant coach for three seasons, helping to guide the Blue Devils to two national championships. He has since become one of basketball’s most recognizable faces through his insightful analysis on ESPN’s SportsCenter and College GameDay.Through his ups and downs on and off the court, Bilas learned the true meaning of toughness from coaches, teammates, and colleagues. Now, in Toughness, he examines this misunderstood—yet vital—attribute and how it contributes to winning in sports and in life. Featuring never-before-heard stories and personal philosophies on toughness from top players and coaches, including Coach K, Bob Knight, Grant Hill, Mia Hamm, Jon Gruden, Tom Izzo, Roy Williams, Bill Self, Curtis Strange, and many others—Bilas redefines what it takes to succeed.",
    "ratings": "4.6 out of 5 stars",
    "url": "https://www.amazon.com/Toughness-Developing-True-Strength-Court/dp/0451414683/ref=sr_1_37?s=books&ie=UTF8&qid=1522384716&sr=1-37"
}{
    "product_name": "Basketball For Dummies",
    "description": "The easy way to get the ins, outs, and intrigue on this beloved sport The National Basketball Association (NBA), with 30 teams and an average attendance of more than 17,000 spectators per game, is the richest and most popular basketball league — and arguably the most viewed American sport — in the world. This new edition of Basketball For Dummies not only covers the rules and regulations of the NBA, but offers coverage on the WNBA, NCAA, and international basketball leagues. Basketball For Dummies is a valuable resource to the many fans of this beloved sport, covering everything from players and personalities in the game to rules, regulations, and equipment. Completely updated with information and intrigue that's occurred in the sport since publication of the previous edition, Basketball For Dummies gets you up to speed on everything from NCAA Tournament brackets to college players en route to the NBA.  Coverage of the rules and regulations of the NBA Interesting topics like LeBron the Phenom, ESPN'S influence on the NBA, and the UCONN women's basketball dynasty Digger's take on John Wooden  Whether you're a basketball player or a courtside spectator, Basketball For Dummies is a slam-dunk of information and intrigue for anyone who loves the sport.",
    "ratings": "3.8 out of 5 stars",
    "url": "https://www.amazon.com/Basketball-Dummies-Richard-Phelps/dp/1118073746/ref=sr_1_38?s=books&ie=UTF8&qid=1522384716&sr=1-38"
}{
    "product_name": "Desktop Basketball: It's a Slam Dunk! (Miniature Editions)",
    "description": "You don't have to be 6'7\" and a world-class athlete to master this one-of-a-kind version of basketball. This is a game that anyone can play when tedium sets in at the office. Kit includes a 32-page rule book on Desktop Basketball to get you started, a miniature basketball, and an easy-to-assemble basketball hoop, post, suction-cup base, and backboard.",
    "ratings": "4.4 out of 5 stars",
    "url": "https://www.amazon.com/Desktop-Basketball-Slam-Miniature-Editions/dp/0762444207/ref=sr_1_39?s=books&ie=UTF8&qid=1522384716&sr=1-39"
}{
    "product_name": "Air Jordan Coloring Book: Sneaker Adult Coloring Book",
    "description": "Coloring Book contest Enter to win a FREE Pair of retro Air Jordan 3 &nbsp;with our book. Head over to @jordancoloringbook to find out how to enter&nbsp;&nbsp;If you love Air Jordan sneakers,&nbsp;you're gonna LOVE this coloring book!&nbsp;&nbsp;Introducing the world's first \"Air Jordan Coloring Book\" for adults and kids alike!Imagine yourself CREATING the colors and designs that you always wanted to see. No matter what your level of artistic skill is, you can have a BLAST coloring the sneakers you love to admire - Air Jordans - and show the world what a FAN you are!&nbsp;&nbsp;IF&nbsp;you're a true \"Sneakerhead\" this is the book for you - For you customizers, save your self hours of time and &nbsp;hassle by sketching out colorways before you have to paint them. This feature alone is worth the price of the book. &nbsp;So whats the benefits of coloring you ask ?&nbsp;&nbsp;Well here are just a few reason&nbsp;1) Improves motor skills,2) Stimulates creativity3) contributes to better handwriting,4) Color Awareness, recognition and discernment5) Improve Focus and hand eye coordination6) Improved self Esteem7) Get for self Expression8) Therapy and Stress Relief&nbsp;This book comes with digitally-drawn representations of the famous Air Jordan sneakers from 1 to 23, with TWO identical drawings of each shoe so that you can experiment with different colors and designs. This is truly a one-of-a-kind book and will provide hours of fun for fans of all ages.&nbsp;&nbsp;&nbsp;Things you are getting with our books&nbsp;&nbsp;&nbsp;&nbsp;Original Sneaker Designs By Troy DaVinci You Can't Find anywhere elseTwo Pages of each Jordan number, so you can color the same sneaker twiceColor Jordans from 1-23Color with Crayon, Color pencil, Watercolor, Color marker&nbsp;Made in the USA!High-Quality White Art Paper&nbsp;Sneakerhead collector itemFun for all agesStress Relief Tool For Relaxing &nbsp;Fast Shipping worldwideFull 8x11 Page Designs!&nbsp;High Quality Detail designs &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;This would make the perfect gift for any sneaker lover, and your little one will have a total blast coloring in something other than wide-eyed cartoons. Young or old, this coloring book is sure to fascinate.\u2028\u2028 Let that creativity run wild and let see what&nbsp;cool&nbsp;color ways you can come up with by clicking on the&nbsp;&nbsp;\"ADD TO CART NOW\"",
    "ratings": "4.6 out of 5 stars",
    "url": "https://www.amazon.com/Air-Jordan-Coloring-Book-Sneaker/dp/0692599452/ref=sr_1_40?s=books&ie=UTF8&qid=1522384716&sr=1-40"
}{
    "product_name": "Basketball Skills &amp; Drills - 3rd Edition",
    "description": "   Great basketball players like Tim Duncan and Dwyane Wade draw oohs and aahs with their spectacular moves. But before those players developed their superstar flair, they built a solid base of fundamental skills in all phases of the game. Basketball Skills &amp; Drills provides a perfect blueprint for building the foundation that every well-rounded player needs. This special book and DVD package demonstrates each key skill:-Player positioning-Moving without the ball-Shooting-Passing, catching, and dribbling-Perimeter moves-Post moves-Defense-ReboundingThe skills and 90 drills, coaching tips, and DVD reinforce the skill instruction, emphasize key points, and explain how to correct common errors. And since individual skills are effective only when used within the team concept, the book also covers key team principles for both ends of the court. Tactics for offense, including special situations such as out-of-bounds plays, will improve spacing, ball and player movement, shot selection, and scoring. Defensive tactics emphasize positioning, pressure, and various systems to apply in each area or level of the court.To be an all-star, you must be fundamentally sound. Basketball Skills &amp; Drills is your guide to becoming a complete player—one who can change the game with great moves and smart play. ",
    "ratings": "4.3 out of 5 stars",
    "url": "https://www.amazon.com/Basketball-Skills-Drills-Jerry-Krause/dp/0736067078/ref=sr_1_41?s=books&ie=UTF8&qid=1522384716&sr=1-41"
}{
    "product_name": "This Book Has Balls: Sports Rants from the MVP of Talking Trash",
    "description": "Michael Rapaport, actor, Top 50 podcaster, award-winning film maker, and sports fanatic, is here to set the world straight on the greatest and downright worst athletes, players, teams, and jerseys—while refusing to mention statistics, analytics, or anything else that isn’t pure hustle.In 1979, nine-year-old Michael Rapaport decided he was going to do whatever it took to be a pro baller. He practiced and practiced, but by the time he was fifteen, he realized there was no place for a slow, white Jewish kid in the NBA. So he found another way to channel his obsession with sports: talking trash.  In This Book Has Balls, Rapaport uses his signature smack-talk style and in-your-face humor to discuss everything from why LeBron will never be like Mike, that Tiger needs the ladies to get his golf game back, and how he once thought Mary Lou Retton was his true love. And, of course, why next year will be the year the New York Knicks win the championship. This book is a series of rants—some controversial, some affectionate, but all incredibly hilarious.",
    "ratings": "4.1 out of 5 stars",
    "url": "https://www.amazon.com/This-Book-Has-Balls-Talking/dp/1501160311/ref=sr_1_42?s=books&ie=UTF8&qid=1522384716&sr=1-42"
}{
    "product_name": "Giannis Antetokounmpo: The Inspiring Story of One of Basketball's Rising Superstars (Basketball Biography Books)",
    "description": "Learn the Inspiring Story of the Milwaukee Bucks' Rising Star Giannis Antetokounmpo! Read on your PC, Mac, smartphone, tablet or Kindle device. This holiday season, if you buy the print edition as a gift, you can keep the Kindle edition for yourself! In Giannis Antetokounmpo: The Inspiring Story of One of Basketball's Rising Superstars, you will learn the inspirational story of one of basketball's most promising young stars, Giannis Antetokounmpo. Often nicknamed \"The Greek Freak\", Giannis Antetokounmpo has quickly emerged as one of the most unique players in the league today. His incredible wingspan and athleticism have made him a dominant presence on both the offensive and defensive ends of the basketball court. He is easily one of the most difficult defensive assignments for opposing teams due to his ability to not only start as a forward, but also as a guard. In just four years, Giannis Antetokounmpo has gone from averaging 6.8 points per game to 22.9 points per game. He has also quickly become the face of the Milwaukee Bucks franchise. There is still much to be unveiled in the career of Giannis Antetokounmpo. At the time of this writing, Giannis is just twenty-two years old. In this book, we'll learn more about The Greek Freak's journey into the NBA, his impact on the game, and his growing legacy as one of the best up and coming stars to make his presence known in basketball. Here is a preview of what is inside this book: Childhood and Early Life NBA Career: Getting Drafted, Rookie Season, Working Under Jason Kidd, The Largest Point Guard in the League, and Becoming an All-Star International Career Personal Life Giannis Antetokounmpo's Player Profile and Impact on Basketball Antetokounmpo's Future  An excerpt from the book: The NBA loves those rags to riches stories about how a person that lived and grew up through poverty worked his way up to get to the league, not only as an ordinary player, but a superstar ranking among the best in the world. These are the kinds of stories that makes the people adore the player and what he has been through to get to the top. More importantly, these are the stories that inspire young children to work just as hard, if not harder, than their idol to reach the success they aspire to achieve.   Several of the greatest players in league history have had to endure poverty before they found success in the NBA. Allen Iverson barely had a home growing up before he starred at Georgetown. In his MVP speech back in 2014, Kevin Durant said that his mother raised him and his brother alone while the family moved from roof to roof. The same was true for LeBron James, who was raised alone by his mother when she was still 16 years old. These players not only earned millions as NBA superstars, but have also become fan favorites because of how they worked themselves up to get to the league.  Likewise, the NBA has also found a liking for players that were seemingly genetically engineered to dominate in the game of basketball. These are the types of players that, at a glance, were naturally destined to be a great because of the physical tools they possess. If the NBA was a horse race, these kinds of players are your thoroughbreds judging by how much more physically gifted and talented they are than the rest of the competition. Tags: Giannis Antetokounmpo Bio, Giannis Antetokounmpo basketball, Milwaukee Bucks basketball, Jason Kidd, Kristaps Porzingis, Kyle Lowry, Jabari Parker, Matthew Dellavedova, Russell Westbrook, Kawhi Leonard, Anthony Davis, Kevin Durant, Thon Maker",
    "ratings": "There are no customer reviews yet.",
    "url": "https://www.amazon.com/Giannis-Antetokounmpo-Basketballs-Superstars-Basketball/dp/154826069X/ref=sr_1_43?s=books&ie=UTF8&qid=1522384716&sr=1-43"
}{
    "product_name": "Russell Westbrook: Style Drivers",
    "description": "For NBA superstar turned style icon Russell Westbrook, fashion is not just a spectator sport—it pushes boundaries, blurs lines, and drives culture. This book is a celebration of Westbrook’s style on and off the court, and the creative people he admires and works with.This book was created with three different covers designed by Raymond Pettibon and will be shipped to customers at random. Russell Westbrook, a reigning two-time NBA All-Star MVP, is not your average basketball superstar. Apart from his meteoric rise within the ranks of the NBA, Westbrook is a creative force prominently known and admired by the fashion industry and his fan base for his daring sartorial experimentation and love of all things fashion. Whether he is seen at the front row of a runway show during Milan Fashion Week, within the pages of Vogue, GQ, and the New York Times style section, or collaborating with Barneys New York or the Jordan brand, Westbrook has garnered the reputation of being the NBA’s real fashion insider. This book is a collection of stylish and inspiring images and text that provide a rare glimpse into Westbrook’s world, revealing how he uses style as a psychological weapon on and off the court and how he has redefined the role of a contemporary athlete turned cultural figure. From photographs documenting his bold and cutting-edge outfits worn during the playoffs to images of his collaborations with global style brands and original quotes and interviews with fellow athletes, designers, and creative figures that inspire Westbrook, this book explores how to be fearless and confident in fashion and in life, what it means to be stylish, and the importance of authenticity in everything from style and music to art and business. This all-access volume is an essential for his fans and readers interested in sports, style, design, and popular culture.",
    "ratings": "5.0 out of 5 stars",
    "url": "https://www.amazon.com/Russell-Westbrook-Style-Drivers/dp/0847859932/ref=sr_1_44?s=books&ie=UTF8&qid=1522384716&sr=1-44"
}{
    "product_name": "The Chicago Tribune Book of the Chicago Cubs: A Decade-By-Decade History",
    "description": "The Chicago Tribune Book of the Chicago Cubs is a decade-by-decade look at one of baseball’s most beloved if hard-luck teams, starting with the franchise’s beginnings in 1876 as the Chicago White Stockings and ending with the triumphant 2016 World Series championship.For more than a century, the Chicago Tribune has documented every Cubs season through original reporting, photography, and box scores. For the first time, this mountain of Cubs history has been mined and curated by the paper’s sports department into a single one-of-a-kind volume. Each era in Cubs history includes its own timeline, profiles of key players and coaches, and feature stories that highlight it all, from the heavy hitters to the no-hitters to the one-hit wonders.And of course, you can’t talk about the Cubs without talking about Wrigley Field. In this book, readers will find a complete history of that most sacred of American stadiums, where Hack Wilson batted in 191 runs—still the major-league record—in 1930, where Sammy Sosa earned the moniker “Slammin’ Sammy,” and where fans congregated, even when the team was on the road, throughout its scintillating championship run.The award-winning journalists, photographers, and editors of the Chicago Tribune have produced a comprehensive collector’s item that every Cubs fan will love.",
    "ratings": "4.9 out of 5 stars",
    "url": "https://www.amazon.com/Chicago-Tribune-Book-Decade-Decade/dp/1572842172/ref=sr_1_45?s=books&ie=UTF8&qid=1522384716&sr=1-45"
}{
    "product_name": "Geno: In Pursuit of Perfection",
    "description": "Controversial, confrontational, and driven, Coach Geno Auriemma is a force to be reckoned with - and the most accomplished male coach in women's basketball today. In his relentless quest for excellence at the University of Connecticut, he has led the Huskies to five national championships. \"Yet his soul never rests. For Auriemma, life affords only the briefest moments of happiness - a good round of golf, forty minutes of great basketball, a day at the beach with his family, a nice glass of wine - while disaster is seemingly always waiting to strike. It's a fatalistic philosophy, a remnant of his hardscrabble early years, but it's an outlook that has driven him to unparalleled success.\" \"In this deeply personal memoir, Geno Auriemma reveals for the first time the man behind the legend. He talks candidly about his coaching style - famed for being one of the most demanding in all the sports world. He spills the beans about his stormy dealings with other coaches such as his archrival, Pat Summitt of the University of Tennessee. And with warmth and a genuine love for his champions, he writes openly about Diana Taurasi, Sue Bird, Nykesha Sales, Rebecca Lobo, Swin Cash, and all of his other UConn stars who have gone on to stellar WNBA careers. You get a courtside seat to all of the action - including an epilogue on the 2004-05 season, as well as interviews with the team's most celebrated players.\"--BOOK JACKET.",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/Geno-Pursuit-Perfection-Auriemma/dp/0446694770/ref=sr_1_46?s=books&ie=UTF8&qid=1522384716&sr=1-46"
}{
    "product_name": "Redemption: Carolina Basketball's 2016–2017 Journey from Heartbreak to History",
    "description": "This is the story of a national championship that was a year in the making.Redemption: Carolina Basketball's 2016–2017 Journey from Heartbreak to History is a behind-the-scenes look at the Tar Heels' ride to the 2017 national title. Featuring never-before-published, exclusive photographs that will take readers from the practice court and game action to the team bus and locker room, this book is the most complete chronicle of a UNC national championship ever made. In addition to the full-color images, the book also includes interviews with the players and coaches that can only be found here, a foreword by head coach Roy Williams, and exciting new stories from Adam Lucas, Steve Kirschner, and Matt Bowers, who accompanied the team every step of the way.Much more than a detailed account of Carolina's 33 victories, Redemption describes the amazing journey of one of UNC's most inspiring championships, from heartbreak in Houston to the storybook finish in Phoenix. Here readers can get the team's perspective on what propelled them to a title and find out what moments the players and coaches considered most important, both on and off the court. The result is a must-have book for Tar Heel fans everywhere.",
    "ratings": "4.9 out of 5 stars",
    "url": "https://www.amazon.com/Redemption-Carolina-Basketballs-2016-2017-Heartbreak/dp/146963211X/ref=sr_1_47?s=books&ie=UTF8&qid=1522384716&sr=1-47"
}{
    "product_name": "Beyond Basketball: Coach K's Keywords for Success",
    "description": "The Duke University men's basketball team has served as the gold standard in college athletics for well over two decades - and that's all because of the extraordinary impact of Mike Krzyzewski, the highly-respected coach of the Duke squad.Coach K's reputation as a teacher of young men has transcended his extraordinary success as a coach. The Duke team is always ranked at the top of the college game, year in and year out, but what's truly remarkable about Coach K are his players and the legacy they leave behind: Grant Hill, Shane Battier, Elton Brand, Bobby Hurley, and on and on -- these are not just great basketball players, but individuals who have become true leaders in American society, all thanks in large part to Coach K's leadership.So how does Coach K do it? In this new book, he reveals his tips, advice, and time-tested guidance on how he coaches and educates his players about life beyond the basketball court.",
    "ratings": "4.8 out of 5 stars",
    "url": "https://www.amazon.com/Beyond-Basketball-Coach-Keywords-Success/dp/0446581879/ref=sr_1_48?s=books&ie=UTF8&qid=1522384716&sr=1-48"
}{
    "product_name": "When the Game Was Ours",
    "description": "A riveting portrait of two legendary players whose fierce rivalry came to define one of the most exciting periods of professional basketball Â&nbsp; In Celtic green was Larry Bird, the hick from French Lick with laser-beam focus, relentless determination, and a deadly jump shotâ\u0080\u0094a player who demanded excellence from everyone around him and whose caustic wit left opponents quaking in their high-tops. Magic Johnson was Mr. Showtime: young, indomitable, a magnetic personality with all the right moves, he was a pied piper in purple and gold and he burned with an inextinguishable desire to win. Their uncommonly competitive relationship came to symbolize the most thrilling rivalry in the NBAâ\u0080\u0094East vs. West, physical vs. finesse, old school vs. Showtime, even white vs. black. Each pushed the other to greatness, and together Bird and Johnson collected eight NBA Championships and six MVP awards, helping to save a floundering NBA. When the Game Was Ours chronicles an electric era in sports history, revealing for the first time the inner workings of two players dead set on besting each other.",
    "ratings": "4.5 out of 5 stars",
    "url": "https://www.amazon.com/When-Game-Ours-Larry-Bird/dp/0547394586/ref=sr_1_49?s=books&ie=UTF8&qid=1522384720&sr=1-49"
}{
    "product_name": "Athletes Are Brands Too: How Brand Marketing Can Save Today's Athlete",
    "description": "The athlete’s guide to building a personal brand and a future beyond sports.Athletes Are Brands Too teaches athletes at every level how to build a brand that can lead to success in life, regardless of what happens in their athletic career. One part road map, one part call to arms, this guide gives athletes the tools to build their influence, beat the odds, and leverage their athletic accomplishments well beyond sports.",
    "ratings": "5.0 out of 5 stars",
    "url": "https://www.amazon.com/Athletes-Are-Brands-Too-Marketing/dp/0999633201/ref=sr_1_50?s=books&ie=UTF8&qid=1522384720&sr=1-50"
}{
    "product_name": "Ramblers: Loyola Chicago 1963  The Team that Changed the Color of College Basketball",
    "description": "Today basketball is played “above the rim” by athletes of all backgrounds and colors. But 50 years ago it was a floor-bound game, and the opportunities it offered for African-Americans were severely limited.A key turning point was 1963, when the Loyola Ramblers of Chicago took the NCAA men’s basketball title from Cincinnati, the two-time defending champions. It was one of Chicago’s most memorable sports victories, but Ramblers reveals it was also a game for the history books because of the transgressive lineups fielded by both teams.Ramblers is an entertaining, detail-rich look back at the unlikely circumstances that led to Loyola’s historic championship and the stories of two Loyola opponents: Cincinnati and Mississippi State. Michael Lenehan’s narrative masterfully intertwines these stories in dramatic fashion, culminating with the tournament’s final game, a come-from-behind overtime upset that featured two buzzer-beating shots.While on the surface this is a book about basketball, it goes deeper to illuminate how sport in America both typifies and drives change in the broader culture. The stark social realities of the times are brought vividly to life in Lenehan’s telling, illustrating the challenges faced in teams’ efforts simply to play their game against the worthiest opponents.",
    "ratings": "4.6 out of 5 stars",
    "url": "https://www.amazon.com/Ramblers-Chicago-Changed-College-Basketball/dp/1572841400/ref=sr_1_51?s=books&ie=UTF8&qid=1522384720&sr=1-51"
}