[
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "Don't ever purchase from this vendor. The iPhone arrived with a non-functional power slot in it. It didn't even come close to fitting the power tip and appeared to be missing all electronic connections. This made the iPhone useless since it couldn't be charged. The box looked fake. It was especially devastating since we live in a remote area where we cannot get an iPhone elsewhere and had waited nearly 3 weeks for this to arrive. To realize you've been had this way is especially cruel.",
                "review_posted_date": "22 Feb 2018",
                "review_header": "iPhone didn't work at all",
                "review_rating": "1.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "Everyone reading this is probably familiar with the Apple phone line up so I am going to focus on the differences between the iPhone X and iPhone 7 plus specifically. First off, the set-up process has been significantly streamlined. When setting up your new iPhone X setup will ask you if your old iPhone is nearby, select yes, and you can wireless transfer all your apps, settings, backgrounds, passwords, etc. to your new phone in a few clicks. I really appreciated this streamlined process and it was incredibly quick and easy to transfer all my settings to my new iPhone X. The other main features that have been upgraded are as follows: New screen (5.8” OLED is the most vibrant and clear screen ever produced by Apple) - Apple has removed the touch ID sensor and bezel around the old iPhone screen which means the iPhone X has a noticeably smaller footprint while maintaining a larger screen size than the iPhone 7/8 Plus. (See comparison images attached of the iPhone X versus iPhone 7 Plus). - OLED Screen offers deeper blacks and brighter whites resulting in greater color reproduction. - Similar to the iPhone 8 and 8 Plus the iPhone X uses true tone technology to mimic the lighting conditions around it and adjust the white balance accordingly. - The notch cut out of the top of the screen is where Apple has included the face recognition sensors, front camera, and a host of other sensors. I thought this would be annoying but Apple has cleverly used the screen real estate on both sides to include the time, date, battery indicators, etc. Farewell Touch-ID, Hello Face-ID - Face-ID is Apples new facial recognition technology which has replaced the finger printer reader and home button in order to free up additional screen real-estate. This is new and only available on the iPhone X. - Apples facial recognition is light years ahead of Samsung or any other carrier. I have tested this flawlessly with glasses, a hat, and even in the dark. It is as simple as looking at your phone and swiping up from the bottom. - I was worried this feature would be inconsistent or frustrating but it has worked really well. The only time it is a bit more inconvenient is if the phone is sitting on your desk or a flat surface you kind of have to lean over a bit or angle the phone towards you to unlock it. - This super powerful new camera also enables the animoji features which maps your facial expressions to create a talking emoji. This is a fun feature but more a novelty than anything. - This same true-depth camera makes the iPhone X the ultimate phone for taking selfies. The new portrait mode allows the user blur the background, or even cut yourself out entirely and place yourself on a black background. Additional noteworthy features and changes: - The rear camera boasts a dual 12MP sensor array with improved aperture and wide angle lens with image stabilization. The increased aperture from 2.8 to 2.4 allows for better images in low light conditions. - Video capabilities have also approved as well to include 60p 4k video recording delivering clear, fluid images. - Increased audio quality and volume - Increased RAM size to 3GB and new Bionic Chip makes the iPhone X one of the most powerful smartphones are the market. - Updated design features glass back and sides which make the phone beautiful looking. A very welcome change in the normal design. - Battery life: The iPhone X boasts the largest battery in Apple history with a 2716 mAh battery which is a bit larger than the new iPhone 8 Plus. A full charge from 0-100% takes about 2 hours and 10 minutes in my testing. - In addition, wireless charging has finally been added to the new iPhone X, and 8 series phones. I have not tested this out but am excited to give it a try (Wireless charging pad is not included with the phone). Bottom line, the iPhone X is another smash hit from Apple. Every feature people were concerned about turned out to work flawlessly as usual. I have only had the iPhone for about 24 hours so it is early to leave a long-term focused review but so far the new iPhone X has lived up to the hype. The iPhone X may not revolutionize the smart phone industry but it is a welcome upgrade to the iPhone which designs were getting a bit dated. I am excited about Apples new strategy to release a flagship model and allow the new features to trickle down to next generation’s phones. If you have the money to spare you won’t likely be disappointed. My only complaint is the phone only comes in 64GB or 256GB basically forcing users to pay an extra $150 to get decent storage. Further, the beautiful glass back on the screen feels fantastic and has a great weight to it. However, a replacement screen will cost you $275+ and the back glass replacement is rumored to cost around $400. Essentially a single drop could result in a $700 repair bill. Unfortunately this means most phones will be shielded in a case and will not be enjoyed. Read less ***Note Carrier Compatibility: All carrier variant iPhone X in the world are carrier unlocked. The one thing will need to note is your current network. There are a number of different iphone variants in the USA such as AT&T, T-mobile, Sprint, and Verizon. A Sim-free version is not available yet. Here is a compatibility breakdown. Verizon Phone: Unlocked, Supports GSM and CDMA. Spring Phone: Unlocked, Supports GSM and CDMA AT&T Phone: Unlocked, Supports GSM Only T-mobile Phone: Unlocked, Supports GSM Only You need a CDMA compatible phone if you are on Verizon or Sprint. GSM phones work with AT&T, T-mobile, and nearly every other international network provider.",
                "review_posted_date": "05 Nov 2017",
                "review_header": "Iphone X: A complete re-design and leap forward for Apple.",
                "review_rating": "5.0 ",
                "review_author": "By V12 Vantage"
            },
            {
                "review_text": "It is what it said it was! It has its own idiosyncrasies, which with patience, can work out. I have given it 4 stars out of 5 because its still one of the best,",
                "review_posted_date": "05 Mar 2018",
                "review_header": "iPhone et al",
                "review_rating": "4.0 ",
                "review_author": "By Candelario Cervantez"
            },
            {
                "review_text": "Great buy. Sealed pack",
                "review_posted_date": "22 Nov 2017",
                "review_header": "Amazing",
                "review_rating": "5.0 ",
                "review_author": "By PSH"
            },
            {
                "review_text": "Unlocked, sealed and fast shipping. Just what I had paid for. Thanks!",
                "review_posted_date": "04 Dec 2017",
                "review_header": "Authentic seller!",
                "review_rating": "5.0 ",
                "review_author": "By sahil"
            },
            {
                "review_text": "i'm loving it every day when I wake up and touch it - it gives me new feeling of likeness since I started using it about two weeks now",
                "review_posted_date": "26 Feb 2018",
                "review_header": "i'm loving it every day when I wake up and ...",
                "review_rating": "5.0 ",
                "review_author": "By Alieu A. Sackor"
            },
            {
                "review_text": "Love my IPhone X from every aspect and it is very sleek.",
                "review_posted_date": "27 Feb 2018",
                "review_header": "Iphone X ....",
                "review_rating": "5.0 ",
                "review_author": "By Jilek_s"
            },
            {
                "review_text": "Great phone, however really not a strong screen as is made out. Dropped it from one metre and the screen is broken in the corner. $300 to repair it- not happy",
                "review_posted_date": "22 Feb 2018",
                "review_header": "Great phone, however really not a strong screen as ...",
                "review_rating": "4.0 ",
                "review_author": "By clare panyandee"
            },
            {
                "review_text": "It’s a great phone",
                "review_posted_date": "18 Dec 2017",
                "review_header": "Expensive but worth it",
                "review_rating": "5.0 ",
                "review_author": "By Wade Ferguson"
            },
            {
                "review_text": "Never worked with my carrier",
                "review_posted_date": "23 Feb 2018",
                "review_header": "Four Stars",
                "review_rating": "4.0 ",
                "review_author": "By Athena"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=1",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "today is 26 days I bought the product and until today I had no concrete answers or even the product!",
                "review_posted_date": "27 Feb 2018",
                "review_header": "today is 26 days I bought the product and until ...",
                "review_rating": "1.0 ",
                "review_author": "By Lucas Pimenta"
            },
            {
                "review_text": "An excellent phone,it has everything that I need! In love",
                "review_posted_date": "28 Jan 2018",
                "review_header": "An excellent phone, it has everything that I need",
                "review_rating": "5.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "Loving it, the beginning of interaction with electronics",
                "review_posted_date": "26 Feb 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Raphael Cairo Justino"
            },
            {
                "review_text": "As expected. The product was brand new as if I bought from apple, included everything that is said to be included. No need to worry, it is not fake. It’s unlocked, but the original phone. The phone itself is a huge upgrade from the iPhone 5s. The camera is better than most new phone cameras (4K), Face ID works great for me, the all glass design is fragile, but a good case can protect it from a fall. Overall I think it is worth the price mainly because it has the best iPhone camera, the Animoji’s are worth it, and because it’s unique people immediately will know it’s an iPhone X just from looking at the back of it. I’m happy with my purchase, I’m loving it and this phone will sure last me awhile.",
                "review_posted_date": "08 Dec 2017",
                "review_header": "Great Purchase!",
                "review_rating": "5.0 ",
                "review_author": "By Jose"
            },
            {
                "review_text": "Grest",
                "review_posted_date": "06 Feb 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Diego Martinello"
            },
            {
                "review_text": "Screen great. Facial recognition has problems",
                "review_posted_date": "23 Feb 2018",
                "review_header": "Four Stars",
                "review_rating": "4.0 ",
                "review_author": "By Ariel Zarlenga"
            },
            {
                "review_text": "Excelent phone",
                "review_posted_date": "01 Mar 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Pedro Moreno"
            },
            {
                "review_text": "Great service , my wife loved the gift",
                "review_posted_date": "17 Jan 2018",
                "review_header": "Great service, my wife loved the gift",
                "review_rating": "5.0 ",
                "review_author": "By jim linford"
            },
            {
                "review_text": "Excellent!",
                "review_posted_date": "27 Jan 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Domingo P."
            },
            {
                "review_text": "Very dood",
                "review_posted_date": "25 Jan 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Elong"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=2",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "Is good",
                "review_posted_date": "05 Mar 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By eduardo a."
            },
            {
                "review_text": "iPhone X came brand new and sealed. Immediately opened and turned the iPhone on. After taking sim card out of my current iphone and placing it into the X, it worked perfectly! I was a little nervous given about spending as much as I did from a seller I hadn't heard of, but it was the best thing I ever did!",
                "review_posted_date": "20 Nov 2017",
                "review_header": "best purchase I ever made on Amazon",
                "review_rating": "5.0 ",
                "review_author": "By bss"
            },
            {
                "review_text": "Product came is the package as desscribed within two days. I have no issues phone works great I am enjoying it. coming off of a Samsung 8+ And a gear S2. Took a couple of days to get used to the gestures again (webos). Overall a good product. And five stars to the seller",
                "review_posted_date": "18 Nov 2017",
                "review_header": "Good product (WebOs 2017) New palm pre",
                "review_rating": "5.0 ",
                "review_author": "By Spoilers21"
            },
            {
                "review_text": "I am surprised to see such a high price on this phone. Not sure why people would over pay. My brothers and I began buying and upgraded to the latest iPhone since the very first version and the iPhone X is one the the biggest changes that I can remember. Much like going from the iPhone 3GS to the 4 was or the iPhone 5 to the 6. The X model looses the Home Button and doesn’t have a the headphone jack like the 7’s. No big deal on the headphone jack. Sometimes I do prefer plugging a set in and not having to worry about Bluetooth. The lack of a Home button does take some time getting use too. It is really different with the swipe gestures but after a day or so you get use to it. Basically learning a new way to switch and X out of apps. I like it now after using it. The phone is fast, feels crisper than the 7. Safari is snappier and pretty much all the apps are. The phones size is somewhat like the 7, feels thinner but is a tad larger. If you can afford it, you will be happy. I played with the iPhone 8 and it feels quicker too. The Face ID works really well. Being brothers that look a lot alike we try to trick it but it doesn’t work. This is the first of what will be new technologies for Apple like the Face ID, this was probably rushed and the next version will be more secure and work better. But it seems to work fine right now and does take the place of the finger ID pretty well. Camera takes awesome pictures. The 256g model can hold a lot of data which is nice and since your spending a grand you might as well spend the extra money and get the extra memory Pleased so far and looks like a solid reliable phone. In all fairness though, I could get by just fine with the iPhone 7 that I have been using. The main thing I like is the larger screen which is gorgeous and the faster processor. I love the phone but honestly I could have waited a year for the next model. If you can afford it now you’ll enjoy it. The size is perfect for me and the screen is awesome. Get a good case to protect it with which also hide the gorgeous design. I never really saw the iPhone 7 in black that I had because I always had it in a heavy duty case to protect it. It’s a shame to hide such great looking devices but you kinda have to so they don’t get dinged up.",
                "review_posted_date": "06 Nov 2017",
                "review_header": "Great Screen, fast, maybe rushed but worth upgrading if you can budget it",
                "review_rating": "5.0 ",
                "review_author": "By Jamie Robertson"
            },
            {
                "review_text": "excellent product and great services",
                "review_posted_date": "26 Feb 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Al Zubair El Gallal"
            },
            {
                "review_text": "As expected But way over priced",
                "review_posted_date": "31 Jan 2018",
                "review_header": "As expected But way overpriced",
                "review_rating": "3.0 ",
                "review_author": "By Rick McBroom"
            },
            {
                "review_text": "Fine",
                "review_posted_date": "11 Jan 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By virgilio e. hoffmann"
            },
            {
                "review_text": "Good",
                "review_posted_date": "12 Jan 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By JOSE LUIS TOSCANO"
            },
            {
                "review_text": "Greaaaattttt!) I'm happy!)",
                "review_posted_date": "30 Nov 2017",
                "review_header": ") I'm happy! )",
                "review_rating": "5.0 ",
                "review_author": "By Natalia"
            },
            {
                "review_text": "Awesome!",
                "review_posted_date": "30 Nov 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By moataz"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=3",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "Ues",
                "review_posted_date": "09 Jan 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Cliente Amazon"
            },
            {
                "review_text": "Apple iPhone X, GSM Unlocked 5.8\", 64 GB - Space Gray Sold by: Aimsky, LLC I love this phone! this is my first apple product (android fanboy my entire life google products only).",
                "review_posted_date": "15 Dec 2017",
                "review_header": "LLC I love this phone",
                "review_rating": "5.0 ",
                "review_author": "By Trinidad Amazon Customer"
            },
            {
                "review_text": "U think the price is high but what u get is worth every penny!!!!! The pictures are better than 35mm camera with zoom lens!!! 😀💋👍👍👍",
                "review_posted_date": "26 Jan 2018",
                "review_header": "Awsome++++++!!!!!",
                "review_rating": "5.0 ",
                "review_author": "By Betty Boop Gann"
            },
            {
                "review_text": "nice phone buy too expesive , its the same like the other iphones just with the different display",
                "review_posted_date": "13 Jan 2018",
                "review_header": "Four Stars",
                "review_rating": "4.0 ",
                "review_author": "By Matias"
            },
            {
                "review_text": "Great product",
                "review_posted_date": "19 Dec 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By bruce anderson"
            },
            {
                "review_text": "I got it earlier than expected. Every thing worked perfectly. The data transfer from my old IPhone started as soon as I put them close to each other. Face recognition function to unlock works very well. I believe the price is excessive.",
                "review_posted_date": "14 Feb 2018",
                "review_header": "I got it earlier than expected. Every thing worked ...",
                "review_rating": "5.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "in angola, it works very well. Beautiful phone",
                "review_posted_date": "18 Jan 2018",
                "review_header": "Beautiful",
                "review_rating": "5.0 ",
                "review_author": "By Gilson Guedes"
            },
            {
                "review_text": "This is a cross-post review from the unlocked version, but given they are the exact same phone, I thought it would be good to post: I received my X on launch day and I absolutely love this phone. If you would like a list of just my thoughts on the phone, scroll down to the bullet point list. The transition: NO home button! The staple of the iPhone is gone; well, moved to a little notch at the top. I was expecting this transition to a home-button-less iPhone to be difficult, but all of the gestures feel so natural. I find myself annoyed trying to utilized an older iPhone as the interface now feels clunky. Switching through apps, opening the phone, accessing everything, it's all so easy. Now, this isn't to say there isn't a transition and while everything feels natural, there is a period of time where you have to get used to the new interface and some aspects that initially seemed difficult become second nature. For example, reachability was a favorite feature of mine and while it was initially hard to activate, I have now learned how to activate it without an issue (reachability brings the iPhone screen down halfway to reach top parts of the screen without moving your hand). Face ID: I was skeptical to say the least, but Face ID works (almost) perfect. It does however learn from its missteps and if it fails to identify you, it will add that data to its cache. I personally scanned my face normally the first time and on the second scan did it at roughly a 45 degree angle so I could lean over my phone to view notifications. As I've adjusted to Face ID, it has gotten faster and faster at scanning my face and it's not something you need to wait on to open your phone. By the time you swipe up on your phone, it's unlocked and ready to go (I seriously forget I have a password). I also really enjoy the ability to utilize Face ID for my password for other logins and the ability to open up an app directly from the lock screen without having to then enter my fingerprint/passcode. It's important to note here that your privacy is well, yours. No one has access to the data Face ID gather's and it is truly yours. Apple has a good track record on keeping your data private as they are not in the data business (hello Google & Facebook). The price: There seems to be this running idea that a $1,000 phone is a crazy purchase, but I would have to disagree. Why? My logic is as followed: Phone's are one of the most used devices (easily mine) so for starters, I would like a nice one. If I didn't buy the device in full, I would have been paying roughly $2/ a day on a contract with Verizon. The base model is a 64GB iPhone loaded with the best Apple has to offer. A 128GB 6S at launch was $850. Yes, there's a price difference, but my point is that it's not as gigantic as it may seem. I personally would advocate a 64GB version and utilizing cloud storage if you need more space, but do note, this is Apple's flagship and there are cheaper iPhone's out there. What I love: - The screen looks amazing. The colors are vibrant, the blacks are deep with black wallpapers flowing aimlessly into the phone (to the point you cannot see the notch in the screen if the wallpaper is black). - The Notch! Yes, the notch. Some people seem to hate it, I think it's iconic and makes the iPhone X stand alone in oled sphere. It fades into the user experience and I have not had any issues with it. - The screen size. I have always wanted a plus, but I always felt like it was too big for my hands. That I would drop the phone and there it goes. The X remedies this for me and I get to use a larger screen in nearly the same form factor as my 6S. The screen truly looks amazing and if you haven't seen one, check one out at a local store. - I'm not sure how much of this is just because my 6S was a few years old, but the taptic engine in the X is amazing. As in, when the phone vibrates, I can easily identify what it is through the vibration and the vibration itself feels smooth. - Force touch is also fantastic and the haptic feedback on everything from a like on twitter to moving apps around is wonderful. Makes the screen feel more three-dimensional in a way. - The camera takes wonderful pictures. I have taken a few pictures in portrait mode and some pictures genuinely look like they were taken with a DSLR camera. - The speakers are louder than I expected and sound very clear. Great for impromptu music listening. - The phone is a little heavy, but it is definitely comfortable to hold. It feels like a luxury device and has a certain weight to it. What I don't: Honestly, I do not have a genuine complaint at this point. The only complaint that comes to mind revolves around the lack of optimization I have faced in some apps, but that is a developer problem and even then, developers have optimized a majority of their apps and my issues have been few and far between.",
                "review_posted_date": "09 Nov 2017",
                "review_header": "From a 6S to an X - A wonderful, luxury, phone",
                "review_rating": "5.0 ",
                "review_author": "By Taylor"
            },
            {
                "review_text": "Perfect, got it on time and the product is fabulous",
                "review_posted_date": "08 Feb 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "On time and exactly as described.",
                "review_posted_date": "12 Jan 2018",
                "review_header": "Great seller.....great product. 5 star.",
                "review_rating": "5.0 ",
                "review_author": "By Christopher"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=4",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "Just received mines it’s amazing",
                "review_posted_date": "18 Nov 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Adam"
            },
            {
                "review_text": "This is WebOS reborn and good riddance Home Button - after using this you won’t ever go back to such a clunky unintuitive way to do things again - WebOS was doing this in 2007 - with the X Apple has caught up at last and in doing so has left every other present (Android and iOS) offering left for dead. (Watch some YouTube videos of iPhone X and WebOS comparisons - remarkably similar - took Apple 10 years to catch up) I won’t much go over how gorgeous the hardware is - that’s evident.- I mean just look at it and handle it. I have the 64 GB silver - which is the most attractive version. The back of it glows - it’s beautiful to behold and wonderful to Handle and use - couple it with the Spigen Clear case - don’t hide the elegance and beauty - and those cases protect well using advanced materials for under £8. (In 5 years I’ve never damaged a phone when using the Spigen Clear). The screen is bigger than that of an iPhone Plus - but the handset is regular iPhone (6,7,8) sized - a tad bigger but hardly noticeable in the hand - and yes, unlike the iPhone Plus you can use this more or less one handed. The build quality is impeccable - it really is a premium device - the touch and feel - materials used - the screen pops at you (the ‘notch’ has the cameras and is a design feature which reminds me of the bite taken out of the Apple - it differentiates your device from a common or garden Android cross breed) and the speakers are evidently louder and fuller with more range of sound and resonance than normal mobile phone speakers - so you can actually listen to music on it. (I wonder how the built in sound DSP DAC compares and fares in tests?) Battery life is the best I’ve seen on a smartphone - a whole day of heavy use and by midnight I still had 40%. Reception and call quality again is as good as you can get. The hardware is gorgeous and coupled with the advanced internals you the have best handset on the market. But gorgeous hardware isn’t what makes a phone great - that’s the OS - and a modern OS should be user friendly, intuitive, beautiful to look at and a joy to use - it should also be fast and stable - so no annoying crashes or screen lock ups - this flies through every test and is a pleasure to use. Firstly Face ID - works more efficiently and more responsive than the finger sensor - works even in the dark and early morning with curtains shut and face screwed up - also effortlessly works with the browser, App Store purchases and other apps - and most apps have been updated to use this plus the gestures and screen of this iPhone X. The OS is a killer - the removal of the home button is a massive plus feature which turns a clunky device into magic - leaving any half baked Android offering eating dust. iOS 11 on the iPhone X is WebOS 2017 - to think that Palm was so far ahead of its time - it built the most elegant and intuitive mobile phone OS back in the noughties - it’s give or take what the experience on the iPhone X is today. The iPhone X is beautiful to use intuitive gesture based card system more of less as was WebOS - switching apps? Swipe across the bottom - closing apps? Gently touch and Swipe a card up - switch apps? Swipe up and select the cards - and it multitasks properly - the camera and YouTube will run in card form (as on the WebOS TouchPad and Pre 3) - using every part of the screen to good effect - swipe from top right - from top or bottom reveals other features - and all fast responsive and with not a single crash or screen lock up in sight. I always hated the home button - coming from WebOS and HP Touchpad the iOS of the day was clunky and unintuitive - I noticed over the years how the iOS versions slowly morphed into what WebOS was - the morphing is complete with the dropping of the Hone Button and an adoption of an elegant intuitive card gesture based system which is a pleasure to use - the iPhone X is the best handset in the market and with the new iOS version it’s clearly the most beautiful intuitive elegant and user friendly - most stable and effortless OS on the market. A winner - thank you Apple and thank you Palm WebOS.",
                "review_posted_date": "16 Nov 2017",
                "review_header": "WebOS reborn - the most beautiful, elegant, intuitive, user friendly, stable OS on the best hardware",
                "review_rating": "5.0 ",
                "review_author": "By Ibraar 'Le Saracen'"
            },
            {
                "review_text": "This is a great phone with an amazing camera. The facial recognition really blew me away. And the case is thin enough that it can charge on a charging mat (not provided) if that's your fancy. Plenty of memory and I just inserted a SIM card from my \"pay as you go\" provider and now I enjoy all the features and benefits without the expensive cell phone contracts that others use. I will advise you that this phone sells for approximately $1,150 in retail stores everywhere, so don't be taken in by sellers asking $1,300 or more. If you intend use this for a non-contract provider, you may have to enter the APN information from your provider in order for the phone to have full functionality (such as sending photos with text messages). Also, not all pay as you go providers guarantee the phone will work with their service, so be sure to find out before you make the phone purchase.",
                "review_posted_date": "01 Jan 2018",
                "review_header": "Welcome to the future with the iPhone X",
                "review_rating": "5.0 ",
                "review_author": "By Thomas King"
            },
            {
                "review_text": "Just got my iPhone X yesterday as an upgrade to a still fully functional iPhone 6+. Is it a good phone? Certainly. Definitely in the top 5 out there. The point is, if you are like me, your phone is a utilitarian device. As such the iPhone X is really not a very impressive upgrade from the iPhone 6+. Is the screen better? Yes but so what? The 6+ screen was fine and the differences, as a practical matter, are not important. It is faster but the 6+ was more than fast enough. Better cameras. Sure. But who cares? The 6+ cameras were good enough. Aesthetics are better but, again, not earth shattering and not worth a premium upgrade. The UI changes are a PIA. Sure, you can learn them but I can’t say they are better - just different. Why fix something that was not broken. Battery life is not substantially different. All in all, was it worth the upgrade? Not really. This is not saying the iPhone X is not a good phone. It is but it as a practical matter, the functionality of the improvement is marginal at best. I think Apple has run out of ideas or this product category is now so mature that there is little useful innovation left to squeeze out. What would be impressive and ground breaking? Radically improved radio performance or battery life. That would make for a marked improvement in utility.",
                "review_posted_date": "02 Dec 2017",
                "review_header": "Good phone but not impressively better",
                "review_rating": "3.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "iPhone X review: This is me telling what it has been like with the iPhone X the past six days of me using the device. Feel of device: Great feel to the device , the glass back makes the device less slippery but also trades off for more fingerprints. The glass back makes it heavier then the iPhone 7 but I like that because it’s feels more premium to the hand. Battery: The battery has but ok for the phone size , in a heavy user can I can get 10 hours out of the device with 5 sot. So I would it’s good battery life but it could be better if apple give us a bigger battery. Light user will get through a full day with no problem. Screen : What can I say this screen is the best one to touch an iPhone yet! I lover the way everything just pops at you with this display . It’s on par with the Note 8 screen if not better from my personal believe. This screen is longer then the one on the 7 plus but it is not as wide as that screen and I like that but many people do not! It feels better in my hand with the more narrow screen. Speakers: They are very loud compared to my iPhone 7 Plus big upgrade. I keep them around 70% volume. It’s very clear and crisp ! They ear speaker at the top is about loud as the bottom fire speaker now ! That’s no exaggeration neither. No Touch ID: I forget about it completely but I did see myself reaching for it the first two days of use. Face ID: I’m loving it so far! It was a learning curve though you can’t put it to close or to far away from your face. I found the elbow length away from your face is the perfect position. It does work in complete darkness I tested this while and a closet a night time lol. Cameras: if you had the iPhone 7 like me the iPhone X cameras are a slight improvement with quality, The stabilization is what has improved greatly ! Everybody that has shakey hands recording I’m glad to say the iPhone X is your cure. Portrait mode is great when it works ! You have to have perfectly lighting and also have to be close to the phone for it to work I hate that . When you do it get to work the results are amazing to say the least. The notch: Your eyes will naturally start to ignore it if it’s not even there. Overall experience: I’m liking this device and enjoying everything about , the multitasking is better now because you can just switch through apps from a left swipe from bottom of screen, One thing that is keeping me from recommending this phone is the price tag. No phone should cost $1,000 and I urge anyone only to buy this phone if you can get it at a discount and if you can get it at a bargain I would tell everybody to try the iPhone X out for a go!!",
                "review_posted_date": "09 Nov 2017",
                "review_header": "Phone of the year!!",
                "review_rating": "5.0 ",
                "review_author": "By Marcus Jackson"
            },
            {
                "review_text": "sO APo0RDIAbLE aND iT wORk. I!T dE3F!nETlIY wORtH DThE mON3Y",
                "review_posted_date": "14 Nov 2017",
                "review_header": "pLZ BUy THesEyEPFoNE",
                "review_rating": "5.0 ",
                "review_author": "By Another shopper"
            },
            {
                "review_text": "It is the best iphone I've ever had, I've had Iphone 5, 5s, 6, 6S Plus, 7 Plus This is by far the better, right size, nice presentation, fast, good new features. New gestures to activate but not problema at all, I learnt them very fast",
                "review_posted_date": "29 Dec 2017",
                "review_header": "My Best Iphone",
                "review_rating": "5.0 ",
                "review_author": "By Jose Antonio Perez"
            },
            {
                "review_text": "Let me start off by saying I am not a big Apple fan. I use an hp windows computer, I use google chrome cast, I don’t like the giant that is Apple. I used to have an Android phone and after dealing with the freezing up, and it giving me issues I purchased an I phone 6s. That phone served me well and was extremely reliable. Recently it was time for me to upgrade, and I was intrigued by the look of the I phone x. I let the idea of spending a grand on a new phone stew in my mind for a month and debated getting a 8 plus instead. After spending 3 hours of testing out both the x and the 8 plus at the Apple store, I decided it was worth it for me to spend a little more for a much better phone. The ergonomics of this phone are unreal, it’s super snappy and fast, never skips a beat. I have been using it for a month now and can confidently report the battery leaves nothing to be desired, the wireless charging is a treat, and I am so happy with this phone and genuinely believe the money was well spent on it. I love this phone. If your debating getting one just go for it you won’t regret it.",
                "review_posted_date": "04 Mar 2018",
                "review_header": "An unbiased review!",
                "review_rating": "5.0 ",
                "review_author": "By eric"
            },
            {
                "review_text": "The phone arrived in perfect condition. Well packaged and satisfying to unbox. Brand new and sealed!",
                "review_posted_date": "13 Nov 2017",
                "review_header": "Excellent Phone!",
                "review_rating": "5.0 ",
                "review_author": "By Angel Mena"
            },
            {
                "review_text": "I bought the iPhone X on December 1, which was about a month after its initial release. My previous phone was an iPhone 4, so the iPhone X was quite an upgrade. There was a great deal of anticipation for the iPhone X, because it was the tenth anniversary of the original iPhone. I had contemplated buying the iPhone 7 plus in 2016, but made the decision to wait another year for the highly advertised iPhone X. The criteria I evaluated while shopping for my perfect phone and will be valuable for fellow phone shoppers was Specifications, User Friendliness, and Durability. I will explain why the iPhone X was worth the wait and is a fantastic product for fellow phone shoppers! Specifications What was initially clear with my new iPhone was how sharp and vibrant the screen was. The iPhone X uses a super retina display, with 2436-by-1125 pixel resolution and a contrast ratio of 1,000,000:1. The iPhone X was an attractive phone for me because of its upgrade from LCD technology to OLED. I am pleased with the battery life of the iPhone X, and on many occasions my phone has lasted more than a day before needing a recharge which phone shoppers could very well find as useful as I do. While researching the product I found that OLED uses energy more efficiently than LCD which is a contributing factor to the long battery life. User Friendly I quickly became comfortable using my iPhone X. Measuring at a height of 5.65 inches, a width of 2.79 inches, and a weight of 6.14 ounces; the iPhone X is long and wide enough to watch videos or read a book using the kindle app. Phone shoppers will find that It fits comfortably in your pocket, and is easy to hold in one hand. The iPhone X maximizes its size with the entire screen covering the surface area, achieved by scrapping the home button. Another benefit that I enjoy with the iPhone X is its rapid ability to recharge. The iPhone X has fast-charge capability, taking only thirty minutes to charge the battery half full which will save time for its user. Durability The iPhone X has an amazing stainless-steel frame which is thought by many to make a more durable glass. I elected to buy a case for my iPhone. Although I have not dropped my iPhone, I can confidently say that it is in as good condition as it was the day that I bought it. I also decided to pay for insurance while making my phone payment. By taking these cheap precautions, I have peace of mind that my iPhone will bring back more in value than the relatively steep price the iPhone X demands. After owning the iPhone for over two months I can confidently state that it was well worth the wait. My iPhone X has become a valuable tool for my practical day-to day needs and could very well be a valuable tool for fellow shoppers as well. Apple has delivered a thriving product that fellow phone shoppers have anticipated for over a year. If I could go back I would make the same decision again, and purchase the iPhone X. I love my new iPhone!",
                "review_posted_date": "09 Feb 2018",
                "review_header": "There was a great deal of anticipation for the iPhone X",
                "review_rating": "5.0 ",
                "review_author": "By Kyle strothcamp"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=5",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "I think people need to comprehend if they are reviewing the price OR THE PEFORMANCE OF THE PHONE. You can’t give a crappy review because you don’t like the price. As for me I’m pretty much bleh towards the phone. Have had it almost a week and I guess it was worth 1000. If it disappeared tomorrow and I had to go back to my 6s plus, don’t think I would bat an eye. But I cannot say that it is full of bugs and issues. Does take some getting used to on no home button but have not had any problems with mine. Would also suggest the lifeproof next case. Otterbox was junk in terms of how the side buttons would respond. Lifeproof slam doesn’t cover the charging port and really doesn’t have much water repelleing properties (yes I know the X aready has water resistant properties). Life proof next covers all ports and really works greatwith the side buttons. Plus clear back shows the exterior of the phone nicely.",
                "review_posted_date": "08 Nov 2017",
                "review_header": "Rate the phone not the price",
                "review_rating": "4.0 ",
                "review_author": "By Omar"
            },
            {
                "review_text": "I upgraded from the iPhone 6+ to the X at full price through AT&T. It took nearly 6 weeks to receive. It is significantly small than the iPhone 6 plus by size. The actual screen dimensions is about the same. Yes, the color is somewhat brighter but the clarity and brightness is not (even with adjustments). Simple to set up and outside of no home button (swipe up), it is essentially the same layout. I would agree with other reviewers, it is no faster than the older model. The camera does produce a nicer photo but is this device worth $1300 for a better camera? I do not think so. You could purchase an even nicer camera for less. Facial recognition is fair to good but far from perfect. I ended up switching to digital security since I use the phone for work. I need as close to absolute security as possible. Speaker sound is better in volume and clarity. As you go from screen to screen (different applications), you can literally feel the phone shake like one use to feel hard drives activate in older laptops. I do not know what is up with this since in all my previous iPhones I never felt any mechanical movement from the phone itself. Everything works appropriately but this brief vibration is more annoying to me than the absence of the home button and being able to turn the phone off my pressing one button instead of two. Bad workmanship to engineering. Bottom line: if you do not absolutely have to upgrade your phone or you are not receiving the phone free (AT&T is giving a free iPhone 8 with an added line), then I would wait for the next generation. A larger phone is anticipated with the \"X\" features but I must admit I find the \"X\" is under-featured when it comes to being a pivotal new generation of iPhones. The iPhone X is anything but pivotal, ground breaking (outside of dropping it, it will indeed break) or full of new useful features you do not already have on your current iPhone. Even if I had to upgrade I would go with the iPhone 8 plus over the \"X\" since you keep the home button and larger size is nice for jacket pocket and those with bigger hands. To say I am disappointed in the iPhone X is an understatement. I have monitors which are more impressive than this phone's screen and cost a third of this phone. In my world, I have already abandoned the Apple laptops and iMacs for my workplace and home for similar unimpressive advancements in technology. I am now going to do the same with my phones as well. Will try Samsung and other models for the future. Apple is loosing their magic touch since the loss of Steve Jobs. Some individuals do indeed make a company great. I have little doubt Jobs would have been very unhappy with this iPhone and would never have released it but made the company wait 6-12 months to have something truly better than the status quo. Otherwise it is my conviction this model was put out to make money and all of us fools who fell for this are now truly paying the price. This is a turning point for me with Apple. I am done with their products. I am done with iTunes (music). \"Alexa, never order any more Apple products for me! And please play current hits and call my office.\"",
                "review_posted_date": "07 Dec 2017",
                "review_header": "No Stars for the iPhone X........ buyer beware........",
                "review_rating": "1.0 ",
                "review_author": "By FrankMD"
            },
            {
                "review_text": "Why my iphone has a tmobile chip Inside??? I dont understand because is new that wouldnt happend !!!!",
                "review_posted_date": "07 Dec 2017",
                "review_header": "Iphone not new",
                "review_rating": "1.0 ",
                "review_author": "By EB"
            },
            {
                "review_text": "worst product i ever saw when i got the phone it was damage badly and i paid for shipping and handly",
                "review_posted_date": "15 Feb 2018",
                "review_header": "worst product i ever saw when i got the phone ...",
                "review_rating": "1.0 ",
                "review_author": "By Romae"
            },
            {
                "review_text": "Someone with five helpful reviews stated that the iPhone for sale here is fake using the evidence that the iPhone on the back say iPhone X, this is completely untrue if you go to the Apple site and look at the back of the phone it just says iPhone.",
                "review_posted_date": "26 Nov 2017",
                "review_header": "Someone with five helpful reviews stated that the iPhone for ...",
                "review_rating": "4.0 ",
                "review_author": "By iamcloud"
            },
            {
                "review_text": "Awesome phone! Just ship things on time next time.",
                "review_posted_date": "22 Nov 2017",
                "review_header": "Awesome phone! Just ship things on time next time",
                "review_rating": "5.0 ",
                "review_author": "By deo"
            },
            {
                "review_text": "Nice phone and it’s real, now I just write this review with this phone!🤙",
                "review_posted_date": "13 Dec 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "The phone was quick to overheat during i cloud backups, most buggy iphone i ever had, screen dimensions and format are terrible, worse than any previous phones, curved edges and notch at top gove you less surface than th8 plus and in some cases maybe even thr 8, app developers yet to optimize apps, wasted space at bottom of phone and top as apps and even imessages dont use it.",
                "review_posted_date": "16 Dec 2017",
                "review_header": "screen dimensions and format are terrible, worse than any previous phones",
                "review_rating": "2.0 ",
                "review_author": "By Michael S. Burridge"
            },
            {
                "review_text": "Perfect phone and perfect transaction - A+++ vendor. Thank you",
                "review_posted_date": "17 Nov 2017",
                "review_header": "Beautiful phone and perfect transaction",
                "review_rating": "5.0 ",
                "review_author": "By Ravindar B."
            },
            {
                "review_text": "Shipping arrive one time phone was brand new in a seal box",
                "review_posted_date": "04 Dec 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Xaymara melendez"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=6",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "Great phone. I love it. I need iphone for my business so im buying for show off. Works great and thats what i need. Thank u",
                "review_posted_date": "17 Dec 2017",
                "review_header": "Great phone. I love it",
                "review_rating": "5.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "Thankx",
                "review_posted_date": "14 Nov 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Kamel kader ortiz"
            },
            {
                "review_text": "I've had an iPhone for many years & was very excited to hear about this one. I love how there's no home button, which I thought would annoy me. Unfortunately, its not at all stable. My first iPhone X completely died from 40% battery charge. I left it plugged in for the whole day to a working charger & it still wouldn't turn on. I went to an Apple Store, and they replaced it. The second iPhone X worked very well until tonight. Now, it will not open any links in Safari. Both iPhones have refused to unlock with a passcode...sometimes crashing as many as 6 times in a row before unlocking. Its kind of ridiculous how Apple could put out an iPhone like this, when its pretty obviously still a test model. I've been an Apple user my whole life, and this is the first time I've been so disappointed by one of their products.",
                "review_posted_date": "04 Dec 2017",
                "review_header": "Clearly an unstable test model",
                "review_rating": "1.0 ",
                "review_author": "By Kathryn Sakai"
            },
            {
                "review_text": "Best iPhone ever",
                "review_posted_date": "08 Dec 2017",
                "review_header": "Almost alien",
                "review_rating": "5.0 ",
                "review_author": "By Eugene"
            },
            {
                "review_text": "This is the worst iPhone I’ve had the miss fortune of having. It malfunctions all the time and doesn’t work all the time when you press simple radio buttons for the flash light, very frustrating. Pictures are good, but so are the 7.",
                "review_posted_date": "18 Dec 2017",
                "review_header": "This is the worst iPhone I’ve had the miss fortune of having",
                "review_rating": "1.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "The phone wouldn’t charge and the screen freezes to much",
                "review_posted_date": "11 Dec 2017",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "By Dannae"
            },
            {
                "review_text": "LOVE IT",
                "review_posted_date": "25 Dec 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By MelJoe"
            },
            {
                "review_text": "Too buggy. I liked my iPhone 8 better. The top part of the screen seems like such a waste. It looks cool, but still. I was hoping to have a solid contender to the Pixel 2 XL that Google sent me to beta test, but it didn't seem to match up. The display itself on the iPhone X is beautiful. The colors are a bit better than the Pixel 2 XL's, but not enough to look past the other shortcomings. The camera on the iPhone X is really cool, but for the type of photos I like to take, the Pixel 2 XL's camera wins. If I still had my iPhone 8, I would definitely prefer it over the iPhone X. I think Apple went a little too high on the cost at first and didn't properly delegate their time on the other aspects of the device that were also important. I know Apple will quickly fix the bugs and weird quirks the iPhone X has now, but it would've been nice to feel like the money was well spent when I received it. I'll update my review in a month.",
                "review_posted_date": "16 Nov 2017",
                "review_header": "Liked My iPhone 8 Better...",
                "review_rating": "2.0 ",
                "review_author": "By Tank Shake"
            },
            {
                "review_text": "It was no SIM card in the package. Not good.",
                "review_posted_date": "05 Mar 2018",
                "review_header": "Not good.",
                "review_rating": "1.0 ",
                "review_author": "By jeff"
            },
            {
                "review_text": "Unlike the iPhone 8 Plus, here the camera module has sharp edges and is positioned vertically. When the device is on the table, on the back, it actually always lies on the camera module and if you press the housing, it starts walking on a flat surface. The dimensions of the device are such that it is wide and quite noticeably cuts into the hand. The back panel is made of tempered glass, as well as the front panel covering the screen with oleophobic coating, but the marks from the hands are clearly visible. The glass panel behind is needed for wireless charging. On the left side there is a lever, which includes a noiseless mode, below - two volume keys. On the right side, the on / off button (in fact, it's now unlocking and calling Siri), just below - the tray for the nanoSIM card. At the bottom of the right is the speaker, the second speaker is on the front panel above the screen. They work in pairs, and the volume of the sound is different, for this parameter iPhone X can give odds to many flagships, and I like it in this aspect. The microphone is on the bottom end, and also at the camera block behind. At the top end, the microphone was not placed. The noise reduction system works medium, in noisy conditions your interlocutor hears strange sounds. Places for the percentage of battery power on the display just do not. In iPhone X, the battery charge is very quickly consumed during voice calls, which is not typical for such devices. Unlike a fingerprint, you can register only one person. No way to share the phone with biometrics, only a password that can be passed on to someone. In practice, face recognition is quickly adjusted. When driving the iPhone X, the phone holder will have to be strongly shifted to the left to the handlebar, and also tilt it towards the face, otherwise no recognition occurs. I really like how the device records video (especially 4K at a rate of 60 frames per second), but this video can only be viewed on the device itself, since a new compression format is used, when transmitting all video is converted. In the maximum resolution mode, the sound is written to one microphone. In iPhone X changed the interface and it will take a little time to get used to the lack of the \"Home\" key.",
                "review_posted_date": "26 Nov 2017",
                "review_header": "First impressions after a week of use",
                "review_rating": "4.0 ",
                "review_author": "By Armen"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=7",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "easily broke I want another one, didn't work at all",
                "review_posted_date": "04 Mar 2018",
                "review_header": "Ripoff",
                "review_rating": "1.0 ",
                "review_author": "By larry"
            },
            {
                "review_text": "Excellent phone very pleased with it",
                "review_posted_date": "30 Dec 2017",
                "review_header": "Apple has done a great work with there product",
                "review_rating": "5.0 ",
                "review_author": "By Don Gavey"
            },
            {
                "review_text": "It’s slower to start up and the facial recognition only works part of the time. No home button just means form over function. The iOS is buggy and hangs up when you switch between apps.",
                "review_posted_date": "06 Dec 2017",
                "review_header": "Don’t upgrade, it’s a downgrade",
                "review_rating": "1.0 ",
                "review_author": "By rossco"
            },
            {
                "review_text": "Very good",
                "review_posted_date": "09 Dec 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By jeimy sanchez"
            },
            {
                "review_text": "Awesome",
                "review_posted_date": "07 Dec 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By Dawn"
            },
            {
                "review_text": "Seems like a great product and I would really enjoy a free sample of this product to test and promote this product",
                "review_posted_date": "12 Dec 2017",
                "review_header": "Seems like a great product and I would really enjoy a ...",
                "review_rating": "5.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "I will promote your product on Twitter if you give me a free sample.",
                "review_posted_date": "19 Jan 2018",
                "review_header": "This phone is the best.",
                "review_rating": "5.0 ",
                "review_author": "By Valerio"
            },
            {
                "review_text": "Hey there I am a YouTubed and I am wanting to do a video over the new iPhone X I would like a free sample please thank you!!",
                "review_posted_date": "27 Nov 2017",
                "review_header": "Sample!!",
                "review_rating": "5.0 ",
                "review_author": "By Burke"
            },
            {
                "review_text": "You can’t come in and hate on this company for their price when that is actually the exact price that apple is selling the phone for. If you don’t like it go complain to apple, but don’t leave this company bad reviews just because you feel like it",
                "review_posted_date": "05 Nov 2017",
                "review_header": "iPhone X",
                "review_rating": "5.0 ",
                "review_author": "By Patrick B."
            },
            {
                "review_text": "I would like to try this product",
                "review_posted_date": "26 Jan 2018",
                "review_header": "Four Stars",
                "review_rating": "4.0 ",
                "review_author": "By Joel McAllister"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=8",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "IPHONE X is our future.",
                "review_posted_date": "05 Nov 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "By jeong"
            },
            {
                "review_text": "There’s no reason to hate on a newly released phone that is the same price as buying it directly from Apple. I think these phones are awesome. Of course, I don’t have the money or an issue with my current phone, so I can’t buy it now, but rest assured I would.",
                "review_posted_date": "05 Nov 2017",
                "review_header": "There’s no reason to hate on a newly released phone that is the same ...",
                "review_rating": "5.0 ",
                "review_author": "By MJHufflepuff"
            },
            {
                "review_text": "iPhone does work, but you can get it cheaper at an apple store or other tech stores",
                "review_posted_date": "07 Nov 2017",
                "review_header": "Two Stars",
                "review_rating": "2.0 ",
                "review_author": "By Gustav Salkinder"
            },
            {
                "review_text": "Not a good iphone",
                "review_posted_date": "19 Dec 2017",
                "review_header": "So bad",
                "review_rating": "1.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "If u were a teen in the 90's u were called generation x do not buy this if so through medical and dental equipment, unknown to medical employees and dentists, large satanic corporations have been depositing micro chips into our bodies. this phone will activate them. Angelic battles are faught on Earth. I love my iphone with tge forbidden fruit apple reference, but make no mistake I deactivate my microchips with neotrinilliym magnets and i believe in God as well as more heavenly planets... u were warned.",
                "review_posted_date": "06 Dec 2017",
                "review_header": "serious stuff",
                "review_rating": "1.0 ",
                "review_author": "By Anomaly"
            },
            {
                "review_text": "No headphone jack",
                "review_posted_date": "04 Dec 2017",
                "review_header": "No headphone jack",
                "review_rating": "1.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "Awesome paperweight!! Best paperweight on amazon. My favorite part of this phone is the included 6 month self destruct feature. You know, when the battery turns into a 1hr battery and won't hold a charge. It's fun because everyone else that had an apple does a social huddle around a wall outlet, enabling you to meet other window licking doofuses that bought phones with antiquated technology. Do yourself a favor, and buy a jitterbug. If you're ready to be a human, buy an Android. If you want to continue panic charging and eating lead paint ...stick with apple.",
                "review_posted_date": "14 Nov 2017",
                "review_header": "Best paperweight in history!",
                "review_rating": "1.0 ",
                "review_author": "By Michael S."
            },
            {
                "review_text": "1500 is not a price anyone should ever be willing to pay for a phone. It better drive my car and help me fight crime! Otherwise it'll be a crime to pay for it.",
                "review_posted_date": "05 Nov 2017",
                "review_header": "It better drive my car and help me fight crime",
                "review_rating": "1.0 ",
                "review_author": "By William Shafer"
            },
            {
                "review_text": "It's Fake... If You Look At The Back It Only Says iPhone.. It's Supposed To Say iPhone X.",
                "review_posted_date": "12 Nov 2017",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "Terrible phone",
                "review_posted_date": "18 Nov 2017",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "By Kindle Customer"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=9",
        "name": ""
    }
][
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "Way too much money for a phone of any type!!",
                "review_posted_date": "03 Nov 2017",
                "review_header": "Not worth the money!",
                "review_rating": "1.0 ",
                "review_author": "By William Boyd"
            },
            {
                "review_text": "PROBLEM IS MY TWIN BROTHER !",
                "review_posted_date": "06 Nov 2017",
                "review_header": "Two Stars",
                "review_rating": "2.0 ",
                "review_author": "By Gerry L"
            },
            {
                "review_text": "This phone is nice but it's made from Samsung screen and this phone only has 12mp of cam Samsumg is the first to make wireless charging an the face id was made by samsung just look at the old samsung phone's and you will see it.",
                "review_posted_date": "06 Nov 2017",
                "review_header": "This phone is nice but it's made from Samsung screen and this phone ...",
                "review_rating": "1.0 ",
                "review_author": "By daniel arvelo"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L/?pageNumber=10",
        "name": ""
    }
]