[
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "4%",
            "1 star": "22%"
        },
        "reviews": [
            {
                "review_text": "Don't ever purchase from this vendor. The iPhone arrived with a non-functional power slot in it. It didn't even come close to fitting the power tip and appeared to be missing all electronic connections. This made the iPhone useless since it couldn't be charged. The box looked fake. It was especially devastating since we live in a remote area where we cannot get an iPhone elsewhere and had waited nearly 3 weeks for this to arrive. To realize you've been had this way is especially cruel.",
                "review_posted_date": "22 Feb 2018",
                "review_header": "iPhone didn't work at all",
                "review_rating": "1.0 ",
                "review_author": "By Amazon Customer"
            },
            {
                "review_text": "Everyone reading this is probably familiar with the Apple phone line up so I am going to focus on the differences between the iPhone X and iPhone 7 plus specifically. First off, the set-up process has been significantly streamlined. When setting up your new iPhone X setup will ask you if your old iPhone is nearby, select yes, and you can wireless transfer all your apps, settings, backgrounds, passwords, etc. to your new phone in a few clicks. I really appreciated this streamlined process and it was incredibly quick and easy to transfer all my settings to my new iPhone X. The other main features that have been upgraded are as follows: New screen (5.8” OLED is the most vibrant and clear screen ever produced by Apple) - Apple has removed the touch ID sensor and bezel around the old iPhone screen which means the iPhone X has a noticeably smaller footprint while maintaining a larger screen size than the iPhone 7/8 Plus. (See comparison images attached of the iPhone X versus iPhone 7 Plus). - OLED Screen offers deeper blacks and brighter whites resulting in greater color reproduction. - Similar to the iPhone 8 and 8 Plus the iPhone X uses true tone technology to mimic the lighting conditions around it and adjust the white balance accordingly. - The notch cut out of the top of the screen is where Apple has included the face recognition sensors, front camera, and a host of other sensors. I thought this would be annoying but Apple has cleverly used the screen real estate on both sides to include the time, date, battery indicators, etc. Farewell Touch-ID, Hello Face-ID - Face-ID is Apples new facial recognition technology which has replaced the finger printer reader and home button in order to free up additional screen real-estate. This is new and only available on the iPhone X. - Apples facial recognition is light years ahead of Samsung or any other carrier. I have tested this flawlessly with glasses, a hat, and even in the dark. It is as simple as looking at your phone and swiping up from the bottom. - I was worried this feature would be inconsistent or frustrating but it has worked really well. The only time it is a bit more inconvenient is if the phone is sitting on your desk or a flat surface you kind of have to lean over a bit or angle the phone towards you to unlock it. - This super powerful new camera also enables the animoji features which maps your facial expressions to create a talking emoji. This is a fun feature but more a novelty than anything. - This same true-depth camera makes the iPhone X the ultimate phone for taking selfies. The new portrait mode allows the user blur the background, or even cut yourself out entirely and place yourself on a black background. Additional noteworthy features and changes: - The rear camera boasts a dual 12MP sensor array with improved aperture and wide angle lens with image stabilization. The increased aperture from 2.8 to 2.4 allows for better images in low light conditions. - Video capabilities have also approved as well to include 60p 4k video recording delivering clear, fluid images. - Increased audio quality and volume - Increased RAM size to 3GB and new Bionic Chip makes the iPhone X one of the most powerful smartphones are the market. - Updated design features glass back and sides which make the phone beautiful looking. A very welcome change in the normal design. - Battery life: The iPhone X boasts the largest battery in Apple history with a 2716 mAh battery which is a bit larger than the new iPhone 8 Plus. A full charge from 0-100% takes about 2 hours and 10 minutes in my testing. - In addition, wireless charging has finally been added to the new iPhone X, and 8 series phones. I have not tested this out but am excited to give it a try (Wireless charging pad is not included with the phone). Bottom line, the iPhone X is another smash hit from Apple. Every feature people were concerned about turned out to work flawlessly as usual. I have only had the iPhone for about 24 hours so it is early to leave a long-term focused review but so far the new iPhone X has lived up to the hype. The iPhone X may not revolutionize the smart phone industry but it is a welcome upgrade to the iPhone which designs were getting a bit dated. I am excited about Apples new strategy to release a flagship model and allow the new features to trickle down to next generation’s phones. If you have the money to spare you won’t likely be disappointed. My only complaint is the phone only comes in 64GB or 256GB basically forcing users to pay an extra $150 to get decent storage. Further, the beautiful glass back on the screen feels fantastic and has a great weight to it. However, a replacement screen will cost you $275+ and the back glass replacement is rumored to cost around $400. Essentially a single drop could result in a $700 repair bill. Unfortunately this means most phones will be shielded in a case and will not be enjoyed. Read less ***Note Carrier Compatibility: All carrier variant iPhone X in the world are carrier unlocked. The one thing will need to note is your current network. There are a number of different iphone variants in the USA such as AT&T, T-mobile, Sprint, and Verizon. A Sim-free version is not available yet. Here is a compatibility breakdown. Verizon Phone: Unlocked, Supports GSM and CDMA. Spring Phone: Unlocked, Supports GSM and CDMA AT&T Phone: Unlocked, Supports GSM Only T-mobile Phone: Unlocked, Supports GSM Only You need a CDMA compatible phone if you are on Verizon or Sprint. GSM phones work with AT&T, T-mobile, and nearly every other international network provider.",
                "review_posted_date": "05 Nov 2017",
                "review_header": "Iphone X: A complete re-design and leap forward for Apple.",
                "review_rating": "5.0 ",
                "review_author": "By V12 Vantage"
            },
            {
                "review_text": "It is what it said it was! It has its own idiosyncrasies, which with patience, can work out. I have given it 4 stars out of 5 because its still one of the best,",
                "review_posted_date": "05 Mar 2018",
                "review_header": "iPhone et al",
                "review_rating": "4.0 ",
                "review_author": "By Candelario Cervantez"
            },
            {
                "review_text": "Great buy. Sealed pack",
                "review_posted_date": "22 Nov 2017",
                "review_header": "Amazing",
                "review_rating": "5.0 ",
                "review_author": "By PSH"
            },
            {
                "review_text": "Unlocked, sealed and fast shipping. Just what I had paid for. Thanks!",
                "review_posted_date": "04 Dec 2017",
                "review_header": "Authentic seller!",
                "review_rating": "5.0 ",
                "review_author": "By sahil"
            },
            {
                "review_text": "i'm loving it every day when I wake up and touch it - it gives me new feeling of likeness since I started using it about two weeks now",
                "review_posted_date": "26 Feb 2018",
                "review_header": "i'm loving it every day when I wake up and ...",
                "review_rating": "5.0 ",
                "review_author": "By Alieu A. Sackor"
            },
            {
                "review_text": "Love my IPhone X from every aspect and it is very sleek.",
                "review_posted_date": "27 Feb 2018",
                "review_header": "Iphone X ....",
                "review_rating": "5.0 ",
                "review_author": "By Jilek_s"
            },
            {
                "review_text": "Great phone, however really not a strong screen as is made out. Dropped it from one metre and the screen is broken in the corner. $300 to repair it- not happy",
                "review_posted_date": "22 Feb 2018",
                "review_header": "Great phone, however really not a strong screen as ...",
                "review_rating": "4.0 ",
                "review_author": "By clare panyandee"
            },
            {
                "review_text": "It’s a great phone",
                "review_posted_date": "18 Dec 2017",
                "review_header": "Expensive but worth it",
                "review_rating": "5.0 ",
                "review_author": "By Wade Ferguson"
            },
            {
                "review_text": "Never worked with my carrier",
                "review_posted_date": "23 Feb 2018",
                "review_header": "Four Stars",
                "review_rating": "4.0 ",
                "review_author": "By Athena"
            }
        ],
        "url": "http://www.amazon.com/product-reviews/B075QMZH2L",
        "name": ""
    }
]