[
    {
        "product_name": "Mind of a Superior Hitter: The Art, Science and Philosophy",
        "description": "Mind of a Superior Hitter: The Art, Science, and Philosophy takes an in-depth look into the key aspects of becoming a great hitter from a psychological, emotional and strategic perspective. The book is designed to enhance the intelligence of hitters in both baseball and softball on a level that is unprecedented. It includes quotes and advice from some of the top hitting coaches in the world, former professional players and prominent minds that have contributed to today’s leading hitting ideologies. Throughout, players and coaches are provided valuable information on what it takes to become a better all-around hitter. Hitters of all ages will learn how to: - MENTALLY DEAL WITH SLUMPS - DEVELOP IMPROVED FOCUSED IN THEIR TRAINING - BECOME A BETTER SITUATIONAL HITTER - CUSTOMIZE THEIR SWING TO FIT THEIR STRENGTHS - BE MORE CONFIDENT AND POSITIVE IN THEIR APPROACH Input from master teacher’s of hitting such as: · Steve Springer, former professional player and hitting coach · C.J. Stewart, former professional player and private hitting coach for pro players · Laura Berg, 4-time All-American softball player, 4-time Olympian and Olympic Hall of Famer · Jacob Cruz, former MLB player and professional hitting instructor",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Mind-Superior-Hitter-Science-Philosophy/dp/069205751X/ref=sr_1_24?s=books&ie=UTF8&qid=1522385152&sr=1-24"
    },
    {
        "product_name": "The Ultimate Yankee Book: From the Beginning to Today: Trivia, Facts and Stats, Oral History, Marker Moments and Legendary Personalities―A History and ... Book About Baseball’s Greatest Franchise",
        "description": "The perfect gift for the diehard fan, an enviable treasure for yourself, The Ultimate Yankee Book is the most current and comprehensive source of trivia, people and stories from the team’s creation in 1901 to today. Harvey Frommer, the celebrated baseball historian and author of eight books about the Yankees, including The New York Yankee Encyclopedia and Remembering Yankee Stadium, has outdone himself this time around. The Ultimate Yankee Book combines oral history with stories of legendary figures and epic Yankee feats. Featuring an exhaustive timeline, a challenging 150-question Yankee quiz, entertaining sections on Yankees by the numbers and nicknames and profiles of dozens of Yankee legends and luminaries, this is a book to treasure and turn to again and again.Yankee fans have bragging rights to call their team the greatest of all time. Not only have the Yankees won the most World Series championships and placed the most players in the Hall of Fame, but the franchise is also the most widely featured team in news, social media and books. This groundbreaking work gives fans what they love: the best stories and a mother lode of data right through 2016. More than 125 archival photos and images are a special feature of The Ultimate Yankee Book.",
        "ratings": "4.8 out of 5 stars",
        "url": "https://www.amazon.com/Ultimate-Yankee-Book-Beginning-Personalities_A/dp/1624144330/ref=sr_1_25?s=books&ie=UTF8&qid=1522385153&sr=1-25"
    },
    {
        "product_name": "A Season in the Sun: The Rise of Mickey Mantle",
        "description": "The story of Mickey Mantle's magnificent 1956 seasonMickey Mantle was the ideal batter for the atomic age, capable of hitting a baseball harder and farther than any other player in history. He was also the perfect idol for postwar America, a wholesome hero from the heartland.In A Season in the Sun, acclaimed historians Randy Roberts and Johnny Smith recount the defining moment of Mantle's legendary career: 1956, when he overcame a host of injuries and critics to become the most celebrated athlete of his time. Taking us from the action on the diamond to Mantle's off-the-field exploits, Roberts and Smith depict Mantle not as an ideal role model or a bitter alcoholic, but a complex man whose faults were smoothed over by sportswriters eager to keep the truth about sports heroes at bay. An incisive portrait of an American icon, A Season in the Sun is an essential work for baseball fans and anyone interested in the 1950s.",
        "ratings": "4.1 out of 5 stars",
        "url": "https://www.amazon.com/Season-Sun-Rise-Mickey-Mantle/dp/0465094422/ref=sr_1_26?s=books&ie=UTF8&qid=1522385153&sr=1-26"
    },
    {
        "product_name": "Gehrig and the Babe: The Friendship and the Feud",
        "description": "The legendary achievements of Babe Ruth and Lou Gehrig are undeniable hallmarks of baseball history. Much has been written about the two men as teammates, but Ruth and Gehrig's relationship away from the field is rarely, if ever, explored. In Gehrig and the Babe, Tony Castro portrays Ruth and Gehrig for what they were: American icons who were remarkably different men. For the first time, readers will learn about a friendship driven apart, an enduring feud which wove its way in and out of their Yankees glory years and chilled their interactions until July 4, 1939—Lou Gehrig Day at Yankee Stadium—when Gehrig’s famous farewell address thawed out their stone silence.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Gehrig-Babe-Friendship-Tony-Castro/dp/162937251X/ref=sr_1_27?s=books&ie=UTF8&qid=1522385153&sr=1-27"
    },
    {
        "product_name": "Coaching Youth Baseball the Ripken Way",
        "description": "Coaching young players, developing their skills, and cultivating a love for the sport may be the most rewarding experience baseball can offer. Cal and Bill Ripken understand this like few others.  From their father, Cal Sr., a legend in the Baltimore Orioles organization for 37 years, they learned to play the game the right way. Those lessons, paired with their combined 33 years of big league experience, helped develop the Ripken Way, a method of teaching the game through simple instruction, solid explanations, encouragement, and a positive atmosphere. In Coaching Youth Baseball the Ripken Way, Cal and Bill share this approach to coaching and development.  Whether you’re teaching your children at home, managing the local travel team, or working with high school-level players, Coaching Youth Baseball the Ripken Way will help you make a difference both on and off the field, with these features: More than 50 drills covering defense, hitting, pitching, and baserunning Age-specific practice plans for players ranging from 4 to 15+ Strategies for setting goals and reasonable expectations for your players and team Advice on communicating with parents, players, and staff Methods for creating a positive and fun environment in which kids can learn the skills and strategies of the game Bill Ripken was once voted by his peers as one of the big league players most likely to become a manager. Cal Ripken, Jr., known as baseball’s Iron Man, is a member of the game’s All-Century Team and a future Hall of Famer. Together, they are proof positive that the Ripken Way is the right way to teach the game of baseball.",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/Coaching-Youth-Baseball-Ripken-Way/dp/0736067825/ref=sr_1_28?s=books&ie=UTF8&qid=1522385153&sr=1-28"
    },
    {
        "product_name": "Life Is Yours to Win: Lessons Forged from the Purpose, Passion, and Magic of Baseball",
        "description": "Now in paperback, the winningest college baseball coach of all time shares his powerful philosophy on life and sports.FROM THE WINNINGEST COACH IN NCAA DIVISION I HISTORY, A GUIDE TO PRACTICING PERFECT AND PLAYING FOR FUN While the statistics speak for themselves, Augie Garrido, the legendary baseball coach, is far from a “win-at-all-costs” leader. Rather, he focuses on building men of quality, teaching that lessons learned on the diamond can be applied to any facet of life. Life Is Yours to Win offers a refreshing approach to seizing life’s opportunities and understanding that trophies are not the true goal. Garrido’s advice includes: • BE A PLAYER, NOT A PROSPECT—Garrido once used a game of catch with his Labrador retriever to show a team playing without heart the character it takes to be fully engaged as a ballplayer. • STEP UP, SUPERMAN—Garrido stages a costumed Superhero Scrimmage each Halloween to remind his players that their inner superhero is just waiting to be realized. • THE FEARLESS FIELD—Master fear and other emotions so that they don’t paralyze you. Renting a hearse and placing a casket on the pitcher’s mound helped a slumping Cal State team “bury” their fears and put past losses behind them. • BUDDHA AT BAT—Small ball is not glorified like the home run, but the bunt does advance the runners and puts runs on the board. Small successes add up to big victories on and off the field. Garrido’s coaching methods are often unconventional, but as seen in Life Is Yours to Win, his creativity and wry humor always lead to unforgettable lessons.",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/Life-Yours-Win-Lessons-Baseball/dp/1439186944/ref=sr_1_29?s=books&ie=UTF8&qid=1522385153&sr=1-29"
    },
    {
        "product_name": "Home of the Braves: The Battle for Baseball in Milwaukee",
        "description": "When the struggling Boston Braves relocated to Milwaukee in March 1953, the city went wild for its new baseball team. Soon, the Braves were winning games, drawing bigger crowds than any team but the Brooklyn Dodgers, and turning Hank Aaron, Eddie Mathews, and Warren Spahn into Hall of Famers. Within five years the team would win a World Series and two pennants.It seemed the dawn of a new dynasty. Impassioned fans wore their hearts on their sleeves. Yet in October 1964 team owners made a shocking announcement: the Braves were moving to Atlanta.In the decades since, many have tried to understand why the Braves left Milwaukee. Fans blamed greedy owners and the lure of Coca Cola cash. Team management claimed they weren't getting enough local support. Patrick Steele delves deeply into all facets of the story, looking at the changing business of baseball in the 1960s, the interactions of the team owners with the government officials who controlled County Stadium, the surging success of the Green Bay Packers, and much more, to understand how the \"Milwaukee Miracle\" went south.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Home-Braves-Battle-Baseball-Milwaukee/dp/0299318109/ref=sr_1_30?s=books&ie=UTF8&qid=1522385153&sr=1-30"
    },
    {
        "product_name": "Bill James Handbook 2018",
        "description": "The Must-Read Book for Serious Baseball Fans, Players, and Coaches&nbsp;Improved! Hall of Fame MonitorExclusive! The Annual Fielding Bible AwardsUpdated! Leader Boards, Defensive Shifts, Pitch Velocities, Managers, Park IndicesNew! Hard Hit Balls AnalysisComplete! Career Data for Every 2012 Major Leaguer (and a few bonus players)Unique! Win Shares, Career Targets, Shits, Instant Replay AnalysisFirst! Remodeled Hitter &amp; Pitcher Projections for 2018&nbsp;Bill James and Baseball Info Solutions team of analysts continue to pack in new content, including a fresh look at the continues rise and effectiveness of The Shift and a new breakdown of home runs and long flyouts. And, as always, the book forecasts fresh hitter and pitcher projections for those looking to get an early jump on the next season.",
        "ratings": "4.4 out of 5 stars",
        "url": "https://www.amazon.com/Bill-James-Handbook-2018/dp/0879465905/ref=sr_1_31?s=books&ie=UTF8&qid=1522385153&sr=1-31"
    },
    {
        "product_name": "The Mental ABCs of Pitching: A Handbook for Performance Enhancement",
        "description": "Author H.A. Dorfman brings his years of expertise as instructor/counselor with the A's, Marlins, and Devil Rays to provide an easy-to-use, A-to-Z handbook which will give insight and instruction on how to pitch to peak performance at every level of the game. Perfect for pitchers who need that extra edge or hitters who want to better understand the mental moves on the mound.With a new foreword by Rick Wolff!",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/Mental-ABCs-Pitching-Performance-Enhancement/dp/1630761842/ref=sr_1_32?s=books&ie=UTF8&qid=1522385153&sr=1-32"
    },
    {
        "product_name": "The Chicago Tribune Book of the Chicago White Sox: A Decade-by-Decade History",
        "description": "The Chicago Tribune Book of the Chicago White Sox is a decade-by-decade look at one of the American League's original eight teams, starting with the franchise's Windy City beginnings in 1900 as the Chicago White Stockings (the former name of crosstown rivals the Cubs) and ending with the current team.For more than a century, the Chicago Tribune has documented every Sox season through original reporting, photography, and box scores. For the first time, this mountain of Sox history has been mined and curated by the paper's sports department into a single one-of-a-kind volume. Each era in Sox history includes its own timeline, profiles of key players and coaches, and feature stories that highlight it all, from the heavy hitters to the no-hitters to the one-hit wonders.To be a Sox fan means to know breathtaking highs and dramatic lows. The team's halcyon days―starting with the championship it won during the first official season of the newly formed American League in 1901―have always been punctuated with doldrums and stormy stretches, including a period of time in the '80s when it looked likely that the team would leave Chicago. But with the diehard support of their fans, the \"Good Guys\" have always made a comeback―including the team's landmark 2005 World Series win, the first by any Chicago major league team in 88 years. This book records it all.The award-winning journalists, photographers, and editors of the Chicago Tribune have produced a comprehensive collector's item that every Sox fan will love.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Chicago-Tribune-White-Decade-Decade/dp/157284244X/ref=sr_1_33?s=books&ie=UTF8&qid=1522385153&sr=1-33"
    },
    {
        "product_name": "Fairly at Bat: My 50 years in baseball, from the batter's box to the broadcast booth",
        "description": "Ron Fairly had an unbelievable 1958, in which he started the year playing baseball at the University of Southern California and ended it as a member of the Los Angeles Dodgers. And then it got better.Fairly at Bat is a dramatic, funny, and altogether entertaining romp through a 50-year career as a player and broadcaster, including as a member of three World Series champion Dodgers teams in the 1950s and ‘60s.All the stars of those great teams are here, not just as players, but as people, teammates and friends. The old guard from Brooklyn and the new stars in Los Angeles: Gil Hodges, Duke Snider, Carl Furillo, Frank Howard, Don Drysdale, Sandy Koufax, Maury Wills and so many more. How the Dodgers who came west made Los Angeles their own, even winning a World Series in a football stadium until Dodger Stadium was built.Fairly takes you into the lives of baseball players of the 1960s and ‘70s, not only between the basepaths, but in off-hours before and after the games. His memoir includes not only the Dodgers, but players he faced such as Cardinals Hall of Fame pitcher Bob Gibson, or just met along the way, like Red Sox hitting star Ted Williams.The incidents are famous, of course, like the 1963 World Series sweep of the New York Yankees, how a bad scouting report almost cost the Dodgers the 1965 World Series and what it was like to be swept by Baltimore in the 1966 Series. The way baseball was in a rougher time, with brushback pitches and even the infamous Marichal-Roseboro brawl in 1965.Fairly pulls no punches, discussing his relationship with the Dodger management, including owner Walter O'Malley, general manager Buzzie Bavasi and manager Walter Alston. He includes an amazing story about Alston pulling a star pitcher after 10 pitches ... in batting practice!So much more: why Fairly chose USC for college over UCLA, even though he was offered a basketball scholarship by Bruins coach John Wooden, what Vero Beach was like in the heyday of Dodgertown and his post-Dodgers odyssey that included All-Star selections in Montreal and Toronto and stints in Oakland, St. Louis and a lucky final stop in Anaheim.He made a very successful transition from player to broadcaster, but just as when he came up with the Dodgers, he had to learn a new trade. Being behind a microphone had its own challenges, much different than those of a player.Fairly at Bat is a memoir shaped by his half-century in the game that originally started as a personal journal that has been transformed into 212 pages of fun that's easy to read and enjoy. Fairly worked with long-time Los Angeles Times sportswriter and author Steve Springer, a veteran of more than a dozen books, including best-selling biographies of Lakers owner Jeanie Buss, boxing champion Oscar de la Hoya and many others.&nbsp;It's illustrated with Fairly's personal photographs, including those from his youth, and many locker room prank shots that showed teammates and friends having a good time as well as playing a game they loved.Fairly at Bat: My 50 years in baseball, from the batter's box to the broadcast booth includes a foreword by Hall of Fame manager Tommy Lasorda, a timeline of Fairly's career from youth baseball in Long Beach, California, to the broadcast booth until his retirement in 2012, and a statistical summary of his 20 years as a major leaguer.“My worst day in a baseball uniform was better than the best day I could have had in any other career.” Share those days with Ron in Fairly at Bat.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Fairly-Bat-baseball-batters-broadcast/dp/0999396722/ref=sr_1_34?s=books&ie=UTF8&qid=1522385153&sr=1-34"
    },
    {
        "product_name": "The Glory of Their Times: The Story of the Early Days of Baseball Told by the Men Who Played It (Harper Perennial Modern Classics)",
        "description": "Baseball was different in earlier days—tougher, rawer, more intimate—when giants like Babe Ruth and Ty Cobb ran the bases. In the monumental classic The Glory of Their Times, the golden era of our national pastime comes alive through the vibrant words of those who played and lived the game.",
        "ratings": "4.8 out of 5 stars",
        "url": "https://www.amazon.com/Glory-Their-Times-Baseball-Perennial/dp/0061994715/ref=sr_1_35?s=books&ie=UTF8&qid=1522385153&sr=1-35"
    },
    {
        "product_name": "Incredible Baseball Stats: The Coolest, Strangest Stats and Facts in Baseball History",
        "description": "As America's pastime since the mid-1800s, baseball offers the sights, sounds, and even smells that are deeply entrenched in our culture. But for some, the experience can be less sensory. Some, such as Ryan Spaeder and Kevin Reavy, live for baseball statistics. Stats give the game historical context and measurables for past, present, and predictive analysis.  Incredible Baseball Stats helps tell unique baseball stories, showcasing extraordinary stats and facts in baseball history, through the 2015 season.  For example, in 2015, the Nationals’ Bryce Harper broke out in a major way. He batted .330/.460/.649 with 42 home runs en route to his first MVP Award. It was his fourth MLB season, but he was still younger than NL Rookie of the Year Kris Bryant. He became the youngest player to lead the league in both on-base percentage and homers in the same season since Ty Cobb in 1909. Through 2015, he has a career .902 OPS (143 OPS+), the same OPS and adjusted OPS that Henry Aaron had through his first four seasons—and Hammerin’ Hank was nearly a year older! The authors have scoured the records for untold tales and looked at familiar ones with new statistical insights, to create Incredible Baseball Stats, a perfect book for baseball fans from coast to coast. Skyhorse Publishing, as well as our Sports Publishing imprint, are proud to publish a broad range of books for readers interested in sports—books about baseball, pro football, college football, pro and college basketball, hockey, or soccer, we have a book about your sport or your team. Whether you are a New York Yankees fan or hail from Red Sox nation; whether you are a die-hard Green Bay Packers or Dallas Cowboys fan; whether you root for the Kentucky Wildcats, Louisville Cardinals, UCLA Bruins, or Kansas Jayhawks; whether you route for the Boston Bruins, Toronto Maple Leafs, Montreal Canadiens, or Los Angeles Kings; we have a book for you. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to publishing books on subjects that are sometimes overlooked by other publishers and to authors whose work might not otherwise find a home. ",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Incredible-Baseball-Stats-Coolest-Strangest/dp/161321894X/ref=sr_1_36?s=books&ie=UTF8&qid=1522385153&sr=1-36"
    },
    {
        "product_name": "Ballplayer",
        "description": "Atlanta Braves third baseman and National Hall of Famer Chipper Jones—one of the greatest switch-hitters in baseball history—shares his remarkable story, while capturing the magic nostalgia that sets baseball apart from every other sport. &nbsp; Before Chipper Jones became an eight-time All-Star who amassed Hall of Fame–worthy statistics during a nineteen-year career with the Atlanta Braves, he was just a country kid from small town Pierson, Florida. A kid who grew up playing baseball in the backyard with his dad dreaming that one day he’d be a major league ballplayer.&nbsp;&nbsp;  &nbsp; With his trademark candor and astonishing recall, Chipper Jones tells the story of his rise to the MLB ranks and what it took to stay with one organization his entire career in an era of booming free agency. His journey begins with learning the art of switch-hitting and takes off after the Braves make him the number one overall pick in the 1990 draft, setting him on course to become the linchpin of their lineup at the height of their fourteen-straight division-title run.  &nbsp; Ballplayer takes readers into the clubhouse of the Braves’ extraordinary dynasty, from the climax of the World Series championship in 1995 to the last-gasp division win by the 2005 “Baby Braves”; all the while sharing pitch-by-pitch dissections of clashes at the plate with some of the all-time great starters, such as Clemens and Johnson, as well as closers such as Wagner and Papelbon. He delves into his relationships with Bobby Cox and his famous Braves brothers—Maddux, Glavine, and Smoltz, among them—and opponents from Cal Ripken Jr. to Barry Bonds. The National League MVP also opens up about his overnight rise to superstardom and the personal pitfalls that came with fame; his spirited rivalry with the New York Mets; his reflections on baseball in the modern era—outrageous money, steroids, and all—and his special last season in 2012.  &nbsp;Ballplayer immerses us in the best of baseball, as if we’re sitting next to Chipper in the dugout on an endless spring day.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Ballplayer-Chipper-Jones/dp/1101984406/ref=sr_1_37?s=books&ie=UTF8&qid=1522385156&sr=1-37"
    },
    {
        "product_name": "Complete Guide to Pitching, The",
        "description": "     There is more to becoming a great pitcher than sound mechanics, a blazing fastball, and a live arm. A pitcher must know how to pitch—what to throw, when to throw it, and where to locate it. He must have a me-versus-you mind-set, that unique blend of confidence and determination that fuels a passion to set the tone of the game, own the mound, and shut down the opponent.   The Complete Guide to Pitching is the most comprehensive pitching resource available. Derek Johnson, one of the game’s premier pitching coaches, takes you inside the art and science of pitching. You’ll discover these strategies:   • Upper- and lower-body pitching mechanics   • Most effective arm and shoulder strengthening workouts   • Shutting down the opponent’s running game   • Developing a potent pitching arsenal, including the splitter, curve, and changeup   • Creating a pregame pitching plan   • Situational strategies and recognizing hitters’ weaknesses   • Fielding the position   • In- and off-season conditioning programs   • Windup, stretch, and follow-through   From pregame warm-ups to cultivating the pitcher–catcher relationship, it’s all here in this one-of-a-kind book and DVD package. Featuring skill instruction, development drills, exercises, personal insights, and instruction on every aspect of pitching, The Complete Guide to Pitching is a must-have for every pitching coach, pitcher, and baseball fan.   ",
        "ratings": "4.8 out of 5 stars",
        "url": "https://www.amazon.com/Complete-Guide-Pitching-Derek-Johnson/dp/0736079017/ref=sr_1_38?s=books&ie=UTF8&qid=1522385156&sr=1-38"
    },
    {
        "product_name": "The Shift: The Next Evolution in Baseball Thinking",
        "description": "With its three-hour-long contests, 162-game seasons, and countless measurable variables, baseball is a sport which lends itself to self-reflection and obsessive analysis. It's a thinking game. It's also a shifting game. Nowhere is this more evident than in the statistical revolution which has swept through the pastime in recent years, bringing metrics like WAR, OPS, and BABIP into front offices and living rooms alike. So what's on the horizon for a game that is constantly evolving?&nbsp;Positioned at the crossroads of sabermetrics and cognitive science, The Shift alters the trajectory of both traditional and analytics-based baseball thought. With a background in clinical psychology as well as experience in major league front offices, Baseball Prospectus' Russell Carleton illuminates advanced statistics and challenges cultural assumptions, demonstrating along the way that data and logic need not be at odds with the human elements of baseball—in fact, they're inextricably intertwined.&nbsp;Covering topics ranging from infield shifts to paradigm shifts, Carleton writes with verve, honesty, and an engaging style, inviting all those who love the game to examine it deeply and maybe a little differently. Data becomes digestible; intangibles are rendered not only accessible, but quantifiable. Casual fans and statheads alike will not want to miss this compelling meditation on what makes baseball tick.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Shift-Next-Evolution-Baseball-Thinking/dp/1629375446/ref=sr_1_39?s=books&ie=UTF8&qid=1522385156&sr=1-39"
    },
    {
        "product_name": "Smart Baseball: The Story Behind the Old Stats That Are Ruining the Game, the New Ones That Are Running It, and the Right Way to Think About Baseball",
        "description": "Predictably Irrational meets Moneyball in ESPN veteran writer and statistical analyst Keith Law’s iconoclastic look at the numbers game of baseball, proving why some of the most trusted stats are surprisingly wrong, explaining what numbers actually work, and exploring what the rise of Big Data means for the future of the sport.For decades, statistics such as batting average, saves recorded, and pitching won-lost records have been used to measure individual players’ and teams’ potential and success. But in the past fifteen years, a revolutionary new standard of measurement—sabermetrics—has been embraced by front offices in Major League Baseball and among fantasy baseball enthusiasts. But while sabermetrics is recognized as being smarter and more accurate, traditionalists, including journalists, fans, and managers, stubbornly believe that the \"old\" way—a combination of outdated numbers and \"gut\" instinct—is still the best way. Baseball, they argue, should be run by people, not by numbers.In this informative and provocative book, the renowned ESPN analyst and senior baseball writer demolishes a century’s worth of accepted wisdom, making the definitive case against the long-established view. Armed with concrete examples from different eras of baseball history, logic, a little math, and lively commentary, he shows how the allegiance to these numbers—dating back to the beginning of the professional game—is firmly rooted not in accuracy or success, but in baseball’s irrational adherence to tradition. While Law gores sacred cows, from clutch performers to RBIs to the infamous save rule, he also demystifies sabermetrics, explaining what these \"new\" numbers really are and why they’re vital. He also considers the game’s future, examining how teams are using Data—from PhDs to sophisticated statistical databases—to build future rosters; changes that will transform baseball and all of professional sports. ",
        "ratings": "4.2 out of 5 stars",
        "url": "https://www.amazon.com/Smart-Baseball-Behind-Ruining-Running/dp/0062490222/ref=sr_1_40?s=books&ie=UTF8&qid=1522385156&sr=1-40"
    },
    {
        "product_name": "Baseball America 2018 Directory: Who's Who in Baseball, and Where to Find Them (Baseball America Directory)",
        "description": "The Baseball America Directory is the single-source reference for every team in every league, whether professional or amateur, where the key personnel reside, and how to get in touch with them.The Directory features key staff and contact information for all major league and minor league teams, as well as all Division I college teams and most significant leagues and other baseball organizations. It also includes all 2018 major and minor league schedules",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Baseball-America-2018-Directory-Where/dp/1932391770/ref=sr_1_41?s=books&ie=UTF8&qid=1522385156&sr=1-41"
    },
    {
        "product_name": "The Phenomenon: Pressure, the Yips, and the Pitch that Changed My Life",
        "description": " A NEW YORK TIMES BESTSELLER  Rick Ankiel had the talent to be one of the best pitchers ever. Then, one day, he lost it.  The Phenomenon is the story of how St. Louis Cardinals prodigy Rick Ankiel lost his once-in-a-generation ability to pitch--not due to an injury or a bolt of lightning, but a mysterious anxiety condition widely known as \"the Yips.\" It came without warning, in the middle of a playoff game, with millions of people watching. And it has never gone away.  Yet the true test of Ankiel's character came not on the mound, but in the long days and nights that followed as he searched for a way to get back in the game. For four and a half years, he fought the Yips with every arrow in his quiver: psychotherapy, medication, deep-breathing exercises, self-help books, and, eventually, vodka. And then, after reconsidering his whole life at the age of twenty-five, Ankiel made an amazing turnaround: returning to the Major Leagues as a hitter and playing seven successful seasons.  This book is an incredible story about a universal experience--pressure--and what happened when a person on the brink had to make a choice about who he was going to be.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Phenomenon-Pressure-Yips-Pitch-Changed/dp/1610396863/ref=sr_1_42?s=books&ie=UTF8&qid=1522385156&sr=1-42"
    },
    {
        "product_name": "Heads-Up Baseball : Playing the Game One Pitch at a Time",
        "description": "\"This book provides practical strategies for developing the mental skills which help speed you to your full potential.\"---Dave Winfield What does it mean to play heads-up baseball? A heads-up player has confidence in his ability, keeps control in pressure situations, and focuses on one pitch at a time. His mental skills enable him to play consistently at or near his best despite the adversity baseball presents each day.   \"My ability to fully focus on what I had to do on a daily basis was what made me the successful player I was. Sure I had some natural ability, but that only gets you so far. I think I learned how to focus; it wasn't something that I was necessarily born with.\" -- Hank Aaron \"Developing and refining my mental game has played a critical role in my success in baseball. For years players have had to develop these skills on their own. This book provides practical strategies for developing the mental skills that will help speed you toward your full potential.\" -- Dave Winfield",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/Heads-Up-Baseball-Playing-Game-Pitch/dp/1570280215/ref=sr_1_43?s=books&ie=UTF8&qid=1522385156&sr=1-43"
    },
    {
        "product_name": "Why Baseball Matters (Why X Matters Series)",
        "description": "A best-selling author and passionate baseball fan takes a tough-minded look at America’s most traditional game in our twenty-first-century culture of digital distraction Baseball, first dubbed the “national pastime” in print in 1856, is the country’s most tradition-bound sport. Despite remaining popular and profitable into the twenty-first century, the game is losing young fans, among African Americans and women as well as white men. Furthermore, baseball’s greatest charm—a clockless suspension of time—is also its greatest liability in a culture of digital distraction. These paradoxes are explored by the historian and passionate baseball fan Susan Jacoby in a book that is both a love letter to the game and a tough-minded analysis of the current challenges to its special position—in reality and myth—in American culture. The concise but wide-ranging analysis moves from the Civil War—when many soldiers played ball in northern and southern prisoner-of-war camps—to interviews with top baseball officials and young men who prefer playing online “fantasy baseball” to attending real games. Revisiting her youthful days of watching televised baseball in her grandfather’s bar, the author links her love of the game with the informal education she received in everything from baseball’s history of racial segregation to pitch location. Jacoby argues forcefully that the major challenge to baseball today is a shortened attention span at odds with a long game in which great hitters fail two out of three times. Without sanitizing this basic problem, Why Baseball Matters remind us that the game has retained its grip on our hearts precisely because it has repeatedly demonstrated the ability to reinvent itself in times of immense social change.",
        "ratings": "3.0 out of 5 stars",
        "url": "https://www.amazon.com/Why-Baseball-Matters/dp/0300224273/ref=sr_1_44?s=books&ie=UTF8&qid=1522385156&sr=1-44"
    },
    {
        "product_name": "The Fantasy Sports Boss 2018 NFL Draft Guide: Over 500 Players Analyzed and Ranked",
        "description": "For the ninth straight year, our staff here at The Fantasy Sports Boss have pored over thousands of hours of film on hundreds of prospects from big-name programs like Alabama and Clemson; to those well off the radar such as Utah State and Stony Brook. The goal of such a massive effort remains the same and that is to bring our readers the most comprehensive NFL Draft guide there is. This year's guide has over 500 players analyzed and ranked, while also including: -Our annual Mock Draft -A look at the Penn State running back curse and how it impacts Saquon Barkley. -Ten Burning Questions surrounding the draft. -Team-by-Team Needs and much, much more. So when it comes to the draft, we leave no stone unturned. $19.99",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Fantasy-Sports-Boss-Draft-Guide/dp/1983925713/ref=sr_1_45?s=books&ie=UTF8&qid=1522385156&sr=1-45"
    },
    {
        "product_name": "Papi: My Story",
        "description": "An entertaining, unfiltered memoir by one of the game’s greatest, most clutch sluggers and beloved personalities David&nbsp;“Big Papi” Ortiz&nbsp;is a baseball icon and one of the most popular figures ever to play the game.&nbsp; As a key part of the Boston Red Sox for 14 years, David has helped the team win 3 World Series, bringing back a storied franchise from “never wins” to “always wins.” He helped them upend the doubts, the naysayers, the nonbelievers and captured the imagination of millions of fans along the way, as he launched balls into the stands again, and again, and again.&nbsp; He made Boston and the Red Sox his home, his place of work, and his legacy. As he put it: This is our f*&amp;#ing city.&nbsp; Now, looking back&nbsp;at the end of his legendary career, Ortiz opens up fully for the first time about his last two decades in the game. Unhindered by political correctness, Ortiz talks colorfully about his journey, from his poor upbringing in the Dominican Republic to when the expansion Florida Marlins passed up a chance to sign him due to what was essentially tennis elbow. He recalls his days in Peoria, Arizona, his first time in the United States;&nbsp;tense exchanges with Twins manager Tom Kelly in Minnesota; and his arrival in Boston. Readers go behind the scenes for the many milestones of his Red Sox career— from the huge disappointment of the Red Sox losing to the Yankees in 2003, ending the curse in 2004 with the infamous “band of idiots,\" including his extraordinary clutch hitting to overcome a 3-0 series deficit against the Yankees, to earning a second title in 2007 and a third in 2013.&nbsp; Along the way, he was tainted by the infamous banned substances list in 2009; he used his passion and place to fortify a city devastated by the Boston Marathon bombings; and he dominated pitchers right up through his retirement season at age 40.&nbsp; Papi, as he became so affectionately called, gave his fans big hits when they needed them most. He was an even bigger presence:&nbsp; He was a champion who rallied a team, a city, and a sport in a way that no one will ever forget.&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In Papi, his ultimate memoir, Ortiz opens up as never before about his life in baseball and about the problems he sees in Major League Baseball, about former teammates, opponents, coaches, and executives, and about the weight of expectation whenever he stepped up to the plate.&nbsp;The result is a revelatory, fly-on-the wall story of a career by a player with a lot to say at the end of his time in the game, a game to which he gave so much and which gave so much to him.",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Papi-My-Story-David-Ortiz/dp/0544814614/ref=sr_1_46?s=books&ie=UTF8&qid=1522385156&sr=1-46"
    },
    {
        "product_name": "PiratesGuide 2018: A complete field guide to the 2018 Pittsburgh Pirates",
        "description": "The Pittsburgh Pirates face an uncertain future. After trading away the face of their franchise, the Pirates must now plot a course for 2018 and beyond to remain competitive in today's Major League Baseball. PIRATESGUIDE 2018 is the perfect companion for Pirates fans in Pittsburgh and beyond. This tome contains more than 20+ essays from respected baseball minds as well as complete statistics and projections for every player on the club's 40-man roster. it's the perfect compilations for those that are curious to see how the club will fare in this next chapter. With this book, Pittsburgh Pirates fans can intelligently and passionately discuss their favorite team armed with a wealth of knowledge and insight.",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/PiratesGuide-2018-complete-Pittsburgh-Pirates/dp/1980450641/ref=sr_1_47?s=books&ie=UTF8&qid=1522385156&sr=1-47"
    },
    {
        "product_name": "The Mental Keys to Hitting: A Handbook of Strategies for Performance Enhancement",
        "description": "A must-have book by acclaimed author and expert H.A. Dorfman that highlights the crucial mental components involved in hitting a baseball and playing the game, components that are as important, if not more so, than the intense physical regimen of an athlete.\"...helpful to hitters in little leagues or in the big leagues. The information is clear and to the point...\" -- Charles Johnson, former catcher, Florida Marlins",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/Mental-Keys-Hitting-Performance-Enhancement/dp/1630761869/ref=sr_1_48?s=books&ie=UTF8&qid=1522385156&sr=1-48"
    },
    {
        "product_name": "I Never Had It Made: An Autobiography of Jackie Robinson",
        "description": "Before Barry Bonds, before Reggie Jackson, before Hank Aaron, baseball's stars had one undeniable trait in common: they were all white. In 1947, Jackie Robinson broke that barrier, striking a crucial blow for racial equality and changing the world of sports forever. I Never Had It Made is Robinson's own candid, hard-hitting account of what it took to become the first black man in history to play in the major leagues. I Never Had It Made recalls Robinson's early years and influences: his time at UCLA, where he became the school's first four-letter athlete; his army stint during World War II, when he challenged Jim Crow laws and narrowly escaped court martial; his years of frustration, on and off the field, with the Negro Leagues; and finally that fateful day when Branch Rickey of the Brooklyn Dodgers proposed what became known as the \"Noble Experiment\" -- Robinson would step up to bat to integrate and revolutionize baseball. More than a baseball story, I Never Had It Made also reveals the highs and lows of Robinson's life after baseball. He recounts his political aspirations and civil rights activism; his friendships with Martin Luther King, Jr., Malcolm X, William Buckley, Jr., and Nelson Rockefeller; and his troubled relationship with his son, Jackie, Jr. Originally published the year Robinson died, I Never Had It Made endures as an inspiring story of a man whose heroism extended well beyond the playing field.",
        "ratings": "4.3 out of 5 stars",
        "url": "https://www.amazon.com/Never-Had-Made-Autobiography-Robinson/dp/0060555971/ref=sr_1_49?s=books&ie=UTF8&qid=1522385158&sr=1-49"
    },
    {
        "product_name": "Alou: My Baseball Journey",
        "description": "Growing up in a tiny shack in the Dominican Republic, Felipe Alou never dreamed he would be the first man to go from his country to play and manage in Major League Baseball and also the first to play in the World Series. Today, the Dominican Republic produces more Major League players than any country outside the United States. In this extraordinary autobiography, Alou tells of his real dream: to become a doctor. An uncle was funding his university education when an improbable turn of events intervened at the 1955 Pan American Games. There as a track and field athlete, Alou was pressed into service on the baseball field to replace a player sent home for disciplinary reasons. A scout noticed Alou and offered him two hundred pesos to sign a pro contract. Knowing his father owed the grocer exactly two hundred pesos, Alou signed. Battling racism in the United States and political turmoil in his home country, Alou persevered, paving the way for younger brothers Matty and Jesús and scores of other Dominicans, including his son Moisés. A fourth Alou brother, Juan, might have joined the historic trio if not for the improbable direction his own life took. Alou played seventeen years in the Major Leagues, accumulating more than two thousand hits and two hundred home runs, and then managed another fourteen four with the San Francisco Giants and ten with the Montreal Expos, where he became the winningest manager in franchise history. Alou became a special friend of Roberto Clemente, roomed with Willie McCovey, Orlando Cepeda, Juan Marichal, and Joe Torre, and suffered the tragic death of his firstborn son. Alou s pioneering journey is embedded in the history of baseball, the Dominican Republic, and a remarkable family.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Alou-My-Baseball-Journey-Felipe/dp/1496201523/ref=sr_1_50?s=books&ie=UTF8&qid=1522385158&sr=1-50"
    },
    {
        "product_name": "Baseball Prospectus Diamond Insights 2018",
        "description": "DIAMOND INSIGHTS 2018 FEATURES: * Original graphics and statistics illuminating the performance of more than 300 players. * Early fantasy values in every player profile, and expert fantasy commentary on most of them. * Thought-provoking essays from today’s top writers on a variety of relevant topics. * Answers to important questions such as: What is pitch tunneling, and why does it matter? How likely were the Dodgers’ and Indians’ 2017 late-season streaks? How can teams improve player development?",
        "ratings": "2.0 out of 5 stars",
        "url": "https://www.amazon.com/Baseball-Prospectus-Diamond-Insights-2018/dp/1979885370/ref=sr_1_51?s=books&ie=UTF8&qid=1522385158&sr=1-51"
    },
    {
        "product_name": "Sports Illustrated Baseball's Greatest",
        "description": "Who's the greatest slugger of all time, Babe Ruth or Ted Williams? Where do Derek Jeter and Cal Ripken Jr. rank on the list of the best shortstops? At third base, would you rather have Mike Schmidt or Brooks Robinson? Is Fenway or Wrigley the better ballpark?This book will end many arguments-and start some new ones. Sports Illustrated's has polled its Major League Baseball experts to determine the ultimate Top 10 in more than 20 categories. The rankings appear alongside stunning photography and classic stories from SI's archives. This is the best of the best in the major leagues, or, more simply, Baseball's Greatest.",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/Sports-Illustrated-Baseballs-Greatest-Editors/dp/1618930559/ref=sr_1_52?s=books&ie=UTF8&qid=1522385158&sr=1-52"
    },
    {
        "product_name": "St. Louis Browns: The Story of a Beloved Team",
        "description": "At the core of the St. Louis Browns' story is the ever-present competition on and off the baseball field with the St. Louis Cardinals a team with whom they not only shared a city and fans, but also a stadium. It was a battle for more than pennants. It was a battle for survival and baseball loyalty. Could they run the Cardinals out of town and become St. Louis's sole baseball team? There were the good times when the Browns fielded some of the greatest players in major league history, regularly challenging the mighty Yankees for the American League Pennant in the 1920s. But there were also bad times. The team s lack of success was often impacted by poor financing, bad business decisions, and the need to trade good players to stay afloat. The Browns' story was always a story of what could have been. Filled with unique and colorful stories and illustrated by exquisite photographs, St. Louis Browns: The Story of a Beloved Team is destined to become the definitive source for the team's splendid history: the good, the bad, and the ugly.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/St-Louis-Browns-Story-Beloved/dp/1681061171/ref=sr_1_53?s=books&ie=UTF8&qid=1522385158&sr=1-53"
    },
    {
        "product_name": "Tom Yawkey: Patriarch of the Boston Red Sox",
        "description": "Few people have influenced a team as much as did Tom Yawkey (1903–76) as owner of the Boston Red Sox. After purchasing the Red Sox for $1.2 million in 1932,&nbsp;Yawkey poured millions into building a better team and making the franchise relevant again. Although the Red Sox never won a World Series under Yawkey’s ownership, there were still many highlights. Lefty Grove won his three hundredth game; Jimmie Foxx hit fifty home runs; Ted Williams batted .406 in 1941, and both Williams and Carl Yastrzemski won Triple Crowns.&nbsp;Yawkey was viewed by fans as a genial autocrat who ran his ball club like a hobby more than a business&nbsp;and who spoiled his players. He was perhaps too trusting, relying on flawed cronies rather than the most competent executives to run his ballclub. One of his more unfortunate legacies was the accusation that he was a racist, since the Red Sox were the last Major League team to integrate, and his inaction in this regard haunted both him and the team for decades. As one of the last great patriarchal owners in baseball, he was the first person elected to the Baseball Hall of Fame who hadn’t been a player, manager, or general manager. Bill Nowlin&nbsp;takes a close look at Yawkey’s life as a sportsman and as one of the leading philanthropists in New England and South Carolina. He also addresses Yawkey’s leadership style and issues of racism during his tenure with the Red Sox.&nbsp; &nbsp;",
        "ratings": "4.8 out of 5 stars",
        "url": "https://www.amazon.com/Tom-Yawkey-Patriarch-Boston-Red/dp/0803296835/ref=sr_1_54?s=books&ie=UTF8&qid=1522385158&sr=1-54"
    },
    {
        "product_name": "Watching Baseball Smarter: A Professional Fan's Guide for Beginners, Semi-experts, and Deeply Serious Geeks",
        "description": "This smart and funny fan’s guide to baseball explains the ins and outs of pitching, hitting, running, and fielding, while offering insider trivia and anecdotes that will appeal to anyone—whether you're a major league couch potato, life-long season ticket-holder, or a beginner.&nbsp;What is the difference between a slider and a curveball?At which stadium did “The Wave” first make an appearance?How do some hitters use iPods to improve their skills?Which positions are never played by lefties?Why do some players urinate on their hands?&nbsp;Combining the narrative voice and attitude of Michael Lewis with the compulsive brilliance of Schott’s Miscellany, Watching Baseball Smarter will increase your understanding and enjoyment of the sport–no matter what your level of expertise.Features an glossary of baseball slang, an appendix of important baseball stats, and an appendix of uniform numbers.",
        "ratings": "4.3 out of 5 stars",
        "url": "https://www.amazon.com/Watching-Baseball-Smarter-Professional-Semi-experts/dp/0307280322/ref=sr_1_55?s=books&ie=UTF8&qid=1522385158&sr=1-55"
    },
    {
        "product_name": "Nolan Ryan's Pitcher's Bible: The Ultimate Guide to Power, Precision, and Long-Term Performance",
        "description": "How does Nolan Ryan still do it?At forty-three years old, Nolan Ryan is a marvel. He is still blowing his fastballs by hitters at an age when most pitchers have long since retired—or have learned to depend on guile instead of power. But the Ryan express keeps chugging on, getting more unhittable, not less. Nolan Ryan's Pitcher's Bible tells us the secrets of Ryan's success. Drawing on Ryan's practical experience and Tom House's research expertise, it shows how the right combination of exercise and motivation can help a pitcher develop to his greatest potential. Nolan Ryan's Pitcher's Bible includes: -Nolan Ryan's complete fitness program for pitchers—including weight training, aerobic exercise, and diet—based on the latest scientific research and his twenty-four years of experience as a major leaguer. -The most up-to-date methods for preventing arm injuries by establishing proper mechanics, a conditioning base, and throwing work loads. -A timetable for keeping a pitcher in top shape year-round, including specific exercise intervals to meet the individual strength demands of each pitcher's throwing motion, maximum velocity, and maximum weekly number of pitches. -An in-depth presentation of Ryan's pitching strategy—how he prepares himself mentally for a game, an analysis of his pitch selection for different types of hitters, and how he applies his training regimen to improving his effectiveness on the mound. Illustrated with black-and-white photos of Ryan in action, along with photos and line drawings of the recommended exercises, Nolan Ryan's Pitcher's Bible is the ultimate book on pitching, by the ultimate pitcher.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Nolan-Ryans-Pitchers-Bible-Performance/dp/0671705814/ref=sr_1_56?s=books&ie=UTF8&qid=1522385158&sr=1-56"
    },
    {
        "product_name": "Catapult Loading System: How To Teach 100-Pound Hitters To Consistently Drive The Ball 300-Feet",
        "description": "\"My son at 10yo (90-lbs) is highly coach-able. I taught him the system in February and he hit well during the season but could only hit the ball around 180'. Then all of a sudden around June he started killing the ball. He was hitting home runs every game and hit a ball at least 250-feet\" - Michael Parillo (via email) Sick of struggling to help hitters drive the ball hard with more consistency? Dramatically increase power without sacrificing swing quality. Literally thousands of coaches across the nation are getting predictably positive results with hitters using the CLS system. How? By applying human movement principles validated by REAL science to hitting a ball, and NOT \"bro-science\". THIS STEP-BY-STEP GUIDE TO CONSISTENT POWER TEACHES:  How to master a handful of human movement principles, so you can slice the \"teach hitting\" learning curve in half. How to effectively load the body, so your hitters can optimize their batted ball distance potential. How elite-hitters are revealing ways to hit balls with High-Exit-Speeds, swing after swing, using three elements a 4-year-old can understand. Why 'loading and exploding the hips' is bad for lower back, and how to teach hitters a highly effective but SAFE swing.  THE NEW EXPANDED EDITION INCLUDES:  'How to practice' section at end of each movement principle Chapter. How to train a 2-year-old to hit a moving ball (proof that NOT only elite hitters can be taught these movements). Why pitchers are taught to pitch around ineffective swing paths, and how to turn their weapon against them. Why coaches MUST focus their hitters' efforts on targeting and elevating pitches low in the zone. How to teach timing and get hitters on-time more often in games. ",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Catapult-Loading-System-100-Pound-Consistently/dp/1985570726/ref=sr_1_57?s=books&ie=UTF8&qid=1522385158&sr=1-57"
    },
    {
        "product_name": "Aaron Judge: The Incredible Story of the New York Yankees' Home Run–Hitting Phenom",
        "description": "At 6-foot-7 and 285 pounds, Aaron Judge emerged as the biggest story in baseball in 2017 with his monstrous home runs and record-breaking ability. A three-sport athlete in high school and a Division I ballplayer at Fresno State, the Californian was drafted by the New York Yankees in the first round in 2013 and made it to the majors by August 2016. Homering in his first major league at-bat and starting in right field straight out of spring training in 2017, he gave Yankees fans hope for the future, along with \"Baby Bombers\" teammates such as Gary Sanchez.After a rough start in which he batted below .200 and struck out in over 40 percent of his plate appearances after joining the Yankees, Judge turned things around and helped get his team off to a fast start in 2017 with 10 homers in April alone, tying the rookie record for the month. He then broke the legendary Joe DiMaggio’s team record for most round trippers by the All-Star break with 30, including one that measured at 495 feet. His mounting popularity enabled him to receive more All-Star votes than any American League player and to the creation of the \"Judge's Chambers\" section located in the right-field stands of Yankee Stadium. Judge's momentum next led to him winning the 2017 Home Run Derby where he smashed a total of 47, four of which traveled more than 500 feet. It's no wonder that baseball commissioner Rob Manfred has said that Judge is a player \"who can become the face of the game.\" In Aaron Judge: The Incredible Story of the New York Yankees' Home Run-Hitting Phenom, David Fischer brings the exciting story of the Yankees' newest superstar to life.",
        "ratings": "3.9 out of 5 stars",
        "url": "https://www.amazon.com/Aaron-Judge-Incredible-Yankees-Run-Hitting/dp/1683582365/ref=sr_1_58?s=books&ie=UTF8&qid=1522385158&sr=1-58"
    },
    {
        "product_name": "The Big 50: Cincinnati Reds: The Men and Moments that Made the Cincinnati Reds",
        "description": "The Big 50: Cincinnati Reds is an amazing, full-color look at the 50 men and moments that made the Reds the Reds. Experienced sportswriters Chad Dotson and Chris Garber recount the living history of the Reds, counting down from No. 50 to No. 1. Big 50: Reds brilliantly brings to life the Reds remarkable story, from Johnny Bench and Barry Larkin to the roller coaster that was Pete Rose to the team’s 1990 World Series championship and Todd Frazier’s 2015 Home Run Derby win.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Big-50-Cincinnati-Reds-Moments/dp/1629375411/ref=sr_1_59?s=books&ie=UTF8&qid=1522385158&sr=1-59"
    },
    {
        "product_name": "2018 Minor League Baseball Analyst",
        "description": "The first book of its kind to fully integrate sabermetrics and scouting, the 2018 Minor League Baseball Analyst provides a distinctive brand of analysis for more than 1,000 minor league baseball players. Features include scouting reports for all players, batter skills ratings, pitch repertoires, performance trends, major league equivalents, and expected major league debuts. A complete sabermetric glossary is also included. This one-of-a-kind reference is ideally suited for baseball analysts and those who play in fantasy leagues with farm systems.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/2018-Minor-League-Baseball-Analyst/dp/1629374822/ref=sr_1_60?s=books&ie=UTF8&qid=1522385158&sr=1-60"
    },
    {
        "product_name": "The Big 50: Cincinnati Reds: The Men and Moments that Made the Cincinnati Reds",
        "description": "The Big 50: Cincinnati Reds is an amazing, full-color look at the 50 men and moments that made the Reds the Reds. Experienced sportswriters Chad Dotson and Chris Garber recount the living history of the Reds, counting down from No. 50 to No. 1. Big 50: Reds brilliantly brings to life the Reds remarkable story, from Johnny Bench and Barry Larkin to the roller coaster that was Pete Rose to the team’s 1990 World Series championship and Todd Frazier’s 2015 Home Run Derby win.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Big-50-Cincinnati-Reds-Moments/dp/1629375411/ref=sr_1_61?s=books&ie=UTF8&qid=1522385161&sr=1-61"
    },
    {
        "product_name": "2018 Minor League Baseball Analyst",
        "description": "The first book of its kind to fully integrate sabermetrics and scouting, the 2018 Minor League Baseball Analyst provides a distinctive brand of analysis for more than 1,000 minor league baseball players. Features include scouting reports for all players, batter skills ratings, pitch repertoires, performance trends, major league equivalents, and expected major league debuts. A complete sabermetric glossary is also included. This one-of-a-kind reference is ideally suited for baseball analysts and those who play in fantasy leagues with farm systems.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/2018-Minor-League-Baseball-Analyst/dp/1629374822/ref=sr_1_62?s=books&ie=UTF8&qid=1522385161&sr=1-62"
    },
    {
        "product_name": "Playing with Purpose: Baseball Devotions",
        "description": "If you enjoy America's pastime, you'll love&nbsp;Playing with Purpose: Baseball Devotions--180 Spiritual Truths Drawn from the Great Game of Baseball. This devotional provides a reading a day for an entire season (or off-season!) highlighting intriguing players, both famous and less well known; important games throughout major league history; teams both current and forgotten, and much more, drawing a Bible-based point from each. From Cy Young to Albert Pujols, from the Brooklyn Bridegrooms to the 2016 World Series champion Chicago Cubs, this book features hundreds of players, dozens of teams, and scores of Scriptures . . . and it's completely indexed. Thought-provoking but never preachy,&nbsp;Playing with Purpose: Baseball Devotions&nbsp;is perfect for fans of all ages.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Playing-Purpose-Devotions-Paul-Kent/dp/097939113X/ref=sr_1_63?s=books&ie=UTF8&qid=1522385161&sr=1-63"
    },
    {
        "product_name": "Red Sox Triviology: Fascinating Facts from the Bleacher Seats",
        "description": "Interspersing exciting history and fun quizzes, this trivia book ranges from basic questions to challenges that will teach even the most die-hard fans a thing or two about Red Sox baseball. The facts presented are grouped into categories that include positions, the early years, and championship teams. Entertaining and educational, the book is ideal for both solitary instruction and group game play.",
        "ratings": "4.3 out of 5 stars",
        "url": "https://www.amazon.com/Red-Sox-Triviology-Fascinating-Bleacher/dp/1629372374/ref=sr_1_64?s=books&ie=UTF8&qid=1522385161&sr=1-64"
    },
    {
        "product_name": "The Arm: Inside the Billion-Dollar Mystery of the Most Valuable Commodity in Sports",
        "description": "Yahoo’s lead baseball columnist offers an in-depth look at the most valuable commodity in sports—the pitching arm—and how its vulnerability to injury is hurting players and the game, from Little League to the majors.Every year, Major League Baseball spends more than $1.5 billion on pitchers—five times more than the salary of every NFL quarterback combined. Pitchers are the game’s lifeblood. Their import is exceeded only by their fragility. One tiny band of tissue in the elbow, the ulnar collateral ligament, is snapping at unprecedented rates, leaving current big league players vulnerable and the coming generation of baseball-playing children dreading the three scariest words in the sport: Tommy John surgery.Jeff Passan traveled the world for three years to explore in-depth the past, present, and future of the arm, and how its evolution left baseball struggling to wrangle its Tommy John surgery epidemic. He examined what compelled the Chicago Cubs to spend $155 million on one arm. He snagged a rare interview with Sandy Koufax, whose career was cut short by injury at thirty, and visited Japan to understand how another baseball-mad country treats its prized arms. And he followed two major league pitchers, Daniel Hudson and Todd Coffey, throughout their returns from Tommy John surgery. He exposes how the baseball establishment long ignored the rise in arm injuries and reveals how misplaced incentives across the sport stifle potential changes.Injuries to the UCL start as early as Little League. Without a drastic cultural shift, baseball will continue to lose hundreds of millions of dollars annually to damaged pitchers, and another generation of children will suffer the same problems that vex current players. Informative and hard-hitting, The Arm is essential reading for everyone who loves the game, wants to keep their children healthy, or relishes a look into how a large, complex institution can fail so spectacularly.",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/Arm-Billion-Dollar-Mystery-Valuable-Commodity/dp/0062400371/ref=sr_1_65?s=books&ie=UTF8&qid=1522385161&sr=1-65"
    },
    {
        "product_name": "Brothers in Arms: Koufax, Kershaw, and the Dodgers’ Extraordinary Pitching Tradition",
        "description": "The Los Angeles Dodgers are one of the most storied franchises in all of sports, with enduring legacies both on and off the diamond. Chief among the hallmarks of the organization is an unparalleled pitching dominance; Dodger blue and white brings to mind brilliance on the mound and the Cy Young Awards that followed. In Brothers in Arms: Koufax, Kershaw, and the Dodgers’ Extraordinary Pitching Tradition, acclaimed Dodgers writer Jon Weisman explores the organization's rich pitching history, from Koufax and Drysdale to Valenzuela and Hershiser, to the sublime Clayton Kershaw. Weisman delves deep into this lineage of excellence, interviewing both the legends that toed the rubber and the teammates, coaches, and personalities that witnessed their genius.&nbsp;",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Brothers-Arms-Extraordinary-Pitching-Tradition/dp/1629374679/ref=sr_1_66?s=books&ie=UTF8&qid=1522385161&sr=1-66"
    },
    {
        "product_name": "Where Nobody Knows Your Name: Life in the Minor Leagues of Baseball (Anchor Sports)",
        "description": "Minor league baseball is quintessentially American: small towns, small stadiums, $5 tickets, $2 hot dogs, the never-ending possibility of making it big. But looming above it all is always the real deal: Major League Baseball. John Feinstein takes the reader behind the curtain into the guarded world of the minor leagues, like no other writer can. Where Nobody Knows Your Name explores the trials and travails of the inhabitants of Triple-A, focusing on nine men, including players, managers and umpires, among many colorful characters, living on the cusp of the dream. The book tells the stories of former World Series hero Scott Podsednik, giving it one more shot; Durham Bulls manager Charlie Montoya, shepherding generations across the line; and designated hitter Jon Lindsey, a lifelong minor leaguer, waiting for his day to come. From Raleigh to Pawtucket, from Lehigh Valley to Indianapolis and beyond, this is an intimate and exciting look at life in the minor leagues, where you’re either waiting for the call or just passing through.",
        "ratings": "4.3 out of 5 stars",
        "url": "https://www.amazon.com/Where-Nobody-Knows-Your-Name/dp/0307949583/ref=sr_1_67?s=books&ie=UTF8&qid=1522385161&sr=1-67"
    },
    {
        "product_name": "The New York Yankees 1936–39: Lou Gehrig, Joe DiMaggio, and Baseball's Greatest Dynasty",
        "description": "The Story of the Greatest Yankees Team―and Baseball Team―of All TimeNew York, 1936. Red Ruffing, Lefty Gomez, Bill Dickey, Lou Gehrig, Tony Lazzeri, and rookie Joe DiMaggio―with these six future Hall of Fame players, the Yankees embarked on a four-year run that would go down in the history books as the greatest Yankees team, if not, the greatest baseball team of all time.Over the next four years, the Yankees won four straight pennants, finishing an average of nearly fifteen games ahead of the second-place team. They won their four World Series by an overall margin of 16-3, sweeping the last two, putting the punctuation mark on baseball’s first true dynasty. Even the Ruthian Yankees of the twenties never won more than two consecutive world championships. From 1936 to 1939, the world was changing rapidly. America was in the grip of the Great Depression. Franklin D. Roosevelt was re-elected president in the greatest landslide in American history. And Hitler’s Germany was on the move in the fall of 1939, just as the Yankee dynasty reached its climax. Against the backdrop of a world in turmoil, baseball, and America’s love for baseball, thrived.Starring the best team of all time, featuring little-known anecdotes of players and set against a history of the world, The New York Yankees 1936–39 tells the tale of a legendary team that changed history.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/New-York-Yankees-1936-39-Baseballs/dp/1510720634/ref=sr_1_68?s=books&ie=UTF8&qid=1522385161&sr=1-68"
    },
    {
        "product_name": "Mets Triviology: Fascinating Facts from the Bleacher Seats",
        "description": "Interspersing exciting history and fun quizzes, this trivia book ranges from basic questions to challenges that will teach even the most die-hard fans a thing or two about Mets baseball. The facts presented are grouped into categories that include positions, the early years, and championship teams. Entertaining and educational, the book is ideal for both solitary instruction and group game play.",
        "ratings": "4.8 out of 5 stars",
        "url": "https://www.amazon.com/Mets-Triviology-Fascinating-Facts-Bleacher/dp/1629372366/ref=sr_1_69?s=books&ie=UTF8&qid=1522385161&sr=1-69"
    },
    {
        "product_name": "Little Leagues Drills &amp; Strategies (Little League Baseball Guides)",
        "description": "Expert advice and innovative drills to propel your team to success Endorsed by Little League Baseball® and a favorite among coaches and parents, Little League Drills and Strategies is built around three easy-to-follow rules: (1) teach the basics, (2) keep it fun, and (3) practice, practice, practice. Following these simple yet successful tenets, author Ned McIntosh has packed this book with imaginative drills that you can use to help your players strengthen their baseball skills. These innovative exercises and minigames will keep practice fun for your players while they sharpen their abilities on the field. Accompanied by engaging instructional photographs, this authoritative resource features drills that will teach all of the fundamentals: Hitting Pitching Fielding Baserunning And more  McIntosh also pays special attention to the latest rule changes, including everything you need to know about pitch counts and how to use them to your team's advantage. Also included is a special troubleshooting section with strategies on how to correct players' technique.",
        "ratings": "4.4 out of 5 stars",
        "url": "https://www.amazon.com/Little-Leagues-Drills-Strategies-Baseball/dp/0071548017/ref=sr_1_70?s=books&ie=UTF8&qid=1522385161&sr=1-70"
    },
    {
        "product_name": "Who Owns the Ice House? Eight Life Lessons From an Unlikely Entrepreneur",
        "description": "In the late 1950s, Glen Allan, Mississippi, was a poor cotton community. For many, it was a time and place where opportunities were limited by social and legal constraints that were beyond their control. It was a time and place where few dared to dream. Based on his own life experience, Pulitzer nominee Clifton Taulbert has teamed up with entrepreneur thought leader Gary Schoeniger to create a powerful and compelling story that captures the essence of an entrepreneurial mindset and the unlimited opportunities it can provide. Drawing on the entrepreneurial life lessons Taulbert learned from his Uncle Cleve, Who Owns the Ice house? chronicles Taulbert’s journey from life in the Mississippi Delta at the height of legal segregation to being recognized by Time magazine as \"one of our nation’s most outstanding emerging entrepreneurs.\" Who Owns The Ice House? reaches into the past to remind us of the timeless and universal principles that can empower anyone to succeed.",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/House-Eight-Lessons-Unlikely-Entrepreneur/dp/0971305935/ref=sr_1_71?s=books&ie=UTF8&qid=1522385161&sr=1-71"
    },
    {
        "product_name": "Ultimate Baseball Road Trip: A Fan's Guide To Major League Stadiums",
        "description": "The&nbsp;most entertaining and comprehensive&nbsp;guide to every baseball fan’s dream road trip—including every new ballpark since the 2004 edition—revised and completely updated!",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Ultimate-Baseball-Road-Trip-Stadiums/dp/0762773405/ref=sr_1_72?s=books&ie=UTF8&qid=1522385161&sr=1-72"
    },
    {
        "product_name": "Ultimate Baseball Road Trip: A Fan's Guide To Major League Stadiums",
        "description": "The&nbsp;most entertaining and comprehensive&nbsp;guide to every baseball fan’s dream road trip—including every new ballpark since the 2004 edition—revised and completely updated!",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Ultimate-Baseball-Road-Trip-Stadiums/dp/0762773405/ref=sr_1_73?s=books&ie=UTF8&qid=1522385163&sr=1-73"
    },
    {
        "product_name": "The Chicago Tribune Book of the Chicago Cubs: A Decade-By-Decade History",
        "description": "The Chicago Tribune Book of the Chicago Cubs is a decade-by-decade look at one of baseball’s most beloved if hard-luck teams, starting with the franchise’s beginnings in 1876 as the Chicago White Stockings and ending with the triumphant 2016 World Series championship.For more than a century, the Chicago Tribune has documented every Cubs season through original reporting, photography, and box scores. For the first time, this mountain of Cubs history has been mined and curated by the paper’s sports department into a single one-of-a-kind volume. Each era in Cubs history includes its own timeline, profiles of key players and coaches, and feature stories that highlight it all, from the heavy hitters to the no-hitters to the one-hit wonders.And of course, you can’t talk about the Cubs without talking about Wrigley Field. In this book, readers will find a complete history of that most sacred of American stadiums, where Hack Wilson batted in 191 runs—still the major-league record—in 1930, where Sammy Sosa earned the moniker “Slammin’ Sammy,” and where fans congregated, even when the team was on the road, throughout its scintillating championship run.The award-winning journalists, photographers, and editors of the Chicago Tribune have produced a comprehensive collector’s item that every Cubs fan will love.",
        "ratings": "4.9 out of 5 stars",
        "url": "https://www.amazon.com/Chicago-Tribune-Book-Decade-Decade/dp/1572842172/ref=sr_1_74?s=books&ie=UTF8&qid=1522385163&sr=1-74"
    },
    {
        "product_name": "100 Things Astros Fans Should Know &amp; Do Before They Die (World Series Edition) (100 Things...Fans Should Know)",
        "description": "There's never been a better time to be an Astros fan, and this lively, detailed book explores the personalities, events, and facts every fan should know. Whether you're a die-hard booster from the days of the Colt .45’s or a new supporter of Jose Altuve and Carlos Correa, these are the 100 things all fans need to know and do in their lifetime. It contains every essential piece of Astros knowledge and trivia, as well as must-do activities, and ranks them all from 1 to 100, providing an entertaining and easy-to-follow checklist as you progress on your way to fan superstardom. This World Series edition has been updated to include the team's 2017 championship season as well as a new generation of stars, including Altuve, Correa, George Springer, Dallas Keuchel, Justin Verlander, and more.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Things-Astros-Should-Before-World/dp/1629375950/ref=sr_1_75?s=books&ie=UTF8&qid=1522385163&sr=1-75"
    },
    {
        "product_name": "If These Walls Could Talk: St. Louis Cardinals: Stories from the St. Louis Cardinals Dugout, Locker Room, and Press Box",
        "description": "The St. Louis Cardinals are one of baseball’s most storied franchises, and as much a part of St. Louis as Anheuser-Busch and the arch. From Lou Brock to Matt Carpenter, Ozzie Smith to Yadier Molina, Bob Gibson to Adam Wainwright, from Hall of Famers to rookie busts, the Cardinals are beloved in St. Louis. In this book, Stan McNeal provides a closer look at the great moments and the lowlights that have made the Cardinals one of the baseball’s keystone teams. Through the words of the players, via multiple interviews conducted with current and past Cardinals, readers will meet the players, coaches, and management and share in their moments of greatness and defeat. This book shares stories behind such Cardinal memories as the little-known clubhouse antics of backup catcher Bob Uecker during the teams’ memorable run in the 1960s, the excitement at Busch Stadium in the 1980s as the Cardinals reached the World Series three times, and the elation of the 2006 and 2011 World Series championships.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/These-Walls-Could-Talk-Cardinals/dp/1629370533/ref=sr_1_76?s=books&ie=UTF8&qid=1522385163&sr=1-76"
    },
    {
        "product_name": "Astros Strong: Houston's Historic 2017 Championship Season",
        "description": "During three consecutive 100-loss seasons, Houston Astros management asked fans to be patient, promising them there was a plan in place that would result in success. That patience was rewarded with the ultimate prize in 2017, as the Astros knocked off the Los Angeles Dodgers in thrilling fashion to claim the first World Series crown in team history. During the regular season they ran away with the American League West, winning the division by a massive 21 games. Anchored by a dynamic offense and boosted by the late-season acquisition of a resurgent Justin Verlander, this historic team would not be denied on their way to the long-awaited title.&nbsp; &nbsp; Packed with superb coverage and vivid color photography from the Houston Chronicle, Astros Strong: Houston's Historic 2017 Championship Season guides fans through the Astros' entire amazing journey – from the devastation of Hurricane Harvey and resiliency of the Houston community, to the Astros' quick work of the powerful Red Sox in the ALDS; from their hard-fought ALCS win over the young Yankees, all the way through their incredible World Series triumph over the dominant Dodgers. This commemorative edition also includes feature stories on Astros stars Jose Altuve, Carlos Correa, George Springer, and other fan favorites, and is a must-have keepsake for Astros fans of all generations.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Astros-Strong-Houstons-Historic-Championship/dp/1629374865/ref=sr_1_77?s=books&ie=UTF8&qid=1522385163&sr=1-77"
    },
    {
        "product_name": "America's Game: A History of Major League Baseball through World War II",
        "description": "This comprehensive survey of major league baseball looks at the national pastime’s legendary figures, major innovations, and pivotal moments, from the beginning of the twentieth century through World War II.In America's Game: A History of Major League Baseball through World War II, Bryan Soderholm-Difatte provides a comprehensive narrative of the major developments and key figures in Major League Baseball, during a time when the sport was still truly the national pastime. Soderholm-Difatte details pivotal moments—including the founding of the American League, the 1919 Black Sox scandal, and navigating the Great Depression and two World Wars—and concludes with a chapter examining the exclusion of black ballplayers from the major leagues. Central personalities covered in this book include baseball executives Judge Landis and Branch Rickey, managers John McGraw and Joe McCarthy, and iconic players such as Babe Ruth and Ty Cobb. America’s Game isn’t simply about celebrating the exploits of great players and teams; it is just as much about the history of Major League Baseball as an institution and the evolution of the game itself. With significant changes taking place in baseball in recent times, this book will remind baseball fans young and old of the rich history of the game.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Americas-Game-History-Baseball-through/dp/1538110628/ref=sr_1_78?s=books&ie=UTF8&qid=1522385163&sr=1-78"
    },
    {
        "product_name": "The Boys of Summer (Harperperennial Modern Classics)",
        "description": "This is a book about young men who learned to play baseball during the 1930s and 1940s, and then went on to play for one of the most exciting major-league ball clubs ever fielded, the team that broke the color barrier with Jackie Robinson. It is a book by and about a sportswriter who grew up near Ebbets Field, and who had the good fortune in the 1950s to cover the Dodgers for the Herald Tribune. This is a book about what happened to Jackie, Carl Erskine, Pee Wee Reese, and the others when their glory days were behind them. In short, it is a book about America, about fathers and sons, prejudice and courage, triumph and disaster, and told with warmth, humor, wit, candor, and love.",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Boys-Summer-Harperperennial-Modern-Classics/dp/0060883960/ref=sr_1_79?s=books&ie=UTF8&qid=1522385163&sr=1-79"
    },
    {
        "product_name": "Lost Ballparks",
        "description": "With vintage photographs, this book explores classic ballparks of American and National League teams that are no more, such as Boston's Grand Pavilion, home of the Beaneaters, and Huntington Avenue Grounds, one-time home of the Red Sox. Other cities include: Atlanta, Boston, Brooklyn, Chicago, Cincinnati, Cleveland, Dallas, Detroit, Houston, Kansas City, Los Angeles, Miami, Milwaukee, Minneapolis, Montreal, New York, Philadelphia, Pittsburgh, St. Louis, San Diego, Seattle, Tampa, Toronto, and Washington.",
        "ratings": "4.8 out of 5 stars",
        "url": "https://www.amazon.com/Lost-Ballparks-Dennis-Evanosky/dp/191121649X/ref=sr_1_80?s=books&ie=UTF8&qid=1522385163&sr=1-80"
    },
    {
        "product_name": "Eight Men Out: The Black Sox and the 1919 World Series",
        "description": "The headlines proclaimed the 1919 fix of the World Series and attempted cover-up as \"the most gigantic sporting swindle in the history of America!\" First published in 1963, Eight Men Out has become a timeless classic. Eliot Asinof has reconstructed the entire scene-by-scene story of the fantastic scandal in which eight Chicago White Sox players arranged with the nation's leading gamblers to throw the Series in Cincinnati. Mr. Asinof vividly describes the tense meetings, the hitches in the conniving, the actual plays in which the Series was thrown, the Grand Jury indictment, and the famous 1921 trial. Moving behind the scenes, he perceptively examines the motives and backgrounds of the players and the conditions that made the improbable fix all too possible. Here, too, is a graphic picture of the American underworld that managed the fix, the deeply shocked newspapermen who uncovered the story, and the war-exhausted nation that turned with relief and pride to the Series, only to be rocked by the scandal. Far more than a superbly told baseball story, this is a compelling slice of American history in the aftermath of World War I and at the cusp of the Roaring Twenties.",
        "ratings": "4.4 out of 5 stars",
        "url": "https://www.amazon.com/Eight-Men-Out-Black-World/dp/0805065377/ref=sr_1_81?s=books&ie=UTF8&qid=1522385163&sr=1-81"
    },
    {
        "product_name": "42 Faith: The Rest of the Jackie Robinson Story",
        "description": "New York Times BestsellerJackie Robinson, Branch Rickey, and the hidden hand of God that changed history&nbsp;Journalist and baseball lover Ed Henry reveals for the first time the backstory of faith that guided Jackie Robinson into not only the baseball record books but the annals of civil rights advancement as well. Through recently discovered sermons, interviews with Robinson’s family and friends, and even an unpublished book by the player himself, Henry details a side of Jackie’s humanity that few have taken the time to see.&nbsp;Branch Rickey, the famed owner who risked it all by signing Jackie to his first contract, is also shown as a complex individual who wanted nothing more than to make his God-fearing mother proud of him. Few know the level at which Rickey struggled with his decision, only moving forward after a private meeting with a minister he’d just met. It turns out Rickey was not as certain about signing Robinson as historians have always assumed.&nbsp;With many baseball stories to enthrall even the most ardent enthusiast, 42 Faith also digs deep into why Jackie was the man he was and what both drove him and challenged him after his retirement. From his early years before baseball, to his time with Rickey and the Dodgers, to his failing health in his final years, we see a man of faith that few have recognized.&nbsp;This book will add a whole new dimension to Robinson’s already awe-inspiring legacy. Yes, Jackie and Branch are both still heroes long after their deaths.&nbsp; Now, we learn more fully than ever before, there was an assist from God too.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/42-Faith-Jackie-Robinson-Story/dp/0718088808/ref=sr_1_82?s=books&ie=UTF8&qid=1522385163&sr=1-82"
    },
    {
        "product_name": "2018 Atlanta Baseball Preview: Presented by Walk Off Walk and Outfield Fly Rule",
        "description": "What do you actually know about the players on your favorite team? When you go to a game, what are you seeing? What should you look for? We've taken a look and gathered information on every player in the Atlanta Braves organization, from the low level prospects to the big league boys. We've put together stats and profiles for each one, and put it all in a book that's easy for you to carry with you to a game.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/2018-Atlanta-Baseball-Preview-Presented/dp/198647397X/ref=sr_1_83?s=books&ie=UTF8&qid=1522385163&sr=1-83"
    },
    {
        "product_name": "The Book: Playing The Percentages In Baseball",
        "description": "Written by three esteemed baseball statisticians, The Book continues where the legendary Bill James’s Baseball Abstracts and Palmer and Thorn’s The Hidden Game of Baseball left off more than twenty years ago. Continuing in the grand tradition of sabermetrics, the authors provide a revolutionary way to think about baseball with principles that can be applied at every level, from high school to the major leagues. Tom Tango, Mitchel Lichtman, and Andrew Dolphin cover topics such as batting and pitching matchups, platooning, the benefits and risks of intentional walks and sacrifices, the legitimacy of alleged “clutch” hitters, and many of baseball’s other theories on hitting, fielding, pitching, and even baserunning. They analyze when a strategy is a good idea and when it’s a bad idea, and how to more closely watch the “inside” game of baseball. Whenever you hear an announcer talk about the “unwritten rule” or say that so-and-so is going “by the book” in bringing in a situational substitute, The Book reviews the facts and determines what the real case is. If you want to know what the folks in baseball should be doing, find out in The Book.",
        "ratings": "4.3 out of 5 stars",
        "url": "https://www.amazon.com/Book-Playing-Percentages-Baseball/dp/1494260174/ref=sr_1_84?s=books&ie=UTF8&qid=1522385163&sr=1-84"
    },
    {
        "product_name": "I'm Keith Hernandez: A Memoir",
        "description": "Legendary first baseman Keith Hernandez tells all in this gripping and literary memoir.  Keith Hernandez revolutionized the role of first baseman. During his illustrious career with the World Series-winning St. Louis Cardinals and New York Mets, he was a perennial fan favorite, earning eleven consecutive Gold Gloves, a National League co-MVP Award, and a batting title. But it was his unique blend of intelligence, humor, and talent--not to mention his unflappable leadership, playful antics, and competitive temperament--that transcended the sport and propelled him to a level of renown that few other athletes have achieved, including his memorable appearances on the television show Seinfeld.       Now, with a striking mix of candor and self-reflection, Hernandez takes us along on his journey to baseball immortality. There are the hellacious bus rides and south-of-the-border escapades of his minor league years. His major league benchings, unending plate adjustments, and role in one of the most exciting batting races in history against Pete Rose. Indeed, from the Little League fields of Northern California to the dusty proving grounds of triple-A ball to the grand stages of Busch Stadium and beyond, I'm Keith Hernandez reveals as much about America's favorite pastime as it does about the man himself.       What emerges is an honest and compelling assessment of the game's past, present, and future--a memoir that showcases one of baseball's most unique and experienced minds at his very best. ",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Im-Keith-Hernandez-Memoir/dp/0316395730/ref=sr_1_85?s=books&ie=UTF8&qid=1522385166&sr=1-85"
    },
    {
        "product_name": "Baseball Field Guide: An In-Depth Illustrated Guide to the Complete Rules of Baseball",
        "description": "Now in its third edition—a clear guide to the complete rules of baseball!Admit it: Even if you’re a diehard fan of our national pastime, sometimes an umpire’s call can be a little baffling. And for newer fans, Major League Baseball’s nuanced rules—developed and revised over decades—can be downright perplexing. Now updated throughout with the latest changes, such as the “Buster Posey rule” on collisions at home plate, the Baseball Field Guide explains every rule in plain English:Rules that apply before, during, and after the gameEquipment specifications and field requirementsDuties of the coaches, managers, and umpiresRules for spectators (yes, they have rules, too!)The clearest explanation anywhere of the infamous Infield Fly Rule, and much more!Designed for quick and intuitive searches, this entertaining reference will help you understand every aspect of the game and add to your enjoyment of the sport.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Baseball-Field-Guide-Depth-Illustrated/dp/1615193286/ref=sr_1_86?s=books&ie=UTF8&qid=1522385166&sr=1-86"
    },
    {
        "product_name": "Winning Ugly: A Visual History of the Most Bizarre Baseball Uniforms Ever Worn",
        "description": "Baseball, our national pastime. All fans have great memories of their teams. We also remember those things that we wish we could forget: the errors, the mental mistakes . . . and the ugly uniforms.In an ode to those eyesores, Todd Radom has collected and chronicled some of the swing-and-misses we've seen on the baseball diamond. Remember when the Chicago White Sox thought wearing shorts in 1977 was a good idea? How about when the Baltimore Orioles wore their all-orange jerseys in 1971? Do you remember the 1999 \"Turn Ahead the Clock\" campaign? Or the most recent all-camo jerseys of the San Diego Padres?Yes, there is much to talk about when it comes to the odd uniform decisions teams have made over the years. But just like there's love out there for French bulldogs or Christmas sweaters, ugly uniforms hold a warm place in the heart of all baseball fans, and Winning Ugly is just that: an ode to our favorites from today and yesterday that bring smiles and sighs to all baseball fans.Sure they didn't affect wins and losses (unless you mention Chris Sale), but a fan's love and ire goes well beyond the current standings. So whether your team appears in Winning Ugly or not, fans of the sport will enjoy reliving the moments most teams would like to forget.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Winning-Ugly-History-Baseball-Uniforms/dp/1683582284/ref=sr_1_87?s=books&ie=UTF8&qid=1522385166&sr=1-87"
    },
    {
        "product_name": "The 2018 Prospect Digest Handbook",
        "description": "Hailed by Michael Salfino of the Wall Street Journal and Yahoo! Sports for its “insightful and often contrarian viewpoint to prospect rankings,” the Prospect Digest Handbook is a perennial favorite among baseball enthusiasts, minor league fans, and fantasy general managers. Now back for its fifth season, the Prospect Digest Handbook is the definitive guide to the minor leagues.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/2018-Prospect-Digest-Handbook/dp/069207371X/ref=sr_1_89?s=books&ie=UTF8&qid=1522385166&sr=1-89"
    },
    {
        "product_name": "Baseball For Dummies",
        "description": "Play, watch, and understand America's favorite pastime Baseball continues to be a popular game both as a spectator sport and as a pastime. Since the publication of Baseball For Dummies, 3rd Edition, baseball teams have changed, new MLB stadiums have been built, and rules have been updated. This updated 4th Edition brings you the latest information on the players, the places, and above all, the game. Baseball For Dummies is for baseball fans at all levels, from players and coaches to spectators who love the game. Baseball Hall of Fame player Joe Morgan explains baseball with remarkable insight, using down-to-earth language so everyone from the casual observer to the die-hard fan can gain a fuller appreciation of the sport.  Improve your hitting, pitching, and fielding Find a baseball team to play on, from Little League on up Evaluate stats, players, and records Coach baseball or umpire effectively Get more out of a trip to the ballpark The latest on baseball stats and sabermetrics  Complete with Morgan's personal lists of top-ten toughest pitchers, smartest players, and most strategic managers, Baseball For Dummies gives you all the inside tips, facts, and stats so you can have Major League fun!",
        "ratings": "4.4 out of 5 stars",
        "url": "https://www.amazon.com/Baseball-Dummies-Joe-Morgan/dp/1118510542/ref=sr_1_90?s=books&ie=UTF8&qid=1522385166&sr=1-90"
    },
    {
        "product_name": "2018 NFHS Baseball Rules Simplified &amp; Illustrated",
        "description": "2018 High School Baseball Rules Simplified &amp; Illustrated  The NFHS baseball rules are brought to life with Referee's exclusive PlayPic® and MechaniGram® illustrations. Simplified &amp; Illustrated will be a valuable asset to veteran and new umpires alike. There is no faster way to learn the rules, and no better tool for refreshing yourself before the season and before every game. A perfect complement to the rules book bringing clarity to complex situations. Most people are visual learners, so don't limit yourself to just words on paper. SEE the rules.  Baseball Rules Simplified &amp; Illustrated is ideal for all high school baseball umpires and includes:  Up-to-date rules for 2018 Challenging rules clearly defined Quick reference signal chart Over 150 illustrations throughout And much more!",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/2018-Baseball-Rules-Simplified-Illustrated/dp/1582083770/ref=sr_1_91?s=books&ie=UTF8&qid=1522385166&sr=1-91"
    },
    {
        "product_name": "Coaching Tee Ball : The Baffled Parent's Guide",
        "description": "Each spring, Tee-ball introduces millions of boys and girls to \"America's pastime\" --and introduces their parents to the joys (and nightmares) of coaching first-time players. Filled with expert advice and tips on creating order from chaos, Coaching Tee-Ball is the solution to every baffled parent's predicament, offering the new coach a total approach to keeping kids involved, motivated, and having fun.",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Coaching-Tee-Ball-Baffled-Parents/dp/0071387382/ref=sr_1_92?s=books&ie=UTF8&qid=1522385166&sr=1-92"
    },
    {
        "product_name": "Moments of Joy and Heartbreak: 66 Significant Episodes in the History of the Pittsburgh Pirates (The SABR Digital Library) (Volume 46)",
        "description": "The Pittsburgh Pirates have a long history, peppered with moments significant both to Pirates fans and Major League Baseball. While the Pirates are recognized as fielding the first all-black lineup in 1971, the 66 games in this book include one of the first matchups in the majors to involve two non-white opening hurlers (Native American and Cuban) in June 1921. We relive no-hitters, World Series-winning homers, and encounter the story of the last tripleheader ever played in major-league baseball. Some of the games are wins; some are losses. All of these essays provide readers with a sense of the totality of the Pirates’ experiences: the joy, the heartbreak, and other aspects of baseball (and life) in between. This book is the work of 37 members of the Society for American Baseball Research (SABR), including JEFF BARTO, JOHN BAUER, ROBERT E. BIONAZ , THOMAS J. BROWN JR., FREDERICK C. (RICK) BUSH, ALAN COHEN, PAUL E. DOUTRICH, DOUG FELDMANN, JEFF FINDLEY, T.S. FLYNN, GORDON J. GATTIE, TOM HAWTHORN, ROCK HOFFMAN, PAUL HOFMANN, MIKE HUBER, JORGE IBER, FRANK ITTNER, MATT KEELEAN, RUSS LAKE, BOB LEMOINE, LEN LEVIN, MARK MILLER, SETH MOLAND-KOVASH, BILL NOWLIN, RICHARD “PETE” PETERSON, STEPHEN PETERSON, RICHARD J. PUERZER, ELIZA RICHARDSON, C. PAUL ROGERS III, HARRY SCHOGER, BLAKE W. SHERRY, WAYNE STRUMPFER, JOSEPH WANCHO, BOB WEBSTER, STEVEN C. WEINER, GREGORY H. WOLF, JACK ZERBY. Contents:\u2028 MAY 10, 1882: First Major-League Game in Pittsburgh APRIL 22, 1891: Opening Day 1891 OCTOBER 4, 1892: Pirates Set Wins Record OCTOBER 13, 1903: First World Series SEPT 20, 1907: Maddox First Bucs No-Hitter JUNE 29, 1909: Farewell to the Old Yard JUNE 30, 1909: Forbes Field Opening Day JULY 3, 1910: Chief Hits for the Cycle AUGUST 22, 1912: “Wagner Wields Willow,” Hits for the Cycle OCTOBER 2, 1920: Only Major-League Tripleheader JUNE 30, 1921: “Chief” Yellow Horse Defeats Luque JUNE 20, 1925: Cuyler, Carey, and Co. Steamroll Brooklyn OCTOBER 15, 1925: Game 7 1925 World Series JUNE 24, 1933: Arky Vaughan Hits for the Cycle JUNE 19, 1934: Traynor as Pirates Manager APRIL 27, 1938: Vaughan Slams Cubs MAY 4, 1938: Lloyd Waner’s Big Game MAY 30, 1939: Rizzo’s Nine RBIs AUGUST 27, 1949: Tiny Bonham’s Last Game JUNE 25, 1950: Kiner Hits for the Cycle SEPT 23, 1951: Dickson’s 20th Win JUNE 6, 1952: Bucs Shave The Barber APRIL 13, 1954: Law Return from Military MAY 16, 1954: Rookie Roberts Collects 3 Hits SEPT 24, 1955: Friend Clinches ERA Title JULY 25, 1956: Clemente Grand Slams JULY 18, 1957: Arroyo’s Final Victory MAY 1, 1958: Frank Has A Big Day MAY 26, 1959: Haddix Pitches 12 Perfect Innings AUGUST 6, 1960: “We Had 'em All the Way” OCTOBER 13, 1960: Mazeroski’s Homer APRIL 15, 1961: Friend Bests Drysdale SEPT 21, 1963: Gene Baker: First African American Manager JULY 22, 1964: Mazeroski, Lynch, and Stargell Rout Cardinals JUNE 1, 1965: Veale’s 16 Strikeouts OCTOBER 2, 1966: Matty Alou Batting Title MAY 15, 1967: Clemente Blasts 3 Homers SEPT 20, 1969: A Trophy No-Hitter: Bob Moose JUNE 12, 1970: Dock Ellis No-Hitter JUNE 28, 1970: Human Locusts Day AUGUST 14, 1971:&nbsp;Gib No-Hitter AUGUST 23, 1971: Best Game for Al Oliver SEPT 1, 1971: First All-Black Lineup OCTOBER 17, 1971: World Series Game 7 SEPT 30, 1972: Clemente Collects Number 3,000 in Last At-Bat APRIL 6, 1973: No Clemente in Right JUNE 13, 1973: Blass Loses Control SEPT 16, 1975: Stennett Leads Rout SEPT 25, 1976: The Tragic Death of Bob Moose OCTOBER 3, 1976: Murtaugh’s Final Games OCTOBER 17, 1979: Pirates Win the Series MAY 19, 1981: Bibby’s Near No-Hitter SEPT 25, 1985:Reuschel Inspires Bucs OCTOBER 13, 1992: Pirates Back Wakefield in NLCS JULY 12, 1997: Cordova, Rincon, &amp; Smith Fireworks JULY 28, 2001: Pirates' Comeback JULY 2, 2010: Ohlendorf Wins JULY 26, 2011: A Really Bad Call SEPT 9, 2013: Pirates End the Streak OCTOBER 1, 2013: NL Wild Card Game JUNE 20, 2015: Scherzer No-Hitter OCTOBER 7, 2015: NL Wild Card Game APRIL 26, 2016: McCutchen 3 Home Runs",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Moments-Joy-Heartbreak-Significant-Pittsburgh/dp/1943816735/ref=sr_1_93?s=books&ie=UTF8&qid=1522385166&sr=1-93"
    },
    {
        "product_name": "The Pitcher and the Dictator: Satchel Paige's Unlikely Season in the Dominican Republic",
        "description": "Soon after Satchel Paige arrived at spring training in 1937 to pitch for the Pittsburgh Crawfords, he and five of his teammates, including Josh Gibson and Cool Papa Bell, were lured to the Dominican Republic with the promise of easy money to play a short baseball tournament in support of the country’s dictator, Rafael Trujillo. As it turned out, the money wasn’t so easy.&nbsp;After Paige and his friends arrived on the island, they found themselves under the thumb of Trujillo, known by Dominicans for murdering those who disappointed him. In the initial games, the Ciudad Trujillo all-star team floundered.&nbsp;Living outside the shadow of segregation, Satchel and his recruits spent their nights carousing and their days dropping close games to their rivals, who were also stocked with great players.&nbsp;Desperate to restore discipline, Trujillo tapped the leader of his death squads to become part of the team management. The American players believed they might be lined up and shot if they lost the tournament. When Paige’s team ultimately rallied to win, it barely registered with Trujillo, who a few months later ordered the killings of fifteen thousand Haitians at the border between Haiti and the Dominican Republic. Paige and his teammates returned to the states to face banishment from the Negro Leagues, but ironically they barnstormed across America wearing their Trujillo All-Stars uniforms.The Pitcher and the Dictator is an extraordinary story of race, politics, and some of the greatest baseball players ever assembled, playing high-stakes baseball in support of one of the Caribbean’s cruelest dictators. For more information about The Pitcher and the Dictator, visit thepitcherandthedictator.com.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Pitcher-Dictator-Unlikely-Dominican-Republic/dp/1496205499/ref=sr_1_94?s=books&ie=UTF8&qid=1522385166&sr=1-94"
    },
    {
        "product_name": "Wait Till Next Year - A Memoir",
        "description": "By the award-winning author of Team of Rivals and The Bully Pulpit, Wait Till Next Year is Doris Kearns Goodwin’s touching memoir of growing up in love with her family and baseball.Set in the suburbs of New York in the 1950s, Wait Till Next Year re-creates the postwar era, when the corner store was a place to share stories and neighborhoods were equally divided between Dodger, Giant, and Yankee fans.  We meet the people who most influenced Goodwin’s early life: her mother, who taught her the joy of books but whose debilitating illness left her housebound: and her father, who taught her the joy of baseball and to root for the Dodgers of Jackie Robinson, Roy Campanella, Pee Wee Reese, Duke Snider, and Gil Hodges. Most important, Goodwin describes with eloquence how the Dodgers’ leaving Brooklyn in 1957, and the death of her mother soon after, marked both the end of an era and, for her, the end of childhood.",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Wait-Till-Next-Year-Memoir/dp/0684847957/ref=sr_1_95?s=books&ie=UTF8&qid=1522385166&sr=1-95"
    },
    {
        "product_name": "Dynastic, Bombastic, Fantastic: Reggie, Rollie, Catfish, and Charlie Finley’s Swingin’ A’s",
        "description": "How the Oakland A's of the 1970s—a revolutionary band of brawling Hall of Famers—won three straight championships and knocked baseball into the modern age The Oakland A's of the early 1970s were the most transformative team in baseball history. Never before had an entire organization so collectively traumatized baseball's establishment with its outlandish behavior and business decisions, let alone an indisputably winning record: five consecutive division titles and three straight championships. The drama that played out on the field was exceeded only by the drama in the clubhouse and front office. But those A's, with their garish uniforms and outlandish facial hair, redefined the game for coming generations. Under the visionary leadership of owner Charles O. Finley, the team assembled such luminaries as Reggie Jackson, Catfish Hunter, Rollie Fingers, and Vida Blue. Finley acted as his own general manager, his insatiable need for control dictating everything from the playlist of the ballpark organist to the menu for the media lounge. So pervasive was his meddling that one of his managers, Dick Williams, quit in the middle of the championship celebration following Oakland's Game 7 victory over the Mets in the 1973 World Series. The advent of free agency spelled the end of Finley's reign; within two years, his dynasty was lost. A sprawling, brawling history of one of baseball’s unforgettable teams, Dynastic, Bombastic, Fantastic is a paean to a turbulent, magical time.",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Dynastic-Bombastic-Fantastic-Catfish-Charlie/dp/0544303172/ref=sr_1_96?s=books&ie=UTF8&qid=1522385166&sr=1-96"
    },
    {
        "product_name": "Amazing Tales from the Boston Red Sox Dugout: A Collection of the Greatest Red Sox Stories Ever Told",
        "description": " Recapture all the thrills of Red Sox baseball!  Calling all BoSox fans! In this one-of-a-kind compendium of anecdotes from players, managers, and beat writers, Jim Prime and Bill Nowlin capture all the magic and passion of Boston Red Sox baseball. Amazing Tales from the Boston Red Sox Dugout is a colorful journey through the history of the franchise. Included are the best memories and stories in the players’ and managers’ own words, as found in Prime and Nowlin’s Tales from the Boston Red Sox Dugout and More Tales from the Boston Red Sox Dugout. Within these pages, fans will chafe at the rivalries, cheer the wins, and challenge the losses both on the road and at home. From the earliest days of a promising young pitcher named Babe Ruth, through the glory years of Foxx, Williams, and Yastrzemiski, to the championship era of superstars such as Martinez and Ortiz, the Red Sox epitomize all that is grand about the grand old game. Featured players and managers include Wade Boggs, Joe Cronin, Bobby Doerr, Carlton Fisk, Dustin Pedrioa, Jim Rice, Jason Varitek, and many other Red Sox legends. This massive collection captures the story and glory of Red Sox baseball both on the field and off. Without a doubt, this tantalizing offering from Prime and Nowlin will provide hours of entertainment for Red Sox and baseball fans alike. ",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Amazing-Tales-Boston-Red-Dugout/dp/168358063X/ref=sr_1_97?s=books&ie=UTF8&qid=1522385168&sr=1-97"
    },
    {
        "product_name": "The Only Rule Is It Has to Work: Our Wild Experiment Building a New Kind of Baseball Team [Includes a New Afterword]",
        "description": "What would happen if two statistics-minded outsiders were allowed to run a professional baseball team?It’s the ultimate in fantasy baseball: You get to pick the roster, set the lineup, and decide on strategies -- with real players, in a real ballpark, in a real playoff race. That’s what baseball analysts Ben Lindbergh and Sam Miller got to do when an independent minor-league team in California, the Sonoma Stompers, offered them the chance to run its baseball operations according to the most advanced statistics. Their story in The Only Rule is it Has to Work is unlike any other baseball tale you've ever read.We tag along as Lindbergh and Miller apply their number-crunching insights to all aspects of assembling and running a team, following one cardinal rule for judging each innovation they try: it has to work. We meet colorful figures like general manager Theo Fightmaster and boundary-breakers like the first openly gay player in professional baseball. Even José Canseco makes a cameo appearance.Will their knowledge of numbers help Lindbergh and Miller bring the Stompers a championship, or will they fall on their faces? Will the team have a competitive advantage or is the sport’s folk wisdom true after all? Will the players attract the attention of big-league scouts, or are they on a fast track to oblivion?It’s a wild ride, by turns provocative and absurd, as Lindbergh and Miller tell a story that will speak to numbers geeks and traditionalists alike. And they prove that you don’t need a bat or a glove to make a genuine contribution to the game.",
        "ratings": "4.8 out of 5 stars",
        "url": "https://www.amazon.com/Only-Rule-Has-Work-Experiment/dp/1250130905/ref=sr_1_98?s=books&ie=UTF8&qid=1522385168&sr=1-98"
    },
    {
        "product_name": "Moneyball: The Art of Winning an Unfair Game",
        "description": "\"One of the best baseball―and management―books out.... Deserves a place in the Baseball Hall of Fame.\"―ForbesMoneyball is a quest for the secret of success in baseball. Following the low-budget Oakland Athletics, their larger-than-life general manger, Billy Beane, and the strange brotherhood of amateur baseball enthusiasts, Michael Lewis has written not only \"the single most influential baseball book ever\" (Rob Neyer, Slate) but also what \"may be the best book ever written on business\" (Weekly Standard).I wrote this book because I fell in love with a story. The story concerned a small group of undervalued professional baseball players and executives, many of whom had been rejected as unfit for the big leagues, who had turned themselves into one of the most successful franchises in Major League Baseball. But the idea for the book came well before I had good reason to write it―before I had a story to fall in love with. It began, really, with an innocent question: how did one of the poorest teams in baseball, the Oakland Athletics, win so many games? With these words Michael Lewis launches us into the funniest, smartest, and most contrarian book since, well, since Liar's Poker. Moneyball is a quest for something as elusive as the Holy Grail, something that money apparently can't buy: the secret of success in baseball. The logical places to look would be the front offices of major league teams, and the dugouts, perhaps even in the minds of the players themselves. Lewis mines all these possibilities―his intimate and original portraits of big league ballplayers are alone worth the price of admission―but the real jackpot is a cache of numbers―numbers!―collected over the years by a strange brotherhood of amateur baseball enthusiasts: software engineers, statisticians, Wall Street analysts, lawyers and physics professors. What these geek numbers show―no, prove―is that the traditional yardsticks of success for players and teams are fatally flawed. Even the box score misleads us by ignoring the crucial importance of the humble base-on-balls. This information has been around for years, and nobody inside Major League Baseball paid it any mind. And then came Billy Beane, General Manager of the Oakland Athletics. Billy paid attention to those numbers ―with the second lowest payroll in baseball at his disposal he had to―and this book records his astonishing experiment in finding and fielding a team that nobody else wanted. Moneyball is a roller coaster ride: before the 2002 season opens, Oakland must relinquish its three most prominent (and expensive) players, is written off by just about everyone, and then comes roaring back to challenge the American League record for consecutive wins. In a narrative full of fabulous characters and brilliant excursions into the unexpected, Michael Lewis shows us how and why the new baseball knowledge works. He also sets up a sly and hilarious morality tale: Big Money, like Goliath, is always supposed to win... how can we not cheer for David?",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Moneyball-Art-Winning-Unfair-Game/dp/0393057658/ref=sr_1_99?s=books&ie=UTF8&qid=1522385168&sr=1-99"
    },
    {
        "product_name": "2018 Official Rules of Major League Baseball",
        "description": "An important resource for umpires, coaches, leagues, and serious fans of Major League Baseball (MLB), this handbook lists the dos and don’ts of the national pastime. Fully up-to-date, this book contains the official and sanctioned MLB rules and their interpretations per the Playing Rules Committee, the sole group that determines baseball’s regulations.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Official-Rules-Major-League-Baseball/dp/1629375438/ref=sr_1_101?s=books&ie=UTF8&qid=1522385168&sr=1-101"
    },
    {
        "product_name": "The Baseball Thesaurus",
        "description": "Sluggers deposit Ballantine Blasts in the nosebleeds. A lumberjack sits dead red, hoping for number one in his wheelhouse, only to be crossed up by an Uncle Charlie. A pitcher's mound is divided between the horseshoe and the tabletop.  Baseball is a sport with its own lingo and jargon, a colorful patois developed over decades and millions of games. In this new edition of The Baseball Thesaurus, enhanced with even more rare photos and little-known anecdotes, Jesse Goldberg-Strassler--storyteller, commentator, voice--delves into the language of the National Pastime. From Vin Scully's philosophy on no-hitters to Red Barber's classic turns of phrase and a definitive listing of broadcasters trademark home-run calls. Goldberg-Strassler explains baseball's colorful terms. Why is a bunt called a bunt and why do pitchers warm up in the bullpen? It s all here in an expanded Third Edition.  Who should read The Baseball Thesaurus? It's for the media linguist whose job relies upon baseball jargon, the radio listener, the blog reader, the talk-show caller, the minor-league diehard, the Strat-O-Matic connoisseur, the seventh-inning stretcher, the stereotype breaker, the crank, the postgame fireworks enthusiast, the t-ball coach, the seamhead, the baseball Annie, the hot-stove moper, the bandwagoner, the purist, the casual rooter who enjoys a quick tidbit and has no need to attend both games of a doubleheader, and the fan who takes pride in scoring the game and teaching the tradition to others.  What's new in the third edition of The Baseball Thesaurus? Here are some highlights:  -A deeper dive into the history of All-Star Games, from the picked nine games of 1858 through the Addie Joss benefit to the East-West Classic. -A closer look at baseball caps, including a spotlight on how the pillbox cap has been continually worn by baseball champions. -A section on famous bats from baseball history, from Black Betsy to Heinie Groh s bottle bat to Nap Lajoie's double-knob. -The real reason why a bullpen is called a bullpen, a bunt is called a bunt, and a southpaw is called a southpaw. -The first fielder to wear a baseball glove... and the last fielder to go without wearing a glove. -A full debate on whether a broadcaster should mention a no-hitter, with opinions from Chuck Thompson, Vin Scully, Mel Allen, and Red Barber.  \"A home run is never just a home run,\" says Goldberg-Strassler. \"It's a roundtripper, a four-bagger, a dinger, a tater, or a jack. Baseball s language is unmatched in both its color and its poetry.\"",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Baseball-Thesaurus-Jesse-Goldberg-Strassler/dp/1938532384/ref=sr_1_102?s=books&ie=UTF8&qid=1522385168&sr=1-102"
    },
    {
        "product_name": "Beep: Inside the Unseen World of Baseball for the Blind",
        "description": "In Beep, David Wanczyk illuminates the sport of blind baseball to show us a remarkable version of America’s pastime. With balls tricked out to squeal three times per second, and with bases that buzz, this game of baseball for the blind is both innovative and intense. And when the best beep baseball team in America, the Austin Blackhawks, takes on its international rival, Taiwan Homerun, no one’s thinking about disability. What we find are athletes playing their hearts out for a championship.Wanczyk follows teams around the world and even joins them on the field to produce a riveting inside narrative about the game and its players. Can Ethan Johnston, kidnapped and intentionally blinded as a child in Ethiopia, find a new home in beep baseball, and a spot on the all-star team? Will Taiwan’s rookie MVP Ching-kai Chen—whose superhuman feats on the field have left some veterans suspicious—keep up his incredible play? And can Austin’s Lupe Perez harness his competitive fire and lead his team to a long-awaited victory in the beep baseball world series?Beep is the first book about blind baseball.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Beep-Inside-Unseen-World-Baseball/dp/0804011893/ref=sr_1_103?s=books&ie=UTF8&qid=1522385168&sr=1-103"
    },
    {
        "product_name": "2017 Official Rules of Major League Baseball",
        "description": "An important resource for umpires, coaches, leagues, and serious fans of Major League Baseball (MLB), this handbook lists the dos and don’ts of the national pastime. Fully up-to-date, this book contains the official and sanctioned MLB rules and their interpretations per the Playing Rules Committee, the sole group that determines baseball’s regulations.",
        "ratings": "3.8 out of 5 stars",
        "url": "https://www.amazon.com/Official-Rules-Major-League-Baseball/dp/1629373532/ref=sr_1_104?s=books&ie=UTF8&qid=1522385168&sr=1-104"
    },
    {
        "product_name": "The Cooperstown Casebook: Who's in the Baseball Hall of Fame, Who Should Be In, and Who Should Pack Their Plaques",
        "description": "The National Baseball Hall of Fame and Museum, tucked away in upstate New York in a small town called Cooperstown, is far from any major media market or big league stadium. Yet no sports hall of fame’s membership is so hallowed, nor its qualifications so debated, nor its voting process so dissected.  Since its founding in 1936, the Hall of Fame’s standards for election have been nebulous, and its selection processes arcane, resulting in confusion among voters, not to mention mistakes in who has been recognized and who has been bypassed. Numerous so-called “greats” have been inducted despite having not been so great, while popular but controversial players such as all-time home run leader Barry Bonds and all-time hits leader Pete Rose are on the outside looking in. Now, in The Cooperstown Casebook, Jay Jaffe shows us how to use his revolutionary ranking system to ensure the right players are recognized. The foundation of Jaffe’s approach is his JAWS system, an acronym for the Jaffe WAR Score, which he developed over a decade ago. Through JAWS, each candidate can be objectively compared on the basis of career and peak value to the players at his position who are already in the Hall of Fame. Because of its utility, JAWS has gained an increasing amount of exposure in recent years. Through his analysis, Jaffe shows why the Hall of Fame still matters and how it can remain relevant in the 21st century.",
        "ratings": "4.1 out of 5 stars",
        "url": "https://www.amazon.com/Cooperstown-Casebook-Baseball-Should-Plaques/dp/1250071216/ref=sr_1_105?s=books&ie=UTF8&qid=1522385168&sr=1-105"
    },
    {
        "product_name": "The Plan: Epstein, Maddon, and the Audacious Blueprint for a Cubs Dynasty",
        "description": "On October 12, 2011, Theo Epstein became the new Chicago Cubs president of baseball operations, flipping a switch on the lovable-loser franchise and initiating a plan to accomplish in Chicago what he'd succeeded in as general manager of the Boston Red Sox: ending a World Series drought. It would require a complete team tear-down and turnover, a new farm system foundation of young talent which Epstein and Cubs GM Jed Hoyer gradually added to with gutsy trades and timely signings. After years of rebuilding, Epstein's crystalline vision has been unquestionably realized in the form of one of the most exciting and talented teams in baseball, led by heavyweights like Anthony Rizzo and Kris Bryant as well as visionaries like manager Joe Maddon. In The Plan, David Kaplan of CSN Chicago and ESPN Radio goes behind the scenes with the Cubs and their front office, walking the steps of their captivating rise to becoming 2016 World Series champions. Featuring exclusive interviews with Epstein, owner Tom Ricketts, and other team insiders, this is the definitive account of a new era on the North Side.",
        "ratings": "3.8 out of 5 stars",
        "url": "https://www.amazon.com/Plan-Epstein-Audacious-Blueprint-Dynasty/dp/1629373265/ref=sr_1_106?s=books&ie=UTF8&qid=1522385168&sr=1-106"
    },
    {
        "product_name": "The New Bill James Historical Baseball Abstract",
        "description": "When Bill James published his original Historical Baseball Abstract in 1985, he produced an immediate classic, hailed by the Chicago Tribune as the “holy book of baseball.” Now, baseball's beloved “Sultan of Stats” (The Boston Globe) is back with a fully revised and updated edition for the new millennium.Like the original, The New Bill James Historical Baseball Abstract is really several books in one. The Game provides a century's worth of American baseball history, told one decade at a time, with energetic facts and figures about How, Where, and by Whom the game was played. In The Players, you'll find listings of the top 100 players at each position in the major leagues, along with James's signature stats-based ratings method called “Win Shares,” a way of quantifying individual performance and calculating the offensive and defensive contributions of catchers, pitchers, infielders, and outfielders. And there's more: the Reference section covers Win Shares for each season and each player, and even offers a Win Share team comparison. A must-have for baseball fans and historians alike, The New Bill James Historical Baseball Abstract is as essential, entertaining, and enlightening as the sport itself.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Bill-James-Historical-Baseball-Abstract/dp/0743227220/ref=sr_1_107?s=books&ie=UTF8&qid=1522385168&sr=1-107"
    },
    {
        "product_name": "Hitting Biomechanics",
        "description": "Since the beginning of organized baseball there has been a great deal of material written on the extremely difficult skill of hitting a baseball. Hall of Fame players and former Major League hitting coaches have produced much of this literature, sharing decades of experience from the baseball “trenches” with those who aspire to follow in their profession. However, despite the thousands of publications written over the last hundred years, little information is available on the correct and essential body mechanics required to achieve success at the highest levels of baseball. Biomechanics is the science of measuring and describing human body movement. The purpose of this book is to define the “art” of hitting a baseball using knowledge gained from the science of biomechanical analysis. In 1986 Bio Kinetics Research &amp; Development began conducting biomechanical research to better understand the body mechanics of the best hitters in the game of baseball, captured during live Major League competition. This book addresses the results of those three dimensional analyses that Bio Kinetics performed on hundreds of Major League hitters over the course of three decades. It is important to note that the information presented is NOT based on any past or present hitting theories or a simple two dimensional observation (such as with video or still images), as is the case with almost all prior publications. To the best of our knowledge, the scope and depth of this work is unique, and no other organization currently has both the process and the expertise employed by Bio Kinetics Research &amp; Development. So, how have we accomplished this? The process starts with data capture. Multiple synchronized high speed and high resolution video cameras are used to record hitters in actual game situations. Next, the multiple two dimensional motion sequences are digitized and converted into a single computerized three dimensional motion sequence. Finally, the laws of physics, along with knowledge of exercise physiology and motor learning, are applied to yield an in-depth understanding of the essential patterns of movement, balance and muscular exertion required to successfully hit a major league pitch. It is the science of biomechanics, not simple observation that provides the irrefutable data presented in this book. Under the title of “Pitch Out” various detailed experiences of this 30 year venture are told in each section. The author is well aware of the various “schools of thought” on the correct understanding of hitting mechanics, each with its attending army of vocal proponents and equally vocal opponents! The intention of this publication is neither to praise nor attack prevailing hitting theory, nor to discount anyone’s contribution to the science of hitting. It is important to remember that the evolution of knowledge and understanding of the baseball swing began more than one hundred years ago and many have made positive contributions along the way. Our research, and this book are simply the next step on the path. Three dimensional motion analyses, captured from live competition and compiled over three decades, provides solid evidence of what REALLY happens in the baseball swing, while exposing a tremendous amount of misinformation about the mechanics of hitting as well. This book separates fact from fiction and style from absolute efficient mechanics by presenting cutting edge objective information from those analyses. While the focus of this book is what the best hitters in baseball do, biomechanically, it is important to point out that hitting a baseball is more than simply a mechanical skill. Although often affected by mechanics, the mental, perceptual, and reactional components of this skill are discussed in chapters 9, 10 &amp;11.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Hitting-Biomechanics-Bob-Keyes/dp/1979535949/ref=sr_1_108?s=books&ie=UTF8&qid=1522385168&sr=1-108"
    },
    {
        "product_name": "The New Bill James Historical Baseball Abstract",
        "description": "When Bill James published his original Historical Baseball Abstract in 1985, he produced an immediate classic, hailed by the Chicago Tribune as the “holy book of baseball.” Now, baseball's beloved “Sultan of Stats” (The Boston Globe) is back with a fully revised and updated edition for the new millennium.Like the original, The New Bill James Historical Baseball Abstract is really several books in one. The Game provides a century's worth of American baseball history, told one decade at a time, with energetic facts and figures about How, Where, and by Whom the game was played. In The Players, you'll find listings of the top 100 players at each position in the major leagues, along with James's signature stats-based ratings method called “Win Shares,” a way of quantifying individual performance and calculating the offensive and defensive contributions of catchers, pitchers, infielders, and outfielders. And there's more: the Reference section covers Win Shares for each season and each player, and even offers a Win Share team comparison. A must-have for baseball fans and historians alike, The New Bill James Historical Baseball Abstract is as essential, entertaining, and enlightening as the sport itself.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Bill-James-Historical-Baseball-Abstract/dp/0743227220/ref=sr_1_109?s=books&ie=UTF8&qid=1522385170&sr=1-109"
    },
    {
        "product_name": "Hitting Biomechanics",
        "description": "Since the beginning of organized baseball there has been a great deal of material written on the extremely difficult skill of hitting a baseball. Hall of Fame players and former Major League hitting coaches have produced much of this literature, sharing decades of experience from the baseball “trenches” with those who aspire to follow in their profession. However, despite the thousands of publications written over the last hundred years, little information is available on the correct and essential body mechanics required to achieve success at the highest levels of baseball. Biomechanics is the science of measuring and describing human body movement. The purpose of this book is to define the “art” of hitting a baseball using knowledge gained from the science of biomechanical analysis. In 1986 Bio Kinetics Research &amp; Development began conducting biomechanical research to better understand the body mechanics of the best hitters in the game of baseball, captured during live Major League competition. This book addresses the results of those three dimensional analyses that Bio Kinetics performed on hundreds of Major League hitters over the course of three decades. It is important to note that the information presented is NOT based on any past or present hitting theories or a simple two dimensional observation (such as with video or still images), as is the case with almost all prior publications. To the best of our knowledge, the scope and depth of this work is unique, and no other organization currently has both the process and the expertise employed by Bio Kinetics Research &amp; Development. So, how have we accomplished this? The process starts with data capture. Multiple synchronized high speed and high resolution video cameras are used to record hitters in actual game situations. Next, the multiple two dimensional motion sequences are digitized and converted into a single computerized three dimensional motion sequence. Finally, the laws of physics, along with knowledge of exercise physiology and motor learning, are applied to yield an in-depth understanding of the essential patterns of movement, balance and muscular exertion required to successfully hit a major league pitch. It is the science of biomechanics, not simple observation that provides the irrefutable data presented in this book. Under the title of “Pitch Out” various detailed experiences of this 30 year venture are told in each section. The author is well aware of the various “schools of thought” on the correct understanding of hitting mechanics, each with its attending army of vocal proponents and equally vocal opponents! The intention of this publication is neither to praise nor attack prevailing hitting theory, nor to discount anyone’s contribution to the science of hitting. It is important to remember that the evolution of knowledge and understanding of the baseball swing began more than one hundred years ago and many have made positive contributions along the way. Our research, and this book are simply the next step on the path. Three dimensional motion analyses, captured from live competition and compiled over three decades, provides solid evidence of what REALLY happens in the baseball swing, while exposing a tremendous amount of misinformation about the mechanics of hitting as well. This book separates fact from fiction and style from absolute efficient mechanics by presenting cutting edge objective information from those analyses. While the focus of this book is what the best hitters in baseball do, biomechanically, it is important to point out that hitting a baseball is more than simply a mechanical skill. Although often affected by mechanics, the mental, perceptual, and reactional components of this skill are discussed in chapters 9, 10 &amp;11.",
        "ratings": "5.0 out of 5 stars",
        "url": "https://www.amazon.com/Hitting-Biomechanics-Bob-Keyes/dp/1979535949/ref=sr_1_110?s=books&ie=UTF8&qid=1522385170&sr=1-110"
    },
    {
        "product_name": "The Softball Drill Book",
        "description": "   Packed with 175 drills straight from the practice sessions of the game's most successful programs, The Softball Drill Book will add variety to your practices and precision to your game-day performances. The comprehensive collection covers every aspect of the game. From warm-up to conditioning, throwing to hitting, bunting to base-running, you'll find drills to improve position skill and team execution - all from college coaches and programs that have won 13 NCAA Women's College World Series titles and dozens of NCAA regional tournament titles. Contributors include:-Louie Berndt, Florida State-Carol Bruggeman, Louisville-Yvette Girouard, Louisiana State-Michelle Gromacki, Cal State Fullerton-Deanna Gumpf, Notre Dame-Carol Hutchins, Michigan-Kelly Inouye-Perez, UCLA-Jay Miller, Mississippi State-Jennifer Ogee, Nebraska-Kim Sowder, Long Beach State-Heather Tarr, Washington-Michelle Venturella, Iowa-Kirk Walker, Oregon State-Margie Wright, Fresno StateOne look at the names above and it is clear, The Softball Drill Book is your blueprint for championship practices.  ",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Softball-Drill-Book-Kirk-Walker/dp/0736060707/ref=sr_1_111?s=books&ie=UTF8&qid=1522385170&sr=1-111"
    },
    {
        "product_name": "Red Sox Fans Are from Mars, Yankees Fans Are from Uranus: Why Red Sox Fans Are Smarter, Funnier, and Better Looking (In Language Even Yankee Fans Can Understand)",
        "description": "A tongue-in-cheek look at the complicated love-hate relationship between Red Sox and Yankees fans, how and why it developed, what accounts for the animosity and the grudging respect, and why it and continues to dominate the baseball landscape, this book provides the only well-constructed tutorial on how both tribes can peaceably coexist. With only around 200 miles of terra firma dividing the two capitals of the \"Empire\" and the \"Nation\" Wasif attempts to bring peace to the Northeast through understanding. The humorous book also has key terms, charts, testimonials, quizzes, and even drawings that will save fans from emotional distress and time-consuming arguments.",
        "ratings": "4.4 out of 5 stars",
        "url": "https://www.amazon.com/Red-Fans-Mars-Yankees-Uranus/dp/1600783473/ref=sr_1_112?s=books&ie=UTF8&qid=1522385170&sr=1-112"
    },
    {
        "product_name": "100 Things Cardinals Fans Should Know &amp; Do Before They Die (100 Things...Fans Should Know)",
        "description": "With 125 years of Cardinals history, this lively, detailed book explores the personalities, events, and facts every St. Louis fan should know. It contains crucial information such as important dates, player nicknames, memorable moments, singular achievements, and signature calls. This updated guide to all things Cardinals covers the artifact on public display that pays homage to Busch Stadium, the story behind the infamous \"kidnapping\" of Flint Rhem, the unforgettable acrobatics of \"The Wizard\" Ozzie Smith, and details on all 11 World Series championships,&nbsp;including the&nbsp;amazing 2011 triumph.",
        "ratings": "4.9 out of 5 stars",
        "url": "https://www.amazon.com/Things-Cardinals-Fans-Should-Before/dp/160078755X/ref=sr_1_113?s=books&ie=UTF8&qid=1522385170&sr=1-113"
    },
    {
        "product_name": "The Year of the Pitcher: Bob Gibson, Denny McLain, and the End of Baseball’s Golden Age",
        "description": "The Year of the Pitcher&nbsp;is the story of the remarkable 1968&nbsp;baseball season, which culminated in one of the greatest World Series contests ever, with the Detroit Tigers coming back from a 3-1 deficit to beat the Cardinals in Game Seven of the World Series. In 1968, two remarkable pitchers would dominate the game as well as the broadsheets. One was black, the other white. Bob Gibson, together with the St. Louis Cardinals, embodied an entire generation's hope for integration at a heated moment in American history. Denny McLain, his adversary, was&nbsp;a crass self-promoter who eschewed the team charter and his Detroit Tigers teammates to zip cross-country in his own plane. For one season, the nation watched as these two men and their teams swept their respective league championships to meet at the World Series. Gibson set a major league record that year with a 1.12 ERA. McLain won more than 30 games in 1968, a feat not achieved since 1934 and untouched since. Together, the two have come to stand as iconic symbols, giving the fans \"The Year of the Pitcher\"&nbsp;and changing the game.&nbsp;Evoking a nostalgic season and its incredible characters,&nbsp;this is the story of one of the great rivalries in sports and an indelible portrait of the national pastime during a turbulent year--and the two men who electrified fans from all walks of life.",
        "ratings": "4.1 out of 5 stars",
        "url": "https://www.amazon.com/Year-Pitcher-Gibson-McLain-Baseballs/dp/0547719272/ref=sr_1_114?s=books&ie=UTF8&qid=1522385170&sr=1-114"
    },
    {
        "product_name": "Youth Baseball Drills",
        "description": "     Coaches know the importance of drills. The cornerstone of most practices, they are essential in developing player skills and team execution. For younger players, however, the best drills go one step further. They engage the player, promote teamwork, and establish a lifelong love of the game.   Youth Baseball Drills is a comprehensive collection of more than 100 of the very best team drills for young players and their coaches. Developed specifically for players aged 6 to 18, the drills teach and reinforce fundamental skills such as these:   • Hitting   • Bunting   • Fielding   • Catching fly balls   • Throwing   • Pitching   • Base running   Easy to understand and easier to implement, each drill is accompanied by step-by-step instructions, equipment needs, field diagrams, and key coaching points. And the ready-to-use 30-, 60-, and 90-minute practice plans help coaches put them to use and create enjoyable and productive practices.   With variations and progressions for difficulty, Youth Baseball Drills has something for every coach and every player. It is a must-have guide for anyone wanting to teach youngsters how to play, and enjoy, the game of baseball.   ",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Youth-Baseball-Drills-Peter-Caliendo/dp/1450460283/ref=sr_1_115?s=books&ie=UTF8&qid=1522385170&sr=1-115"
    },
    {
        "product_name": "100 Things Dodgers Fans Should Know &amp; Do Before They Die (100 Things...Fans Should Know)",
        "description": "With traditions, records, and team lore, this lively, detailed book explores the personalities, events, and facts every Dodgers fan should know. This guide to all things Dodgers covers the team's history in Brooklyn and Los Angeles, the incredible legacy of Jackie Robinson, memories from Ebbets Field, Dodger Adult Baseball Camp, and why fans think the Dodgers invented the high-five. This revised and updated edition also features new entries on the team's ownership change; manager Don Mattingly; and young stars Matt Kemp, Andre Ethier, and Clayton Kershaw. Lifelong Dodgers fan and author Jon Weisman has collected every essential piece of Dodgers knowledge and trivia, as well as must-do activities, and ranks them all from 1 to 100, providing an entertaining and easy-to-follow checklist for fans of all ages.",
        "ratings": "4.5 out of 5 stars",
        "url": "https://www.amazon.com/Things-Dodgers-Fans-Should-Before/dp/1600788041/ref=sr_1_116?s=books&ie=UTF8&qid=1522385170&sr=1-116"
    },
    {
        "product_name": "The Keys to the Batter's Box",
        "description": "Get ready to laugh hysterically! This book is a real-life account of dugout banter between Shawn Powell and the four teenage batboys of the Birmingham Barons. Based on Powell's Facebook blogs, 'Batboy Conversations',these true stories demonstrate the humongous gap between the teenagers of today's generation and a guy who grew up with a rotary phone and the Atari game PONG. The stars of the book--Hub Roberts and Anton Wheeler--share their thoughts, theories, and insights on the zaniest subjects imaginable. Make sure you have hanky handy, because this book is filled with laughter, love and a whole lot of fun!",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Keys-Batters-Box-Shawn-Powell/dp/1595985964/ref=sr_1_117?s=books&ie=UTF8&qid=1522385170&sr=1-117"
    },
    {
        "product_name": "Dick Bosman on Pitching: Lessons from the Life of a Major League Ballplayer and Pitching Coach",
        "description": "Dick Bosman’s career in Major League Baseball as a player and coach has spanned more than 50 years. He pitched eleven seasons in the American League, was the Major League pitching coach for multiple teams, and has served as a minor league pitching coordinator for the Tampa Bay Rays since 2001. Throughout his years in baseball, Bosman has developed a distinct pitching philosophy and astute insights into the cat-and-mouse game between hitter and pitcher. In Dick Bosman on Pitching: Lessons from the Life of a Major League Ballplayer and Pitching Coach, author Ted Leavengood examines Bosman’s life in baseball, from his winning the ERA title in the American League in 1969 and his no-hitter in 1974 to his current coaching position with the Tampa Bay Rays. For those wanting an inside look at the essentials of pitching, Leavengood includes insights and tips from Bosman throughout the book, compiled through hours of personal interviews. Bosman has worked for and with some of the best pitchers and coaches in major league baseball, and he not only shares stories from their time together but also the many things he learned from them about the game.Dick Bosman has found enormous success working with young ballplayers at all levels and fostered innovations—such as his signature slide step—that have impacted pitching in today’s game. With personal anecdotes from Bosman, his teammates, and those he coached, Dick Bosman on Pitching will entertain and inform young pitchers as well as baseball fans of all generations. ",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Dick-Bosman-Pitching-Lessons-Ballplayer/dp/1538106612/ref=sr_1_118?s=books&ie=UTF8&qid=1522385170&sr=1-118"
    },
    {
        "product_name": "Ball Four: Twentieth Anniversary Edition",
        "description": "Twentieth-anniversary edition of a baseball classic, with a new epilogue by Jim Bouton.When first published in 1970, Ball Four stunned the sports world. The commissioner, executives, and players were shocked. Sportswriters called author Jim Bouton a traitor and \"\"social leper.\"\" Baseball commissioner Bowie Kuhn tried to force him to declare the book untrue. Fans, however, loved the book. And serious critics called it an important social document. Today, Jim Bouton is still not invited to Oldtimer's Days at Yankee Stadium. But his landmark book is still being read by people who don'tordinarily follow baseball.",
        "ratings": "4.3 out of 5 stars",
        "url": "https://www.amazon.com/Ball-Four-Anniversary-Jim-Bouton/dp/0020306652/ref=sr_1_119?s=books&ie=UTF8&qid=1522385170&sr=1-119"
    },
    {
        "product_name": "Tales from the Dodgers Dugout: A Collection of the Greatest Dodgers Stories Ever Told (Tales from the Team)",
        "description": "To baseball fans of today, the name “Dodgers” is synonymous with Hollywood, the warm California sun, and names like Tommy Lasorda, Kirk Gibson, Steve Garvey, and Orel Hershiser. The Dodgers mean much more than that to fans of baseball history, however. Namely, these fans remember the famed “Boys of Summer,” otherwise known as the Brooklyn Dodgers, a team that included some of the most storied players in baseball history, such as Hall of Famers Duke Snider, Roy Campanella, Gil Hodges, Pee Wee Reese, and Jackie Robinson. Although they eventually moved out west, the Brooklyn Dodgers provided some of the greatest moments the game has ever seen and some of the greatest personalities to ever take the field. Carl Erskine, another member of that legendary team, relates memories about his days with the Dodgers in a book full of true stories and revealing anecdotes. The result is Tales from the Dodgers Dugout, first published in 2004 and newly updated to provide a delightfully interesting trip through the world of baseball in the 1950s. Among Erskine’s many tales are his dealings with immortal team official Branch Rickey, his view from the Dodgers bench during Don Larsen’s perfect game in the 1956 World Series, and his firsthand experiences when Jackie Robinson broke the color barrier and became the first black player in Major League Baseball history. During his frequent speaking engagements, people often ask Erskine if all of his stories are true. His standard response has been, “Yes, I couldn’t possibly make them up the way they actually happened.” Now fans can read all of those great stories in Tales from the Dodgers Dugout. ",
        "ratings": "4.7 out of 5 stars",
        "url": "https://www.amazon.com/Tales-Dodgers-Dugout-Collection-Greatest/dp/1683580265/ref=sr_1_120?s=books&ie=UTF8&qid=1522385170&sr=1-120"
    },
    {
        "product_name": "The Yogi Book",
        "description": "Celebrate one of the greatest and most beloved baseball players who ever lived—and certainly the most quoted. The Yogi Book is the New York Times bestseller filled with Yogi Berra’s immortal sayings, plus photographs, a career timeline, and appreciations by some of his greatest fans, including Billy Crystal and Tim McCarver. Yogi Berra's gift for saying the smartest things in the funniest, most memorable ways has made him a legend. The Yogi Book brings all of his famous quotes together in one place—and even better, gives the story behind them. \"It ain't over till it's over.\"—that’s Yogi's answer to a reporter when he was managing the Mets in July 1973, and they were nine games out of first place (not only quotable, but prophetic—they won the pennant). \"Nobody goes there anymore. It's too crowded.\"—Yogi's comment to Stan Musial and Joe Garagiola about Ruggeri's restaurant in St. Louis in 1959. \"It gets late early out there.\"—Yogi describing how shadows crept across Yankee Stadium's left field during late autumn afternoons. &nbsp;",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Yogi-Book-Berra/dp/0761154434/ref=sr_1_121?s=books&ie=UTF8&qid=1522385173&sr=1-121"
    },
    {
        "product_name": "Casey Stengel: Baseball's Greatest Character",
        "description": "The definitive biography of one of baseball's most enduring and influential characters, from New York Times&nbsp;bestselling author and baseball writer Marty Appel.As a player, Charles Dillon \"Casey\" Stengel's contemporaries included Babe Ruth, Honus Wagner, and Christy Mathewson . . . and he was the only person in history to wear the uniforms of all four New York teams: the Dodgers, Giants, Yankees, and Mets. As a legendary manager, he formed indelible, complicated relationships with Yogi Berra, Joe DiMaggio, Mickey Mantle, and Billy Martin. For more than five glorious decades, Stengel was the undisputed, quirky, hilarious, and beloved face of baseball--and along the way he revolutionized the role of manager while winning a spectactular ten pennants and seven World Series Championships. &nbsp;But for a man who spent so much of his life in the limelight--an astounding fifty-five years in professional baseball--Stengel remains an enigma. Acclaimed New York Yankees' historian and bestselling author Marty Appel digs into Casey Stengel's quirks and foibles, unearthing a tremendous trove of baseball stories, perspective, and history. Weaving in never-before-published family documents, Appel creates an intimate portrait of a private man who was elected into the Baseball Hall of Fame in 1966 and named \"Baseball's Greatest Character\" by MLB Network's Prime 9. Casey Stengel&nbsp;is a biography that will be treasured by fans of our national pastime.",
        "ratings": "4.6 out of 5 stars",
        "url": "https://www.amazon.com/Casey-Stengel-Baseballs-Greatest-Character/dp/0385540477/ref=sr_1_122?s=books&ie=UTF8&qid=1522385173&sr=1-122"
    },
    {
        "product_name": "The Cloudbuster Nine: The Untold Story of Ted Williams and the Baseball Team That Helped Win World War II",
        "description": "In 1943, while the New York Yankees and St. Louis Cardinals were winning pennants and meeting in that year's World Series, one of the nation's strongest baseball teams practiced on a skinned-out college field in the heart of North Carolina. Ted Williams, Johnny Pesky, and Johnny Sain were among a cadre of fighter-pilot cadets who wore the Cloudbuster Nine baseball jersey at an elite Navy training school at the University of North Carolina at Chapel Hill. As a child, Anne Keene's father, Jim Raugh, suited up as the team batboy and mascot. He got to know his baseball heroes personally, watching players hit the road on cramped, tin-can buses, dazzling factory workers, kids, and service members at dozens of games, including a war-bond exhibition with Babe Ruth at Yankee Stadium.Jimmy followed his baseball dreams as a college All-American but was crushed later in life by a failed major-league bid with the Detroit Tigers. He would have carried this story to his grave had Anne not discovered his scrapbook from a Navy school that shaped America's greatest heroes including George H.W. Bush, Gerald Ford, John Glenn, and Paul \"Bear\" Bryant. With the help of rare images and insights from World War II baseball veterans such as Dr. Bobby Brown and Eddie Robinson, the story of this remarkable team is brought to life for the first time in The Cloudbuster Nine: The Untold Story of Ted Williams and the Baseball Team That Helped Win World War II.",
        "ratings": "There are no customer reviews yet.",
        "url": "https://www.amazon.com/Cloudbuster-Nine-Untold-Williams-Baseball/dp/1683582071/ref=sr_1_123?s=books&ie=UTF8&qid=1522385173&sr=1-123"
    }
]